export const data = {
  masculineSuffix: "л",
  feminineSuffix: "л",
  paradigm: {
    "ець": "ка",
    "ьцеві": "ці",
    "ьцем": "кою",
    "ьці": [
      "ки",
      "ці"
    ],
    "ьців": "ок",
    "ьцю": [
      "ці",
      "ко"
    ],
    "ьця": [
      "ки",
      "ку"
    ],
    "ьцям": "кам",
    "ьцями": "ками",
    "ьцях": "ках"
  },
  roots: [
    "агу",
    "анго",
    "бенга",
    "венесуе",
    "вестфа",
    "гватема",
    "комсомо",
    "латга",
    "народово",
    "непа",
    "португа",
    "прованса",
    "самохва",
    "сейше",
    "сенега",
    "синга",
    "тубі"
  ]
};