export const data = {
  masculineSuffix: "яр",
  feminineSuffix: "яр",
  paradigm: {
    "": "ка",
    "а": [
      "ки",
      "ку"
    ],
    "ам": "кам",
    "ами": "ками",
    "ах": "ках",
    "е": "ко",
    "еві": "ці",
    "ем": "кою",
    "і": [
      "ки",
      "ці"
    ],
    "ів": "ок",
    "у": "ці"
  },
  roots: [
    "арф'",
    "бавовн",
    "бетон",
    "вугл",
    "газет",
    "до",
    "зелен",
    "камен",
    "карт",
    "кахл",
    "ковзан",
    "конопл",
    "кресл",
    "лихв",
    "мебл",
    "мітл",
    "пісн",
    "повст",
    "свердл",
    "сект",
    "смітт",
    "сол",
    "фіґл",
    "цегл",
    "човн",
    "школ"
  ]
};