[
  {
    "new": null,
    "title": "«о»",
    "old": [
      "1"
    ],
    "minor": [
      "Зникли правила правопису ненаголошеного «о»: імовірно, цей параграф не має сенсу в контексті української мови як самостійної."
    ],
    "major": null
  },
  {
    "new": 1,
    "title": "«е», «и»",
    "old": [
      "2.1"
    ],
    "minor": null,
    "major": null
  },
  {
    "new": null,
    "title": "«е», «и», «і»",
    "old": [
      "2.2",
      "2.3"
    ],
    "minor": [
      "Зникли пункти про те, що «е» завжди слід писати у групах «-ере-» та «-еле-», у суфіксах «-еня-», «-ен-», «-енк-», «-еньк-», «-ер(о)», «-есеньк-», «-ечк-», «-тель» та коли «е» при зміні слова випадає і ніколи у групах «-ри-», «-ли-», «-рі-», «-лі-» між приголосними у відкритих складах."
    ],
    "major": null
  },
  {
    "new": 2,
    "title": "«і», «и» на початку слова",
    "old": [
      "3"
    ],
    "minor": [
      "Згадано кілька рідковживаних слів, що, ймовірно, мали б писатися через «и» й раніше."
    ],
    "major": [
      {
        "description": "Слова «ірій», «ірод», «іч» та похідні від них можна писати через «и».",
        "examples": [
          [
            "optional",
            "ірій",
            "ирій"
          ],
          [
            "optional",
            "іродівський",
            "иродівський"
          ],
          [
            "optional",
            "іч",
            "ич"
          ]
        ]
      },
      {
        "description": "Останню частину імені Кім Чен Ина слід писати через «И».",
        "examples": [
          [
            "compulsory",
            "Кім Чен Ін",
            "Кім Чен Ин"
          ]
        ]
      }
    ]
  },
  {
    "new": 3,
    "title": "«ї»",
    "old": [
      "4"
    ],
    "minor": null,
    "major": null
  },
  {
    "new": 4,
    "title": "«я», «ю», «є»",
    "old": [
      "5"
    ],
    "minor": [
      "Прибрано згадку про виняток «війя»."
    ],
    "major": null
  },
  {
    "new": 5,
    "title": "«г»",
    "old": [
      "14"
    ],
    "minor": null,
    "major": null
  },
  {
    "new": 6,
    "title": "«ґ»",
    "old": [
      "15"
    ],
    "minor": [
      "З’явилася згадка слів «ґерґелі», «ґонт(а)», «ґуральня», «дриґати», «ремиґати».",
      "Зникла примітка про вимову власних назв іноземного походження."
    ],
    "major": [
      {
        "description": "Топоніми «Ґорґани», «Ґоронда» та «Уґля» пишуться через «ґ».",
        "examples": [
          [
            "compulsory",
            "Горгани",
            "Ґорґани"
          ],
          [
            "compulsory",
            "горондівський",
            "ґорондівський"
          ],
          [
            "compulsory",
            "в Углі",
            "в Уґлі"
          ]
        ]
      },
      {
        "description": "Прізвища «Ґалятовський», «Ґеник», «Ґерзанич», «Ґердан», «Ґжицький», «Ґиґа», «Ґоґа», «Ґойдич», «Ґонта», «Ґриґа», «Ґула», «Ломаґа» мають писатися через «ґ».",
        "examples": [
          [
            "compulsory",
            "Галятовський",
            "Ґалятовський"
          ],
          [
            "compulsory",
            "Геникові",
            "Ґеникові"
          ],
          [
            "compulsory",
            "з Ломагою",
            "з Ломаґою"
          ]
        ]
      }
    ]
  },
  {
    "new": 7,
    "title": "апостроф",
    "old": [
      "6"
    ],
    "minor": [
      "З’явилася згадка про слово «Лук’ян» та похідні від нього.",
      "Зникла згадка про написання «пів» із власними назвами."
    ],
    "major": null
  },
  {
    "new": 8,
    "title": "«йо», «ьо»",
    "old": [
      "7"
    ],
    "minor": null,
    "major": null
  },
  {
    "new": 9,
    "title": "чергування «о» — «і», «е» — «і»",
    "old": [
      "8"
    ],
    "minor": null,
    "major": null
  },
  {
    "new": 10,
    "title": "чергування «е» — «о»",
    "old": [
      "9"
    ],
    "minor": [
      "Згадано альтернативний варіант «-и» закінчення в іменниках жіночого роду III відміни."
    ],
    "major": null
  },
  {
    "new": 11,
    "title": "чергування «о» — «а», «е» — «і», «е» — «и»",
    "old": [
      "10"
    ],
    "minor": null,
    "major": null
  },
  {
    "new": 12,
    "title": "чергування «г»/«к»/«х» — «з»/«ц»/«с»",
    "old": null,
    "minor": [
      "Згадано чергування «г», «к», «х» із м’якими «з», «ц», «с» у давальному та місцевому відмінку однини окремих іменників."
    ],
    "major": null
  },
  {
    "new": 13,
    "title": "чергування «ґ» — «з»",
    "old": null,
    "minor": [
      "Згадано чергування «ґ» із м’яким «з» у давальному та місцевому відмінку однини іменників I відміни."
    ],
    "major": null
  },
  {
    "new": 14,
    "title": "чергування «г»/«к»/«х» — «ж»/«ч»/«ш»",
    "old": [
      "80.4",
      "80.6"
    ],
    "minor": [
      "Згадано чергування «г», «к», «х» із «ж», «ч», «ш» в іменниках зі значенням пестливості, у кличному відмінку окремих іменників, в особових формах та формах наказового способу дієслів, а також у пасивних дієприкметниках."
    ],
    "major": null
  },
  {
    "new": 15,
    "title": "чергування «д» — «дж»",
    "old": [
      "80.5",
      "80.6"
    ],
    "minor": [
      "Згадано чергування «д» із «дж» у першій особі однини дієслів та в пасивних дієприкметниках."
    ],
    "major": null
  },
  {
    "new": 16,
    "title": "чергування «т» — «ч», «з» — «ж», «с» — «ш», «зд» — «ждж», «ст» — «щ»",
    "old": [
      "80.4",
      "80.5",
      "80.6"
    ],
    "minor": [
      "Згадано чергування «т» із «ч», «з» із «ж», «с» із «ш», «зд» із «ждж», «ст» із «щ» у першій особі однини дієслів та в пасивних дієприкметниках."
    ],
    "major": null
  },
  {
    "new": 17,
    "title": "чергування «ст» — «щ»",
    "old": [
      "80.4",
      "80.5",
      "80.6"
    ],
    "minor": [
      "Фактично дублюється частина попереднього параграфа."
    ],
    "major": null
  },
  {
    "new": 18,
    "title": "поява «л» після губних",
    "old": [
      "80.6 (примітка)"
    ],
    "minor": [
      "Згадано чергування «б» із «бл», «п» із «пл», «в» із «вл», «м» із «мл», «ф» із «фл» у першій особі однини і третій особі множини дієслів та в пасивних дієприкметниках."
    ],
    "major": null
  },
  {
    "new": 19,
    "title": "чергування приголосних перед «-ськ-», «-ств-»",
    "old": [
      "18.2"
    ],
    "minor": [
      "Додано винятки «герцогський», «шахський» і «цюрихський».",
      "Із прикладів вилучено слово «птаство»."
    ],
    "major": null
  },
  {
    "new": 20,
    "title": "чергування у вищому ступені порівняння",
    "old": [
      "18.3"
    ],
    "minor": [
      "Прибрано згадку про похідні від прикметників дієслова на кшталт «вужчати» та іменників на кшталт «підвищення»."
    ],
    "major": null
  },
  {
    "new": 21,
    "title": "чергування приголосних перед «-н-»",
    "old": [
      "18.4"
    ],
    "minor": [
      "Додано згадку про чергування перед «-н-» «г»/«х» із «ж»/«ш».",
      "Прибрано примітки про збереження на письмі приголосних у словах на кшталт «дочці» та дзвінкості / глухості на письмі приголосних у словах на кшталт «боротьба» та «бабка» разом із винятками."
    ],
    "major": null
  },
  {
    "new": 22,
    "title": "чергування перед голосним у суфіксі",
    "old": [
      "18.1",
      "23.4 (примітка)"
    ],
    "minor": [
      "Додано коментар про перетворення «-ськ-» на «-ч-» у словах на кшталт «солдатчина».",
      "Прибрано абзац про чергування груп «-ск-», «-ст-» із «-щ-» та «-зк-» із «-жч-».",
      "Додано коментар про чергування у парах на кшталт «друг»/«дружити», «крик»/«кричати», «сухий»/«сушити»."
    ],
    "major": null
  },
  {
    "new": 23,
    "title": "прийменники та префікси «у»/«в»",
    "old": [
      "11"
    ],
    "minor": [
      "Додано уточнення, що після голосного пишемо «в» у словах на кшталт «вважати», «вві», «ввісьмох».",
      "Уточнено, що «в» слід ставити і у випадках, коли попереднє слово скорочене (але закінчується на голосну).",
      "Додано примітку, що трапляються відхилення від правила чергування «у»/«в», спричинені вимогами ритмомелодики або мовними вподобаннями автора."
    ],
    "major": [
      {
        "description": "Після слова, що завершується на приголосний, перед словом, що починається на голосний, ставимо «в».",
        "examples": [
          [
            "compulsory",
            "Зайшов у аптеку.",
            "Зайшов в аптеку."
          ],
          [
            "compulsory",
            "Збільшмо ікс у ігрек разів.",
            "Збільшмо ікс в ігрек разів."
          ]
        ]
      },
      {
        "description": "Перед абревіатурою, у назві першої букви якої вимовляють голосний, слід ставити прийменник «в» (судячи з поданих у правописі прикладів, це може стосуватися лише випадку, коли назва літери починається на голосний).",
        "examples": [
          [
            "compulsory",
            "Він працював у МЗС.",
            "Він працював в МЗС."
          ],
          [
            "compulsory",
            "Відповідь надішлють у НБУ.",
            "Відповідь надішлють в НБУ."
          ]
        ]
      }
    ]
  },
  {
    "new": 24,
    "title": "«і»/«й» на початку слів",
    "old": [
      "12"
    ],
    "minor": [
      "Додано примітку, що трапляються відхилення від правила чергування «і»/«й», спричинені вимогами ритму або мовними вподобаннями автора.",
      "Прибрано вимогу ставити «і» після паузи незалежно від подальшого тексту."
    ],
    "major": [
      {
        "description": "Після слова, що закінчується на «й», «я», «ю», «є», «ї», слід вживати сполучники «і» або «та» (судячи з поданих прикладів, це стосується лише випадку, коли «я», «ю», «є», «ї» позначають два звуки, а не пом’якшують попередній приголосний).",
        "examples": [
          [
            "compulsory",
            "мрії й обережні прогнози",
            "мрії і обережні прогнози"
          ],
          [
            "compulsory",
            "Інна подолала депресію й вийшла на роботу.",
            "Інна подолала депресію та вийшла на роботу."
          ]
        ]
      }
    ]
  },
  {
    "new": 25,
    "title": "«з»/«зі»/«зо»",
    "old": [
      "13"
    ],
    "minor": [
      "Додано примітку, що в певних контекстах «із» та «зі» можуть бути взаємозамінними.",
      "Додано примітку, що трапляються відхилення від правила чергування «з»/«із»/«зі», спричинені вимогами ритмомелодики або мовними вподобаннями автора."
    ],
    "major": [
      {
        "description": "На початку речення перед літерами «з», «ц», «ч», «щ» замість прийменника «З» пишемо «Із» або (альтернативно і лише перед сполученням приголосних звуків) «Зі».",
        "examples": [
          [
            "compulsory",
            "З цілої низки причин він звільнився.",
            "Із цілої низки причин він звільнився."
          ],
          [
            "compulsory",
            "З щоденника Довженка",
            "Зі щоденника Довженка"
          ]
        ]
      },
      {
        "description": "Після свистячих та шиплячих (що не входять у сполучення приголосних) перед голосним замість «із» слід писати «з».",
        "examples": [
          [
            "compulsory",
            "водолаз із Одеси",
            "водолаз з Одеси"
          ],
          [
            "compulsory",
            "Алла поспішала на зустріч із Антоном.",
            "Алла поспішала на зустріч з Антоном."
          ]
        ]
      }
    ]
  },
  {
    "new": 26,
    "title": "коли пишуть м’який знак",
    "old": [
      "16"
    ],
    "minor": [
      "Уточнено, що у формах на кшталт «бур» (від «буря») та «зір» (від «зоря») після «р» м’якого знака немає."
    ],
    "major": null
  },
  {
    "new": 27,
    "title": "коли не пишуть м’який знак",
    "old": [
      "17"
    ],
    "minor": [
      "До прикладів додано, зокрема, слово «гирка» (зменш. до «гиря») та форми «ларка» (від «ларьок») та «царка» (від «царьок»).",
      "Прибрано суфікс «-ств(о)» з числа таких, що між «н» та ними не слід писати м’який знак."
    ],
    "major": null
  },
  {
    "new": 28,
    "title": "спрощення в сполученнях приголосних",
    "old": [
      "19"
    ],
    "minor": [
      "Зі списку винятків зникло слово «хворостняк» та додалося слово «дев’яностники»."
    ],
    "major": null
  },
  {
    "new": 29,
    "title": "подвоєння при збігу приголосних",
    "old": [
      "20.1",
      "20.2",
      "20.3"
    ],
    "minor": [
      "Згадано суфікс «-янн-» прикметників старослов’янського походження з прикладом «окаянний».",
      "Згадано прикметники дієприкметникового походження «жаданий», «навіжений», «скажений», «шалений»."
    ],
    "major": [
      {
        "description": "Слово «священник» (і, як наслідок, похідні від нього) слід писати з подвоєнням «н».",
        "examples": [
          [
            "compulsory",
            "священик",
            "священник"
          ],
          [
            "compulsory",
            "священики-цілителі",
            "священники-цілителі"
          ]
        ]
      }
    ]
  },
  {
    "new": 30,
    "title": "подовження приголосних",
    "old": [
      "20.4"
    ],
    "minor": null,
    "major": null
  },
  {
    "new": 31,
    "title": "правопис префіксів",
    "old": [
      "21"
    ],
    "minor": [
      "Зникла згадка префіксів «од-» і «пред-».",
      "Додано можливе значення неповноти ознаки для префікса «при-» (із прикладом «пристаркуватий»).",
      "Додано згадку префікса «архі-» у словах на кшталт «архіважливий» та «архімільйонер».",
      "Додано згадку префіксів «анти-» та «квазі-»."
    ],
    "major": [
      {
        "description": "У назвах церковних звань, титулів та чинів можна паралельно вживати префікси «архі-» та «архи-».",
        "examples": [
          [
            "optional",
            "архідиякон",
            "архидиякон"
          ],
          [
            "optional",
            "архієпископський",
            "архиєпископський"
          ]
        ]
      }
    ]
  },
  {
    "new": 32,
    "title": "іменникові суфікси",
    "old": [
      "22"
    ],
    "minor": [
      "Зникла згадка префіксів «-чик» («хлопчик») та «-щик» («прапорщик»)."
    ],
    "major": [
      {
        "description": "Слово «мариво» (і, як наслідок, похідні від нього) слід писати через «и».",
        "examples": [
          [
            "compulsory",
            "марево",
            "мариво"
          ],
          [
            "compulsory",
            "маревіти",
            "маривіти"
          ]
        ]
      },
      {
        "description": "Новий правопис підкреслює можливість ужитку на означення осіб жіночої статі іменників, утворених за допомогою суфіксів «-к-», «-иц-», «-ин-» та «-ес-».",
        "examples": [
          [
            "optional",
            "автор",
            "авторка"
          ],
          [
            "optional",
            "порадник",
            "порадниця"
          ],
          [
            "optional",
            "філолог",
            "філологиня"
          ]
        ]
      },
      {
        "description": "Правильне написання чоловічого по батькові від імені «Ігор» — «Ігорьович».",
        "examples": [
          [
            "compulsory",
            "Ігорович",
            "Ігорьович"
          ]
        ]
      },
      {
        "description": "З коренями українського походження, що закінчуються не на один зі звуків «д», «т», «з», «с», «ц», «ж», «ч», «ш», «р», вживаємо суфікси «-іст», «-ізм» через «і».",
        "examples": [
          [
            "compulsory",
            "більшовизм",
            "більшовізм"
          ],
          [
            "compulsory",
            "боротьбист",
            "боротьбіст"
          ],
          [
            "compulsory",
            "кучкист",
            "кучкіст"
          ]
        ]
      }
    ]
  },
  {
    "new": 33,
    "title": "прикметникові та дієприкметникові суфікси",
    "old": [
      "23"
    ],
    "minor": [
      "Зауважено, що «-н-» — один з основних прикметникових суфіксів, приєднуваний до основ іншомовних іменників на «-ія».",
      "Зникла примітка про подвоєння приголосного внаслідок поєднання основи на «-н» із суфіксом «-н-».",
      "Зник пункт про суфікси «-анн-», «-енн-», «-ан-» та «-ен-», що фактично дублює один із пунктів § 29 (у старому правописі — § 20.2).",
      "Уточнено, що суфікси «-ист-», «-їст-» вказують на інтенсивний вияв ознаки.",
      "Уточнено, що суфікси «-ов-», «-ев-», «-єв-» для утворення присвійних прикметників можуть поєднуватися лише з іменниками чоловічого роду II відміни.",
      "Внесено поправку, що суфікси «-ов-», «-ев-», «-єв-» чергуються з «-ів-» та «-їв-» не в присвійних прикметниках чоловічого роду, а в закритому складі."
    ],
    "major": null
  },
  {
    "new": 34,
    "title": "дієслівні суфікси",
    "old": [
      "24"
    ],
    "minor": [
      "Уточнено, що суфікс «овува» може мати форму «ьовува» і використовується в дієсловах та похідних від них іменниках та дієприкметниках."
    ],
    "major": null
  },
  {
    "new": 35,
    "title": "сполучні «о», «е», «є»",
    "old": [
      "25"
    ],
    "minor": [
      "Прибрано коментар про те, що слова на кшталт «вищезгаданий» утворено від прислівника («вище»), а не від прикметника («вищий»).",
      "Прибрано згадку винятків «кожум’яка» та «очевидний» (основи яких поєднуються не за допомогою «-о-», хоча перша основа й закінчується на шиплячий), проте додано «дружелюбний», «ножетримач» і «Січеслав».",
      "Виправлено написання «коногон» на «коногін».",
      "Подано велику кількість додаткових прикладів складних слів без сполучного звука.",
      "До списку перших компонентів, слова з якими слід писати разом, додано «абро-», «аеро-», «аква-», «алко-», «анти-», «астро-», «аудіо-», «дендро-», «еко-», «етно-», «євро-», «інако-», «іншо-», «нарко-», «онко-», «пан-», «пара-», «фіто-»; при цьому з переліку зникли префікси «вело-», «водо-», «газо-», «електро-», «квазі-», «кіно-», «космо-», «мілі-», «радіо-», «рентгено-», «стерео-», «термо-», «турбо-», «фото-».",
      "В окрему секцію компонентів, що визначають кількісний вияв чого-небудь, додатково включено «архі-», «архи-», «гіпер-», «мульти-», «нано-», «полі-», «ультра-».",
      "Уточнено, що, якщо з першим компонентом, який передбачає написання разом, вжито власну назву, її слід писати через дефіс.",
      "Додано примітки про те, що в компонентах «максі-» та «міді-» кінцевий «і» перед приголосним не переходить в «и», а «и» в «анти» не переходить у «і» перед голосним.",
      "Додано примітку, що компонент «топ-» не поєднується з числівниками.",
      "Продемонстровано, що слова, першою частиною яких є складений числівник (наприклад, «двадцятип’ятиповерховий»), пишуться разом.",
      "З прикладів прибрано «давним-давно» та «сама самотою».",
      "Приклади з однієї з приміток демонструють, що тире між двома числами слід відбивати відступами, проте в решті тексту правопису цього не дотримано.",
      "Продемонстровано, що дефіси слід ставити між усіма частинами складного вигуку, навіть якщо їх більше ніж дві.",
      "Видалено пункт, що регламентував написання протяжно вимовлених звуків через дефіс.",
      "Зауважено, що найменування відділень пошти абощо слід писати через дефіс («Київ-1»).",
      "Додано зауваження, що ініціальні абревіатури на кшталт «ДНК-аналіз» або «е-декларування» слід писати через дефіс.",
      "Переміщено в § 62 пункт про дефіс у скороченнях на кшталт «с.-г.» (від «сільськогосподарський»).",
      "Згадано вирази «карт-бланш» та «статус-кво», в яких закріпився дефіс."
    ],
    "major": [
      {
        "description": "Числівники «два», «три», «чотири» виступають у складних іменниках та прикметниках (але не в числівниках) у формах «дво-», «три-», «чотири-», навіть коли основа за ними починається на голосний.",
        "examples": [
          [
            "compulsory",
            "двохосьовий",
            "двоосьовий"
          ],
          [
            "compulsory",
            "чотирьохактний",
            "чотириактний"
          ],
          [
            "compulsory",
            "трьохлінійка",
            "трилінійка"
          ]
        ]
      },
      {
        "description": "Новий правопис підкреслює можливість сполучати основи іншомовного походження на «-ія» через сполучний «-є-» у разі, коли отримане складне слово дійсно можна тлумачити як сполучення двох повноцінних основ (на противагу одному слову, запозиченому цілком).",
        "examples": [
          [
            "optional",
            "хіміотерапія",
            "хімієтерапія"
          ],
          [
            "optional",
            "бактеріоносій",
            "бактерієносій"
          ],
          [
            "optional",
            "артеріовенозний",
            "артерієвенозний"
          ]
        ]
      },
      {
        "description": "Слова «багатвечір» та «Святвечір» слід писати разом.",
        "examples": [
          [
            "compulsory",
            "багат-вечір",
            "багатвечір"
          ],
          [
            "compulsory",
            "Свят-вечірній",
            "Святвечірній"
          ]
        ]
      },
      {
        "description": "Загальні назви з початковими компонентами «арт-», «бліц-», «веб-», «віце-», «диско-», «економ-», «екс-», «кібер-», «контр-», «лейб-», «максі-», «медіа-», «міді-», «міні-», «обер-», «поп-», «преміум-», «прес-», «топ-», «унтер-», «флеш-», «фолк-»/«фольк-» та «штабс-» слід писати разом.",
        "examples": [
          [
            "compulsory",
            "веб-сайт",
            "вебсайт"
          ],
          [
            "compulsory",
            "економ-клас",
            "економклас"
          ],
          [
            "compulsory",
            "поп-музика",
            "попмузика"
          ]
        ]
      },
      {
        "description": "Слова з початковим компонентом «боді-»/«боди-» слід писати разом, причому перед голосним вживаємо «боді-», а перед приголосним — «боди-».",
        "examples": [
          [
            "compulsory",
            "боді-арт",
            "бодіарт"
          ],
          [
            "compulsory",
            "боді-білдер",
            "бодибілдер"
          ]
        ]
      },
      {
        "description": "Найменування будинків, корпусів тощо слід писати через дефіс у форматі «10-А».",
        "examples": [
          [
            "compulsory",
            "вул. Шевченка, 5б",
            "вул. Шевченка, 5-Б"
          ]
        ]
      },
      {
        "description": "Абревіатуру «ВІЛ-СНІД» слід писати через дефіс.",
        "examples": [
          [
            "compulsory",
            "ВІЛ/СНІД",
            "ВІЛ-СНІД"
          ]
        ]
      }
    ]
  },
  {
    "new": 36,
    "title": "складні іменники",
    "old": [
      "26"
    ],
    "minor": [
      "Розширено список прикладів іменників, що пишуться разом; зокрема, подано приклади на «диско-» та «медіа-», що підкріплюють подібні приклади з цими компонентами, наведені в попередньому параграфі.",
      "Уточнено, що «дев’яносто», як і «сто», виступає в складених іменниках у називному відмінку, а не в родовому.",
      "Усунуто рекомендацію писати у складі складних іменників числівники, що позначають числа з двох і більше цифр, у цифровій формі (проте така можливість залишається).",
      "Зникла примітка про те, як слід писати «пів-» (тепер — лише у значеннях, відмінних від «половини») з власними назвами.",
      "Зафіксовано написання «інтернет» як першої частини складного слова з малої літери.",
      "Зі списку слів, що пишуться з дефісом, зникли слова «Святвечір» (це слово слід писати разом згідно з попереднім параграфом) та «стоп-кран».",
      "Додано правило, за яким назви літер грецької абетки як перші частини складних слів пишуться через дефіс.",
      "Уточнено, що назви музичних понять на кшталт «сі-бемоль» пишуться через дефіс і мають відмінювану другу частину.",
      "Уточнено, що складні іменники на кшталт «суші-бар» з першою частиною, що є невідмінюваним іменником іншомовного походження, пишуться через дефіс і мають відмінювану другу частину.",
      "Прибрано згадку префіксів «віце-», «екс-», «лейб-», «максі-», «міді-», «міні-», «обер-», про які згадано в попередньому параграфі.",
      "Згадку про скорочення на кшталт «вид-во» переміщено в § 62.",
      "Додано згадку про написання через дефіс за допомогою сполучного «о» слів на кшталт «монголо-татари» й «Австро-Угорщина»."
    ],
    "major": [
      {
        "description": "Слова «людинодень» і подібні (зі сполучним голосним) мають писатися разом.",
        "examples": [
          [
            "compulsory",
            "людино-день",
            "людинодень"
          ],
          [
            "compulsory",
            "ліжко-місця",
            "ліжкомісця"
          ],
          [
            "compulsory",
            "тонно-кілометр",
            "тоннокілометр"
          ]
        ]
      },
      {
        "description": "Слово «пів» зі значенням «половина» з наступним іменником (у формі родового відмінка однини) слід писати окремо.",
        "examples": [
          [
            "compulsory",
            "півгодини",
            "пів години"
          ],
          [
            "compulsory",
            "пів’яблука",
            "пів яблука"
          ],
          [
            "compulsory",
            "пів-Києва",
            "пів Києва"
          ]
        ]
      },
      {
        "description": "У словах «член-кореспондент» та «брат-і-сестра» відмінюються обидва складові іменники, а не лише другий.",
        "examples": [
          [
            "compulsory",
            "лист член-кореспонденту",
            "лист членові-кореспонденту"
          ],
          [
            "compulsory",
            "зірвати брат-і-сестру",
            "зірвати брата-і-сестру"
          ]
        ]
      }
    ]
  },
  {
    "new": 37,
    "title": "дефісне написання прикладки",
    "old": [
      "27"
    ],
    "minor": null,
    "major": null
  },
  {
    "new": 38,
    "title": "складні числівники",
    "old": [
      "28.1",
      "28.2а"
    ],
    "minor": [
      "Прибрано згадку про слова на кшталт «багатотисячний», «кількамільйонний», проте додано «мільярдний» як можливий останній компонент складних порядкових числівників.",
      "Продемонстровано, що «мільйон» і «мільярд» не пишуться з наступними компонентами числівників разом.",
      "Згадку утворень на кшталт «7-й», «11-го» перенесено у § 106."
    ],
    "major": null
  },
  {
    "new": 39,
    "title": "складні займенники",
    "old": [
      "28.2б"
    ],
    "minor": [
      "До наявних правил додано продубльовані з параграфа про частки правила, що стосуються займенників."
    ],
    "major": null
  },
  {
    "new": 40,
    "title": "складні прикметники",
    "old": [
      "29"
    ],
    "minor": [
      "Охарактеризовано, яким може бути останній звук першої частини складного прикметника.",
      "Видалено коментар, що у виразах на кшталт «трохи вище зазначений» «вище» й «зазначений» — два окремих слова.",
      "Уточнено, що зрідка прислівники, утворені з якісних прикметників, теж (як і з відносних) можуть не утворювати одне слово з наступним за ними прикметником або дієприкметником.",
      "Уточнено, що «пів» як перший компонент прикметників пишеться з ними одним словом.",
      "Додано приклади складних прикметників з нерозривно пов’язаними частинами: «вуглецевмісний», «хлорфенольний» та ін. Видалено пункт про складні іменники, утворені з двох неоднорідних (як «поперечношліфувальний»).",
      "Вказано написання «Івано-франківський» та «Пуща-водицький» з великої літери — імовірно, помилка.",
      "Прибрано примітку про винятки з прикладом «москворіцький» від «Москва-ріка».",
      "Зник приклад терміну, що слід писати разом, «грудочеревна».",
      "Додано приклад «сліпучо-білий»."
    ],
    "major": [
      {
        "description": "Слово «золото-валютний» слід писати через дефіс.",
        "examples": [
          [
            "compulsory",
            "золотовалютний",
            "золото-валютний"
          ]
        ]
      }
    ]
  },
  {
    "new": 41,
    "title": "правопис прислівників",
    "old": [
      "30"
    ],
    "minor": [
      "Зникли приклади «помаленьку» й «потихеньку».",
      "Додано приклад «сам на сам» з окремим написанням.",
      "Прибрано пункт, що регламентує писати «в основному» та «в цілому» окремо, проте в самому правописі принаймні «в цілому»/«у цілому» вжито саме так.",
      "Додано приклади «по-заячи», «по-ведмежи», а також явно наведено приклад «по батькові».",
      "Додано пункт про прислівники термінологічного характеру («де-факто», «де-юре»), що традиційно пишуться з дефісом."
    ],
    "major": null
  },
  {
    "new": 42,
    "title": "правопис прийменників",
    "old": [
      "31"
    ],
    "minor": null,
    "major": null
  },
  {
    "new": 43,
    "title": "правопис сполучників",
    "old": [
      "32"
    ],
    "minor": [
      "З прикладів вилучено складений сполучник «з тим щоб» і додано «затим що»."
    ],
    "major": null
  },
  {
    "new": 44,
    "title": "правопис часток",
    "old": [
      "33"
    ],
    "minor": [
      "Прибрано пункт про окреме написання частки «не» з числівниками, займенниками та прислівниками займенникового походження, біля прийменників і сполучників та зі словом «раз».",
      "Вилучено пункт про окреме написання частки «ні», вживаної як повторюваний єднальний сполучник із заперечним значенням або як підсилювальна частка.",
      "Видалено пункт про частки «хай», «нехай»."
    ],
    "major": null
  },
  {
    "new": 45,
    "title": "велика буква на початку речення",
    "old": [
      "34"
    ],
    "minor": null,
    "major": null
  },
  {
    "new": 46,
    "title": "велика буква у звертаннях і ремарках",
    "old": [
      "35"
    ],
    "minor": null,
    "major": [
      {
        "description": "Ремарки та посилання, взяті в дужки, з великої літери слід писати лише в тому разі, якщо дужки стоять за розділовим знаком, що позначає кінець речення.",
        "examples": [
          [
            "compulsory",
            "Слава борцям за незалежну Україну (Тривалі бурхливі оплески).",
            "Слава борцям за незалежну Україну (тривалі бурхливі оплески)."
          ]
        ]
      }
    ]
  },
  {
    "new": 47,
    "title": "велика та мала букви в рубриках",
    "old": [
      "36"
    ],
    "minor": [
      "Уточнено, що елементи переліку слід писати з малої літери у випадках, коли вони йдуть після коми чи після цифри або букви з круглою дужкою."
    ],
    "major": null
  },
  {
    "new": 48,
    "title": "велика буква на початку цитати",
    "old": [
      "37"
    ],
    "minor": [
      "Прибрано зауваження, що в разі наведення цитати з середини речення (і коли граматично вона не є частиною головного речення) цитату зазвичай починають із трьох крапок."
    ],
    "major": null
  },
  {
    "new": 49,
    "title": "власні імена осіб і тварин",
    "old": [
      "38.1",
      "38.2",
      "38.4",
      "38.26"
    ],
    "minor": [
      "Прибрано приклад «Марія-Тереза».",
      "Ім’я «Нур ед Дін» подано як «Нур ад Дін», проте деінде в правописі залишено варіант із літерою «е».",
      "У попередній версії правопису всі приклади корейських імен складалися з трьох окремих слів; у поточній версії частина імен складається вже з двох слів, але, скажімо, не імена Кім Чен Ина та Кім Ір Сена.",
      "До переліку азійських мов, усі частини імен яких слід писати з великої букви, додано японську.",
      "Прибрано приклад назви персонажа «Той, що греблі реве», який демонстрував написання першої літери кожного слова в такому випадку."
    ],
    "major": [
      {
        "description": "Обидві частини імені Ван Гога слід писати з великої літери.",
        "examples": [
          [
            "compulsory",
            "Вінсент ван Гог",
            "Вінсент Ван Гог"
          ]
        ]
      },
      {
        "description": "Ім’я корейського діяча слід писати як «Чхве Чхвівон».",
        "examples": [
          [
            "compulsory",
            "Чо Чі-вон",
            "Чхве Чхвівон"
          ]
        ]
      },
      {
        "description": "Складові корейських імен «Вансо», «Чхвівон», «Гімун» слід писати разом.",
        "examples": [
          [
            "compulsory",
            "Пак Ван Со",
            "Пак Вансо"
          ],
          [
            "compulsory",
            "Пан Гі Мун",
            "Пан Гімун"
          ]
        ]
      },
      {
        "description": "В іменах, що починаються на «д’», перед апострофом слід писати малу літеру «д» (відповідно до написання в мові оригіналу).",
        "examples": [
          [
            "compulsory",
            "Д’Артаньян",
            "д’Артаньян"
          ],
          [
            "compulsory",
            "Д’Обіньє",
            "д’Обіньє"
          ]
        ]
      }
    ]
  },
  {
    "new": 50,
    "title": "географічні та адміністративні назви",
    "old": [
      "38.7—38.12",
      "38.19"
    ],
    "minor": [
      "Уточнено, що як складова частина будь-якої географічної назви слово «святий» пишеться з великої літери.",
      "Наголошено, що з великої літери пишуться у складі географічних назв частинки «Сен-», «Санта-» і под. З прикладів родових назв, які ввійшли в українську мову як загальні, вилучено «стрит»/«стріт».",
      "«Держава Бахрейн» змінено на «Королівство Бахрейн», «Румунська Республіка» на «Румунія», «Угорська Республіка» на «Угорщина», а «Франція» — на «Французька Республіка».",
      "Уточнено, що в неофіційних назвах територій з великої літери пишуться перше слово та власні назви; «Російську Федерацію» виключено з прикладів таких назв.",
      "Назви міжнародних організацій, усі слова в яких слід писати з великох літери, перенесено як винятки у § 54.",
      "Уточнено, що в назвах адміністративно-територіальних одиниць (очевидно, України та країн близького зарубіжжя) з великої літери пишуть або перше слово, або частини складного слова (які розділяє дефіс).",
      "Уточнено, що в назвах адміністративно-територіальних одиниць зарубіжних держав (очевидно, далекого зарубіжжя) з великої літери пишуться всі слова, крім тих, що позначають родові поняття.",
      "Прибрано явну згадку про населені пункти, назви яких складаються більше ніж з одного слова.",
      "Уточнено, що назви вокзалів, залізничних станцій, портів і пристаней слід писати без лапок та починаючи всі слова, крім родових назв, із великої літери; натомість назви аеропортів, станцій метро і зупинок міського транспорту слід брати в лапки і з великої літери писати перше слово в лапках та всі слова, що писалися б із великої поза контекстом транспорту."
    ],
    "major": [
      {
        "description": "Відповідно до поданих прикладів, з великої літери слід писати всі слова у назвах вулиць, площ і т. д., крім родових назв; зокрема, правильним у цьому контексті є написання «Дружби Народів».",
        "examples": [
          [
            "compulsory",
            "проспект Дружби народів",
            "проспект Дружби Народів"
          ]
        ]
      }
    ]
  },
  {
    "new": 51,
    "title": "астрономічні назви",
    "old": [
      "38.6"
    ],
    "minor": null,
    "major": [
      {
        "description": "Порядкові позначення яскравості зірок (назви грецьких літер) слід писати з малої букви.",
        "examples": [
          [
            "compulsory",
            "Альфа Малої Ведмедиці",
            "альфа Малої Ведмедиці"
          ],
          [
            "compulsory",
            "Бета Андромеди",
            "бета Андромеди"
          ]
        ]
      }
    ]
  },
  {
    "new": 52,
    "title": "назви епох, подій та заходів",
    "old": [
      "38.22",
      "38.23"
    ],
    "minor": [
      "Уточнено, що в назві свята «День Конституції України» з великої літери пишуться всі три слова.",
      "Уточнено, що назви різноманітних заходів міжнародного або загальнодержавного значення — наприклад, «Олімпійські ігри» — слід писати з великої літери (перше слово і власні назви), а інші — наприклад, «санітарний день» або «суботник» — з малої.",
      "Уточнено, що в назвах історичних подій, що містять прикметник із дефісом, утворений від географічної назви з дефісом або двох географічних назв, обидві частини цього прикметника слід писати з великої літери."
    ],
    "major": [
      {
        "description": "Згідно з загальними правилами, у назві свята «День перемоги» друге слово слід писати з малої літери.",
        "examples": [
          [
            "compulsory",
            "День Перемоги",
            "День перемоги"
          ]
        ]
      },
      {
        "description": "У назві свята «День Соборності України» всі три слова слід писати з великої літери.",
        "examples": [
          [
            "compulsory",
            "День соборності України",
            "День Соборності України"
          ]
        ]
      },
      {
        "description": "Словосполучення «8 березня» та «1 травня» немає підстав уважати назвами свят і писати в них друге слово з великої літери.",
        "examples": [
          [
            "compulsory",
            "8 Березня",
            "8 березня"
          ],
          [
            "compulsory",
            "1 Травня",
            "1 травня"
          ]
        ]
      }
    ]
  },
  {
    "new": 53,
    "title": "релігійні назви",
    "old": [
      "38.18",
      "38.21",
      "38.22"
    ],
    "minor": [
      "Зауважено, що назви конкретних богів, а також засновників релігій слід (на загальних підставах) писати з великої літери; слово «бог» на означення богів політеїстичних релігій — з малої.",
      "Уточнено, що всі слова в християнських термінах («Свята Трійця», «Бог Син» та ін.) та прикметники, утворені від слів «Бог» і «Господь», слід писати з великої літери.",
      "Уточнено, що слова «апостол», «святий» і т. д. у загальному випадку пишуться з малої літери.",
      "Вказано, що в релігійних текстах з великої літери пишуть також займенники замість слів «Бог» та «Божий».",
      "Додано, що у сталих виразах на кшталт «боже мій» слова «бог» та «господь» пишуться з малої.",
      "Продемонстровано, що у назвах культових книг, які складаються більше ніж з одного слова, з великої літери пишуться всі.",
      "Додано, що з великої літери пишуться перші слова назв церков (наприклад, «Українська православна церква»).",
      "Уточнено, що з великої букви пишуться всі слова в повних офіційних найменуваннях найвищих церковних посадових осіб, тоді як інші церковні звання пишуться з малої.",
      "Уточнено, що з великої букви слід писати всі слова, крім родових найменувань, у назвах монастирів, церков та ікон.",
      "Вказано, що назви церковних служб та їхніх частин («літургія», «хресний хід») пишуться з малої літери."
    ],
    "major": [
      {
        "description": "У найменуваннях церковних посадових осіб «Папа Римський», «Вселенський Патріарх» та «Верховний Архиєпископ» обидва слова слід писати з великої літери.",
        "examples": [
          [
            "compulsory",
            "Вселенський патріарх",
            "Вселенський Патріарх"
          ],
          [
            "compulsory",
            "верховний архієпископ",
            "Верховний Архієпископ"
          ]
        ]
      }
    ]
  },
  {
    "new": 54,
    "title": "назви компаній та установ",
    "old": [
      "38.11",
      "38.13—38.17",
      "38.20"
    ],
    "minor": [
      "Уточнено, що у назві «Верховний Суд» (України) з великої літери пишуться обидва слова.",
      "Продемонстровано, що в назвах з дефісом на кшталт «Християнсько-демократичний союз Німеччини» частина після дефісу пишеться з малої літери.",
      "Уточнено, що назви партій, які не є офіційними («партія миру»), пишуться з малої літери.",
      "Уточнено, що в складених назвах українських інформагентств, як і в назвах іноземних, усі слова пишуться з великої літери (те, що вони не беруться в лапки, було сказано деінде і в старому правописі).",
      "Уточнено, що «міністерства України» і подібні назви, вжиті у множині, пишуться з малої літери.",
      "Зникли приклади типу «Київський будинок мод», «Львівський палац одруження», «Харківський клуб метробудівців».",
      "Зникла вимога писати з великої літери лише перше слово назви іноземної компанії (в контексті написання кирилицею і в лапках)."
    ],
    "major": [
      {
        "description": "Назви компаній, написані латинкою, слід брати в лапки.",
        "examples": [
          [
            "compulsory",
            "компанія Microsoft",
            "компанія «Microsoft»"
          ],
          [
            "compulsory",
            "концерн Volkswagen",
            "концерн «Volkswagen»"
          ]
        ]
      },
      {
        "description": "У назві «Європейський Союз» обидва слова пишуться з великої літери.",
        "examples": [
          [
            "compulsory",
            "Європейський союз",
            "Європейський Союз"
          ]
        ]
      },
      {
        "description": "Назви сайтів «Google» і «Twitter» слід транслітерувати як «ґуґл» і «твітер».",
        "examples": [
          [
            "compulsory",
            "пошукова система «Гугл»",
            "пошукова система «Ґуґл»"
          ],
          [
            "compulsory",
            "сайт «Твіттер»",
            "сайт «Твітер»"
          ]
        ]
      },
      {
        "description": "Назви сайтів без родового слова («сайт», «мережа» тощо) слід писати з малої букви; із родовим словом — з великої літери та в лапках; ужиті як назви юридичних осіб — з великої букви без лапок.",
        "examples": [
          [
            "compulsory",
            "Прочитала дещо цікаве на «Вікіпедії».",
            "Прочитала дещо цікаве на вікіпедії."
          ],
          [
            "compulsory",
            "РНБО ввела санкції проти «Яндекса».",
            "РНБО ввела санкції проти Яндекса."
          ]
        ]
      }
    ]
  },
  {
    "new": 55,
    "title": "назви документів, творів, споруд",
    "old": [
      "38.18",
      "38.21",
      "38.23"
    ],
    "minor": [
      "Уточнено, що в назвах документів, які містять фрагмент у лапках, перше слово в лапках слід писати з великої літери.",
      "Уточнено, що твори мистецтва на кшталт «Дев’ята симфонія Бетховена» пишуться з великої літери, але родові найменування, навіть коли вони йдуть першими, з малої («реквієм Моцарта»); те саме стосується пам’яток архітектури («собор Святого Петра»).",
      "Уточнено, що назви писемних історичних пам’яток пишуться з великої літери."
    ],
    "major": null
  },
  {
    "new": 56,
    "title": "назви посад і титулів",
    "old": [
      "38.3"
    ],
    "minor": [
      "Прибрано уточнення, що написання з великої літер посад «Президент Сполучених Штатів Америки», «Прем’єр-міністр Канади» доречне в дипломатичному контексті, проте доповнено, що таке написання поширюється лише на офіційні назви.",
      "Примітку про назви сторін у договорах перенесено в § 60."
    ],
    "major": null
  },
  {
    "new": 57,
    "title": "назви відзнак",
    "old": [
      "38.24"
    ],
    "minor": [
      "До правила про назви відзнак додано приклади «орден князя Ярослава Мудрого» та «відзнака Президента України — Хрест Івана Мазепи», що не зовсім добре його ілюструють або навіть йому суперечать.",
      "Без пояснень додано альтернативне правило, за яким з великої літери можуть писатися всі слова назви нагороди, взятої в дужки (наведено приклад «орден „Золота Зірка“»).",
      "Уточнено, що назви спортивних та академічних нагород («золота медаль») пишуться з малої літери.",
      "Уточнено, що перше слово назв премій пишеться з великої літери."
    ],
    "major": null
  },
  {
    "new": 58,
    "title": "назви марок виробів",
    "old": [
      "38.25"
    ],
    "minor": [
      "Уточнено, що назви поїздів, кораблів тощо слід брати в лапки, а перше слово в лапках писати з великої літери.",
      "Явно вказано, що абревіатурні назви виробничих марок не потребують лапок."
    ],
    "major": [
      {
        "description": "Назви індивідуальних машин, літаків та інших виробів — на противагу їхнім маркам або назвам компаній-виробників — слід писати з малої літери (і в лапках).",
        "examples": [
          [
            "compulsory",
            "Приїхали на новенькому «Мерседесі».",
            "Приїхали на новенькому «мерседесі»."
          ],
          [
            "compulsory",
            "Рейс обслуговує «Боїнг».",
            "Рейс обслуговує «боїнг»."
          ]
        ]
      }
    ]
  },
  {
    "new": 59,
    "title": "породи тварин і сорти рослин",
    "old": [
      "38.4",
      "38.5"
    ],
    "minor": null,
    "major": [
      {
        "description": "У неспеціальних текстах назви сортів рослин пишуть у лапках з малої літери (зокрема й ті, що походять із власних назв).",
        "examples": [
          [
            "compulsory",
            "антонівка",
            "«антонівка»"
          ]
        ]
      }
    ]
  },
  {
    "new": 60,
    "title": "велика буква в особливому вживанні",
    "old": [
      "38.3 (примітка)",
      "38.12 (примітка)"
    ],
    "minor": [
      "Написання з великих літер «Надзвичайний і Повноважний Посол» у дипломатичних документах прирівняно до «Високі Договірні Сторони» у договорах.",
      "Додано пункт про займенники «Ви» і «Ваш» як форму ввічливості.",
      "До слова «Батьківщина», яке в особливому контексті можна писати з великої літери, додано «Вітчизна», «Честь», «Людина», «Мати»."
    ],
    "major": null
  },
  {
    "new": 61,
    "title": "велика буква у скороченнях",
    "old": [
      "39"
    ],
    "minor": [
      "Уточнено, що похідні слова від абревіатур («оонівський», «тюгівець») пишуться малими літерами, а в складних словах на кшталт «УВЧ-терапія» перша частина залишається у вихідній формі.",
      "Уточнено, що абревіатури на кшталт «ГУ МВС» пишуться окремо через пробіл.",
      "Прокоментовано написання скорочень мішаного типу «КУпАП», «БілАЗ», «НДІ транспорту газу», а також типу «КіЖ» («Культура і життя»).",
      "Прокоментовано використання великих та малих літер у назвах літаків на кшталт «Ан-22».",
      "Прибрано примітку про те, що скорочення на кшталт «неп» повноцінно відмінюються; при цьому два інших колишніх приклади — «вуз» та «загс» — більше у правописі ніде не трапляються."
    ],
    "major": null
  },
  {
    "new": 62,
    "title": "графічні скорочення",
    "old": [
      "25.4з",
      "26.2.5",
      "40"
    ],
    "minor": [
      "Суттєво розширено список скорочень, які пишуть із крапкою.",
      "Розширено також і список одиниць вимірювання, хоч він і залишається далеко не повним.",
      "Прибрано приклад «Північнокримський канал», що скорочувався без дефіса як «Півн. крим. канал».",
      "Додано скорочення «грн», «млн», «млрд», «трлн», «смт», які слід писати без крапок.",
      "Уточнено, що в разі скорочення словосполучень або складних слів скісною рискою («р/р» і також «м/хв») крапок не ставимо."
    ],
    "major": null
  },
  {
    "new": 63,
    "title": "орфографічні правила переносу",
    "old": [
      "41"
    ],
    "minor": [
      "Уточнено, що не можна розривати сполучення літер «йо» та «ьо».",
      "Сказано, що «й» не можна відокремлювати від попередньої літери, хоча, мабуть, це справедливо лише для випадку, коли після «й» іде приголосний — адже в іншому пункті показано приклад переносу «па-йок».",
      "Для слів із префіксами — якщо корінь починається на голосний, перенос можна здійснювати довільно, але перший приголосний відривати від кореня заборонено.",
      "При збігу однакових приголосних слід переносити в наступний рядок другу; однак у словах, де збіг є наслідком подовження, можливий також і альтернативний перенос.",
      "Заборонено відривати останній приголосний префікса перед приголосним кореня (принаймні в односкладових префіксах)."
    ],
    "major": null
  },
  {
    "new": 64,
    "title": "технічні правила переносу",
    "old": [
      "42"
    ],
    "minor": [
      "Зникла примітка про те, що назви мір, які подаються повністю, можна відривати від числа, що йде перед ними («150 // гектарів»), проте заборона це робити формально з тексту і не випливає."
    ],
    "major": null
  },
  {
    "new": 65,
    "title": "знак наголосу",
    "old": [
      "43"
    ],
    "minor": null,
    "major": null
  },
  {
    "new": 66,
    "title": "поділ іменників на відміни",
    "old": [
      "44"
    ],
    "minor": [
      "До прикладів слів I відміни додано жіночі та чоловічі імена.",
      "Додано приклади слів II відміни на «-ище», «-исько» з коментарем, що вони можуть зберігати рід слів, від яких утворені, або набувати середнього роду.",
      "Доповнено і приклади для III відміни, зокрема й невідмінюваним раніше іменем «Ніколь» (проте більш повний список таких імен з’являється у § 140).",
      "Наведено форми «імени» й «тімени», проте це, певно, помилка, оскільки можливість утворення таких форм у правописі не описано."
    ],
    "major": null
  },
  {
    "new": 67,
    "title": "поділ іменників на групи",
    "old": [
      "45"
    ],
    "minor": [
      "До прикладів слів м’якої групи I відміни додано слово чоловічого роду — «тесля».",
      "З прикладів прибрано слово «лівша».",
      "Звернуто увагу, що деякі слова іншомовного походження на «-ар», «-ир» («долар», «панцир») належать до твердої групи попри те, що в них постійно наголошеним є корінь, а не суфікс.",
      "Пояснено, що слово «маляр» залежно від наголосу належить або до твердої групи, або до мішаної."
    ],
    "major": [
      {
        "description": "Іменник «щур» може мати у формі називного відмінка множини альтернативні форми «щури» та «щурі».",
        "examples": [
          [
            "optional",
            "щури",
            "щурі"
          ]
        ]
      },
      {
        "description": "Слово «хабар» віднесено до м’якої групи, проте зазначено, що у складних словах («хабароодержувач») сполучним голосним може бути лише «о».",
        "examples": [
          [
            "compulsory",
            "без хабара",
            "без хабаря"
          ]
        ]
      }
    ]
  },
  {
    "new": 68,
    "title": "зразки відмінювання іменників",
    "old": [
      "46"
    ],
    "minor": [
      "У цілому наведені приклади більш повно демонструють варіанти відмінювання іменників.",
      "Додано примітку про відмінювання іменників на «-ище» залежно від роду.",
      "Подано варіант закінчення «-и» для родового відмінка однини III відміни (але детальніше про це — у § 95).",
      "Подано варіант кличного відмінка «імене» поряд з «ім’я»."
    ],
    "major": null
  },
  {
    "new": 69,
    "title": "I відміна, родовий відмінок однини",
    "old": [
      "47.А.1"
    ],
    "minor": [
      "Додано, що «ї» з’являється також після м’якого знака — як у слові «дуеньї»."
    ],
    "major": null
  },
  {
    "new": 70,
    "title": "I відміна, давальний відмінок однини",
    "old": [
      "47.А.2"
    ],
    "minor": [
      "Додано, що «ї» з’являється також після м’якого знака — як у слові «дуеньї»."
    ],
    "major": null
  },
  {
    "new": 71,
    "title": "I відміна, знахідний відмінок однини",
    "old": [
      "47.А.3"
    ],
    "minor": null,
    "major": null
  },
  {
    "new": 72,
    "title": "I відміна, орудний відмінок однини",
    "old": [
      "47.А.4"
    ],
    "minor": [
      "Додано, що «єю» з’являється також після м’якого знака — як у слові «дуеньєю»."
    ],
    "major": null
  },
  {
    "new": 73,
    "title": "I відміна, місцевий відмінок однини",
    "old": [
      "47.А.5"
    ],
    "minor": [
      "Додано, що «ї» з’являється також після м’якого знака — як у «на дуеньї»."
    ],
    "major": null
  },
  {
    "new": 74,
    "title": "I відміна, кличний відмінок однини",
    "old": [
      "47.А.6"
    ],
    "minor": [
      "Виправлено помилку: в цьому місці раніше було вказано, що правильною формою кличного відмінка до імені «Ілля» є «Іллє», проте у повній таблиці відмінювання цього імені й раніше було «Ілле».",
      "Додано, що «є» з’являється також після м’якого знака — як у слові «дуеньє»."
    ],
    "major": [
      {
        "description": "У звертаннях до жінок, що складаються з загальної назви та прізвища, прізвище (як і загальна назва) набуває форми кличного відмінка.",
        "examples": [
          [
            "compulsory",
            "добродійко Варивода",
            "добродійко Вариводо"
          ],
          [
            "compulsory",
            "Доброго ранку, пані Гаркуша!",
            "Доброго ранку, пані Гаркуше!"
          ]
        ]
      }
    ]
  },
  {
    "new": 75,
    "title": "I відміна, називний відмінок множини",
    "old": [
      "47.Б.1"
    ],
    "minor": [
      "Додано, що «ї» з’являється також після м’якого знака — як у слові «дуеньї»."
    ],
    "major": null
  },
  {
    "new": 76,
    "title": "I відміна, родовий відмінок множини",
    "old": [
      "47.Б.2"
    ],
    "minor": [
      "Додано зауваження, що іменники іншомовного походження мають здебільшого нульове закінчення («арф», «шайб» тощо), але прибрано коментар, що за аналогією до слів із суфіксом «-к-» у таких словах може з’являтися «о» («арок»).",
      "Згадано наявність іменників із двома варіантами закінчення: «мами» (наголос на «и») — «мамів» і «мам», «Майбородів» і «Майбород» та ін. Додано приклади слів, у яких не з’являється вставних звуків: «букв», «мавп», «шахт»."
    ],
    "major": null
  },
  {
    "new": 77,
    "title": "I відміна, давальний відмінок множини",
    "old": [
      "47.Б.3"
    ],
    "minor": null,
    "major": null
  },
  {
    "new": 78,
    "title": "I відміна, знахідний відмінок множини",
    "old": [
      "47.Б.4"
    ],
    "minor": [
      "Додано, що форми знахідного відмінка на кшталт «пасти корови» є менш поширені і що таку ж форму мають окремі назви комах («ловити мухи»)."
    ],
    "major": null
  },
  {
    "new": 79,
    "title": "I відміна, орудний відмінок множини",
    "old": [
      "47.Б.5"
    ],
    "minor": [
      "Прибрано форми «ворітьми» й «курми», проте вони трапляються деінде в тексті правопису."
    ],
    "major": null
  },
  {
    "new": 80,
    "title": "I відміна, місцевий відмінок множини",
    "old": [
      "47.Б.6"
    ],
    "minor": null,
    "major": null
  },
  {
    "new": 81,
    "title": "I відміна, кличний відмінок множини",
    "old": [
      "47.Б.7"
    ],
    "minor": null,
    "major": null
  },
  {
    "new": 82,
    "title": "II відміна, родовий відмінок однини",
    "old": [
      "48"
    ],
    "minor": [
      "Уточнено, що закінчення «-я» в родовому відмінку зрідка трапляється у слів середнього роду, що належать до мішаної групи II відміни.",
      "Зауважено, що іменники чоловічого роду на «-о» можуть набувати у родовому відмінку лише закінчення «-а» (тверда та мішана групи) або «-я» (м’яка група).",
      "Уточнено, що слово «промінь» у термінологічному значенні має в родовому відмінку закінчення «-я».",
      "Уточнено, що слова чоловічого роду, які мають закінчення «-а»/«-я» родового відмінка у звичайній формі, мають його і в зменшено-пестливій формі.",
      "Додано, що закінчення «-а»/«-я» для машин та їхніх деталей поширюється і на «технічні реалії» загалом («ескалатора», «комп’ютера» та ін.).",
      "Згадано винятки «фразеологізму», «табуна», «білка» та альтернативні форми «танка», «стида».",
      "Додано, що закінчення «-а»/«-я» мають у II відміні назви органів та частин тіла; назви житлових приміщень, сільськогосподарських і технічних будівель та їхніх частин; назви виробів із борошна; назви церковних реалій.",
      "Додано винятки форм назв річок «Довжика», «Малого Куяльника», «Салгира» з закінченням «-а».",
      "Додано, що закінчення «-а»/«-я» мають у II відміні назви хвороб та об’єднань держав.",
      "Прибрано приклади форм родового відмінка «ляпасу» та «модусу».",
      "До літературознавчих термінів, що за правилом закінчуються на «-у»/«-ю», додано категорії філософських та інших наукових понять, проте приклади самих літературознавчих термінів вилучено.",
      "Прибрано зауваження, що зменшені форми на «-к-» від слів зі значенням місця мають у родовому відмінку закінчення «-а», разом із відповідними прикладами («ліска», «майданчика» та ін.).",
      "Уточнено, що форма «моста» стосується конкретного предмета, а «мосту» — цілісності.",
      "Прибрано приклади назв речовин у зменшено-пестливій формі.",
      "Додатково уточнено, що форма «бала» стосується одиниці виміру, а «балу» — святкового вечора.",
      "Прокоментовано розрізнення пар «бора»/«бору», «борта»/«борту», «булата»/«булату», «двзона»/«дзвону», «духа» і «Духа» / «духу», «корпуса»/«корпусу», «листа»/«листу», «оригінала»/«оригіналу», «органа»/«органу», «папера»/«паперу», «потяга»/«потягу», «сирка»/«сирку», «соняшника»/«соняшнику», «стана»/«стану», «феномена»/«феномену», «шаблона»/«шаблону».",
      "Загалом формулювання останньої примітки до правил стимулює до вільнішого вибору закінчення в родовому відмінку з тим, щоб краще передати конкретне значення того чи іншого слова."
    ],
    "major": [
      {
        "description": "Назви населених пунктів чоловічого роду паралельно до «-а»/«-я» можуть набувати в родовому відмінку однини закінчення «-у»/«-ю» — за винятком тих, що в цьому відмінку мають наголос на останньому складі, у називному відмінку закінчуються на «-а», «-о», «-я», омонімічні з назвою більшої території чи мають суфікси «-ськ», «-цьк», «-ець», суфікси присвійності «-ів», «-їв», «-ев», «-єв», «-ов», «-ин», «-ін», «-ач», «-ич», «-яч» або частинки «-бург», «-град», «-город», «-піль», «-поль», «-мир», «-слав» (а також винятків «Бреча», «Вовка» та «Свіжа»).",
        "examples": [
          [
            "optional",
            "з Парижа",
            "з Парижу"
          ],
          [
            "optional",
            "до Дубліна",
            "до Дубліну"
          ],
          [
            "optional",
            "біля Ліверпуля",
            "біля Ліверпулю"
          ]
        ]
      },
      {
        "description": "Назви сайтів чоловічого роду в родовому відмінку однини мають закінчення «-а»/«-я».",
        "examples": [
          [
            "compulsory",
            "без «Фейсбуку»",
            "без фейсбука"
          ],
          [
            "compulsory",
            "товар з «Ібею»",
            "товар з ібея"
          ]
        ]
      },
      {
        "description": "Назва хвороби «правець» у родовому відмінку однини має форму «правцю».",
        "examples": [
          [
            "compulsory",
            "без правця",
            "без правцю"
          ]
        ]
      },
      {
        "description": "Слово «вігвам» у родовому відмінку однини має форму «вігваму».",
        "examples": [
          [
            "compulsory",
            "до вігвама",
            "до вігваму"
          ]
        ]
      },
      {
        "description": "Слово «придаток» у значенні доповнення має в родовому відмінку форму «придатку».",
        "examples": [
          [
            "compulsory",
            "замість придатка",
            "замість придатку"
          ]
        ]
      },
      {
        "description": "Слово «шлунок» в абстрактному значенні потреби в їжі та у значенні страви з відповідного органа в родовому відмінку має форму «шлунку».",
        "examples": [
          [
            "compulsory",
            "гарнір до шлунка",
            "гарнір до шлунку"
          ]
        ]
      },
      {
        "description": "Слово «телефон» у значенні пристрою (і за аналогією слова «радіотелефон», «відеофон», «смартфон» і под.) в родовому відмінку має закінчення «-а».",
        "examples": [
          [
            "compulsory",
            "без телефону",
            "без телефона"
          ],
          [
            "compulsory",
            "зі смартфону",
            "зі смартфона"
          ],
          [
            "compulsory",
            "щодо відеофону",
            "щодо відеофона"
          ]
        ]
      }
    ]
  },
  {
    "new": 83,
    "title": "II відміна, давальний відмінок однини",
    "old": [
      "49"
    ],
    "minor": [
      "Додано приклад форми «озерові», альтернативної до «озеру».",
      "Уточнено, що для прізвищ на кшталт «Василишин» та «Яковишин» можливі варіантні закінчення «-у» та «-ові» (раніше це випливало з таблиць відмінювання)."
    ],
    "major": [
      {
        "description": "Іменники чоловічого роду на «-ін», «-їн» можуть у давальному відмінку однини набувати закінчення «-ові» паралельно з «-у».",
        "examples": [
          [
            "optional",
            "завдяки Пушкіну",
            "завдяки Пушкінові"
          ],
          [
            "optional",
            "назустріч Каїну",
            "назустріч Каїнові"
          ]
        ]
      }
    ]
  },
  {
    "new": 84,
    "title": "II відміна, знахідний відмінок однини",
    "old": [
      "50"
    ],
    "minor": [
      "Уточнено, що паралельну форму знахідного відмінка, спільну з родовим, має частина слів, що називають, крім побутових предметів, також дерева, документи та ін.; додано приклади «вивчив вірша», «розгорнув довідника», «подарував персня», «уклав акта»; вилучено приклад «дав карбованця»."
    ],
    "major": null
  },
  {
    "new": 85,
    "title": "II відміна, орудний відмінок однини",
    "old": [
      "51"
    ],
    "minor": null,
    "major": [
      {
        "description": "Прізвища на «-ин», які походять від назв осіб за етнічною належністю або місцем проживання, в орудному відмінку однини набувають закінчення «-ом».",
        "examples": [
          [
            "compulsory",
            "з Волошиним",
            "з Волошином"
          ],
          [
            "compulsory",
            "перед Черкашиним",
            "перед Черкашином"
          ]
        ]
      }
    ]
  },
  {
    "new": 86,
    "title": "II відміна, місцевий відмінок однини",
    "old": [
      "52"
    ],
    "minor": [
      "Додано пари варіантних закінчень «у лісі» — «у лісу», «на льоді» — «на льоду», «на роді» — «на роду», «у саді» — «у саду», «на ставі» — «на ставу», «по дубу» — «по дубі», «по обличчю» — «по обличчі», «по озеру» — «по озері», «по полю» — «по полі», «у потягу» — «у потязі».",
      "Уточнено, що закінчення «-ові»/«-еві» у місцевому відмінку мають переважно (а не лише) назви істот чоловічого роду, хоча відповідних прикладів не наведено.",
      "Уточнено, що в більшості іменників, і зокрема в назвах тварин, з основою на «-к» поряд із закінченням місцевого відмінка «-ові» вживається «-у» (а не «-і»).",
      "Вказано, що з прийменником «по» іменники набувають варіантних закінчень «-ові»/«-еві»/«-єві» та «-у»/«-ю» (правило сформульовано, наче це стосується всіх іменників, проте серед прикладів наведено лише назви тварин).",
      "Наведено приклади іменників, які можуть мати всі три види закінчень у місцевому відмінку однини: «капітан», «прем’єр-міністр», «професор», «студент», «учитель», «носій», «небіж», «товариш», «читач»."
    ],
    "major": [
      {
        "description": "Зрідка на позначення часу разом із прийменником «по» можна вживати закінчення місцевого відмінка «-у»/«-ю»: «по завершенню» (паралельно з «по завершенні»), «по вечору» (паралельно з «по вечорі») і т. ін.",
        "examples": [
          [
            "optional",
            "по завершенні",
            "по завершенню"
          ]
        ]
      }
    ]
  },
  {
    "new": 87,
    "title": "II відміна, кличний відмінок однини",
    "old": [
      "53"
    ],
    "minor": [
      "Формалізовано, що прізвища прикметникового походження на «-ів», «-ин» та ін. мають у кличному відмінку форму на «-е» (поряд із формою, спільною з називним відмінком).",
      "Неявно згадується, що прізвища (не лише прикметникового походження) мають, узагалі кажучи, дві форми кличного відмінка, одна з яких збігається з називним."
    ],
    "major": [
      {
        "description": "Поряд із «Олегу», «повстанцю», «умільцю» можна вживати форму кличного відмінка «Олеже», «повстанче», «умільче».",
        "examples": [
          [
            "optional",
            "Шановний Олегу!",
            "Шановний Олеже!"
          ],
          [
            "optional",
            "Гей, повстанцю!",
            "Гей, повстанче!"
          ],
          [
            "optional",
            "Умільцю ти наш!",
            "Умільче ти наш!"
          ]
        ]
      },
      {
        "description": "Форма кличного відмінка імені «Ігор» — «Ігорю».",
        "examples": [
          [
            "compulsory",
            "Шановний Ігоре!",
            "Шановний Ігорю!"
          ]
        ]
      },
      {
        "description": "У звертаннях до чоловіків, що складаються з двох загальних назв, форму кличного відмінка обов’язково мають обидва слова.",
        "examples": [
          [
            "compulsory",
            "пане водій",
            "пане водію"
          ],
          [
            "compulsory",
            "Вітаю, добродію аспірант!",
            "Вітаю, добродію аспіранте!"
          ]
        ]
      },
      {
        "description": "У звертаннях до чоловіків, що складаються з загальної назви та прізвища, прізвище (як і загальна назва) може набувати форми кличного відмінка.",
        "examples": [
          [
            "optional",
            "пане Максименко",
            "пане Максименку"
          ],
          [
            "optional",
            "Бувайте, лікарю Гончар!",
            "Бувайте, лікарю Гончаре!"
          ]
        ]
      },
      {
        "description": "Форма кличного відмінка слів «сер», «сір», «гер» збігається з формою називного відмінка.",
        "examples": [
          [
            "compulsory",
            "Ласкаво просимо, сере!",
            "Ласкаво просимо, сер!"
          ]
        ]
      },
      {
        "description": "Іменник «Христос» має паралельні форми кличного відмінка «Христе» (з обома наголосами) та — рідко — «Христосе».",
        "examples": [
          [
            "optional",
            "Хвала тобі, Христе!",
            "Хвала тобі, Христосе!"
          ]
        ]
      }
    ]
  },
  {
    "new": 88,
    "title": "II відміна, називний відмінок множини",
    "old": [
      "54"
    ],
    "minor": [
      "Наведено альтернативні форми множини слова «пазур» — «пазурі» та «пазури».",
      "Наведено форму множини «вічі» з поміткою «зрідка», прибрано згадку форми «уші».",
      "Уточнено, що з числівниками «два», «три», «чотири» іменники чоловічого роду мають закінчення «-и»/«-і»/«-ї».",
      "Прокоментовано наявність урочистих форм множини «браття» і «братове».",
      "Уточнено, що закінчення «-я» у формі множини зрідка можуть набувати й іменники мішаної групи.",
      "Форму називного відмінка множини «ґрунта» позначено як застарілу.",
      "Прибрано зауваження, що форма множини від слова «тато» — лише «тати», з наголосом на першому складі; судячи з наступного параграфа, можливо, через те, що наголос може падати на обидва склади.",
      "Додано, що слово «Господь» не має форми множини."
    ],
    "major": null
  },
  {
    "new": 89,
    "title": "II відміна, родовий відмінок множини",
    "old": [
      "55"
    ],
    "minor": [
      "Додано форму «грамів» без згадки можливості альтернативної «грам».",
      "Уточнено, що форма «чоботів» можлива поряд із «чобіт».",
      "Прибрано приклад вжитку «сім день» (= «сім днів»), проте не прибрано відповідний приклад «днів сім».",
      "Уточнено, що з формою «чоловік» можливим є порядок слів «чоловік сім».",
      "Додано форму «віч» (= «очей»), форми «ушей»/«уші» позначено як застарілі."
    ],
    "major": [
      {
        "description": "Форма родового відмінка множини від слова «тато» — «татів» (з можливими наголосами на обох складах).",
        "examples": [
          [
            "compulsory",
            "багато тат",
            "багато татів"
          ]
        ]
      }
    ]
  },
  {
    "new": 90,
    "title": "II відміна, давальний відмінок множини",
    "old": [
      "56"
    ],
    "minor": null,
    "major": null
  },
  {
    "new": 91,
    "title": "II відміна, знахідний відмінок множини",
    "old": [
      "57"
    ],
    "minor": null,
    "major": null
  },
  {
    "new": 92,
    "title": "II відміна, орудний відмінок множини",
    "old": [
      "58"
    ],
    "minor": [
      "Уточнено, що закінчення «-ями» в орудному відмінку множини зрідка трапляється у слів чоловічого та середнього роду, що належать до мішаної групи II відміни."
    ],
    "major": null
  },
  {
    "new": 93,
    "title": "II відміна, місцевий відмінок множини",
    "old": [
      "59"
    ],
    "minor": null,
    "major": null
  },
  {
    "new": 94,
    "title": "II відміна, кличний відмінок множини",
    "old": [
      "60"
    ],
    "minor": [
      "Сказано, що в поетичному та урочистому мовленні використовують форми на зразок «братове», «сватове»."
    ],
    "major": null
  },
  {
    "new": 95,
    "title": "III відміна, однина",
    "old": [
      "61"
    ],
    "minor": null,
    "major": [
      {
        "description": "У родовому відмінку однини іменники на «-ть» після приголосного, а також слова «кров», «любов», «осінь», «сіль», «Русь», «Білорусь» можуть набувати як варіант закінчення «-и».",
        "examples": [
          [
            "optional",
            "від радості",
            "від радости"
          ],
          [
            "optional",
            "біля смерті",
            "біля смерти"
          ],
          [
            "optional",
            "з осені",
            "з осени"
          ]
        ]
      }
    ]
  },
  {
    "new": 96,
    "title": "III відміна, множина",
    "old": [
      "62"
    ],
    "minor": null,
    "major": null
  },
  {
    "new": 97,
    "title": "відмінювання слова «мати»",
    "old": [
      "63"
    ],
    "minor": null,
    "major": null
  },
  {
    "new": 98,
    "title": "IV відміна, однина",
    "old": [
      "64"
    ],
    "minor": [
      "Виправлено помилку — вказано правильні закінчення родового вімінка однини для слів IV відміни: «-ят-и», «-ат-и» та «-ен-і».",
      "Приклади оформлено так, наче слова «ім’я» та «плем’я» не мають варіантів форм «ім’ю» та «плем’ю» в давальному відмінку, проте в § 66 такі форми наведено.",
      "Наведені паралельні варіанти місцевого відмінка для слів IV відміни розбігаються, взагалі кажучи, з указаними в § 66.",
      "Вказано, що у кличному відмінку деякі іменники мають закінчення «-е» з прикладами «імене» та «племене» (чи можуть такі форми вживатися з прикметниками та присвійними займенниками, не прокоментовано); як випливає, однак, із таблиць у § 68, форми «ім’я» та (за аналогією) «плем’я» також коректні."
    ],
    "major": null
  },
  {
    "new": 99,
    "title": "IV відміна, множина",
    "old": [
      "65"
    ],
    "minor": [
      "Зазначено, що слова «вим’я», «сім’я» і «тім’я» у множині слід відмінювати як іменники II відміни, і наведено відповідні форми."
    ],
    "major": null
  },
  {
    "new": 100,
    "title": "відмінювання множинних іменників",
    "old": [
      "66"
    ],
    "minor": [
      "Вказано форму «воротям» як альтернативну до «воротам»."
    ],
    "major": null
  },
  {
    "new": 101,
    "title": "тверда група прикметників",
    "old": [
      "67.1"
    ],
    "minor": null,
    "major": null
  },
  {
    "new": 102,
    "title": "м’яка група прикметників",
    "old": [
      "67.2"
    ],
    "minor": null,
    "major": null
  },
  {
    "new": 103,
    "title": "зразки відмінювання прикметників",
    "old": [
      "68"
    ],
    "minor": null,
    "major": null
  },
  {
    "new": 104,
    "title": "ступені прикметників",
    "old": [
      "69"
    ],
    "minor": [
      "Вказано, що для утворення ступенів порівняння прикетників слова «більш», «менш», «найбільш», «найменш» вживаються рідше, ніж відповідні прикметникові суфікси."
    ],
    "major": null
  },
  {
    "new": 105,
    "title": "відмінювання кількісних числівників",
    "old": [
      "70"
    ],
    "minor": null,
    "major": null
  },
  {
    "new": 106,
    "title": "відмінювання порядкових числівників",
    "old": [
      "28.2а",
      "71"
    ],
    "minor": [
      "Зауважено, що порядкові числівники на письмі передають переважно словами.",
      "Уточнено, що при позначенні дат, сторінок видань та після римських цифр літерні закінчення порядкових числівників не пишуть."
    ],
    "major": [
      {
        "description": "Числівники «три» й «чотири» поєднуються з частинами «тисячний», «мільйонний» і подібними лише у формах «трьох-», «чотирьох-».",
        "examples": [
          [
            "compulsory",
            "тритисячний",
            "трьохтисячний"
          ],
          [
            "compulsory",
            "чотиримільйонна",
            "чотирьохмільйонна"
          ]
        ]
      }
    ]
  },
  {
    "new": 107,
    "title": "відмінювання дробових числівників",
    "old": [
      "72"
    ],
    "minor": null,
    "major": [
      {
        "description": "Знаменники дробів із числівниками з компонентами «дві», «три», «чотири» мають закінчення «-их»/«-іх» («дві третіх» замість «дві треті», «чотири сьомих» замість «чотири сьомі»).",
        "examples": [
          [
            "compulsory",
            "дві треті",
            "дві третіх"
          ],
          [
            "compulsory",
            "чотири сьомі",
            "чотири сьомих"
          ]
        ]
      }
    ]
  },
  {
    "new": 108,
    "title": "особові займенники",
    "old": [
      "73"
    ],
    "minor": [
      "Продемонстровано перехід наголосу в конструкціях «до мене» й «на тебе»."
    ],
    "major": null
  },
  {
    "new": 109,
    "title": "зворотний займенник",
    "old": [
      "74"
    ],
    "minor": [
      "Продемонстровано перехід наголосу в конструкціях «до себе» й «на себе»."
    ],
    "major": null
  },
  {
    "new": 110,
    "title": "присвійні займенники",
    "old": [
      "75"
    ],
    "minor": null,
    "major": null
  },
  {
    "new": 111,
    "title": "вказівні займенники",
    "old": [
      "76"
    ],
    "minor": null,
    "major": null
  },
  {
    "new": 112,
    "title": "питальні займенники",
    "old": [
      "77"
    ],
    "minor": null,
    "major": null
  },
  {
    "new": 113,
    "title": "означальні займенники",
    "old": [
      "78"
    ],
    "minor": null,
    "major": null
  },
  {
    "new": 114,
    "title": "складні займенники",
    "old": [
      "79"
    ],
    "minor": [
      "Доповнено перелік форм складних займенників."
    ],
    "major": null
  },
  {
    "new": 115,
    "title": "дієслово",
    "old": [
      "80"
    ],
    "minor": [
      "Вилучено примітку, що коментувала різницю між чергуваннями «ж» і «дж» та, зокрема, пару слів «воджу» — «вожу».",
      "Вилучено згадку дієприкметників на «-ячий» («гублячий», «роблячий»).",
      "Форму «відповідять» замінено на «дадуть відповідь» (те ж поширюється на коректність цієї форми для інших дієслів на «-вісти»).",
      "Виправлено (хоча й не повністю) перелік форм дієслова, в яких постфікс «-ся» може змінюватися на «-сь»; додано, що це відбувається в усному мовленні та в художньому стилі; роз’яснено, коли таке перетворення може, а коли не може відбуватися у формі однини чоловічого роду минулого часу."
    ],
    "major": null
  },
  {
    "new": 116,
    "title": "наказовий спосіб",
    "old": [
      "81"
    ],
    "minor": null,
    "major": null
  },
  {
    "new": 117,
    "title": "умовний спосіб",
    "old": [
      "82"
    ],
    "minor": null,
    "major": null
  },
  {
    "new": 118,
    "title": "інфінітив",
    "old": [
      "83"
    ],
    "minor": null,
    "major": null
  },
  {
    "new": 119,
    "title": "дієприкметник",
    "old": [
      "84"
    ],
    "minor": [
      "Вилучено приклади дієприкметників активного стану теперішнього часу «виконуючий», «зростаючий», «мобілізуючий», «організуючий», «перетворюючий», «працюючий» (були з поміткою «зрідка») на користь прикладів «квітучий», «живучий», «лежачий», «стоячий» та коментаря, що подібні дієприкметники вживаються переважно в значенні прикметників та іменників.",
      "Вилучено частини приміток, що перетинаються з уже наявною в параграфі інформацією, а також примітку про появу «е»/«є» в дієприкметниках від дієслів з основою на приголосний, «-и», «-і» та «-ї»."
    ],
    "major": null
  },
  {
    "new": 120,
    "title": "дієприслівник",
    "old": [
      "85"
    ],
    "minor": [
      "Додано примітку про те, що дієприслівники, утворені від зворотних дієслів, мають постфікс «-сь» або — рідше — «-ся»."
    ],
    "major": null
  },
  {
    "new": 121,
    "title": "передача звука [l]",
    "old": [
      "86"
    ],
    "minor": [
      "Зауважено, що в новітніх запозиченнях з англійської звук [l] передається твердим «л» (як у словах «ланч» та «сейл»).",
      "До прикладів, серед інших, додано імена «Кромвель» та «Леннон»."
    ],
    "major": [
      {
        "description": "Прізвище «Лессінг» слід писати з літерою «і».",
        "examples": [
          [
            "compulsory",
            "Лессинг",
            "Лессінг"
          ]
        ]
      }
    ]
  },
  {
    "new": 122,
    "title": "передача звуків [g], [h]",
    "old": [
      "15",
      "87"
    ],
    "minor": [
      "До переліку слів, що пишуться через «г», додано зокрема «блогер», «маркетинг», «серфінг», «Фольксваген» та «Чикаго».",
      "Список мов, деякі слова яких, що містять [h] та близькі до нього звуки, передаються літерою «х», розширено з англійської до «європейських та деяких східних»; розширено і список слів: додано «холдинг», «брахман», «харакірі», «Аллах», «Хаммурапі» та ін."
    ],
    "major": [
      {
        "description": "В іменах та прізвищах допускається передавання звука [g] як буквою «г», так і літерою «ґ».",
        "examples": [
          [
            "optional",
            "Агата",
            "Аґата"
          ],
          [
            "optional",
            "Людвіг",
            "Людвіґ"
          ],
          [
            "optional",
            "Гегель",
            "Геґель"
          ]
        ]
      },
      {
        "description": "Слово «госпіс» слід писати з літерою «г».",
        "examples": [
          [
            "compulsory",
            "хоспіс",
            "госпіс"
          ]
        ]
      }
    ]
  },
  {
    "new": 123,
    "title": "«th» у словах грецького походження",
    "old": [
      "88"
    ],
    "minor": [
      "Зникла інформація стосовно правопису слів через «ф» крім тих, що походять із грецьких з літерою «θ»."
    ],
    "major": [
      {
        "description": "У словах грецького походження, де літеру «θ» (тета) узвичаєно як «ф», допускається варіантне написання через «т» з можливим чергуванням сусідньої «і» з «и» чи «е».",
        "examples": [
          [
            "optional",
            "арифметика",
            "аритметика"
          ],
          [
            "optional",
            "міфічний",
            "мітичний"
          ],
          [
            "optional",
            "Ефіопія",
            "Етіопія"
          ]
        ]
      }
    ]
  },
  {
    "new": 124,
    "title": "«w», «th» в англійських словах",
    "old": [
      "97"
    ],
    "minor": [
      "Передача «w» у словах англійського походження через «в» поширено на загальні назви.",
      "З прикладів слів, які передають англійське «w» як «у», прибрано «Уайльд», «Уеллс», «Уолл-стрит», «Хемінгуей» без додаткових коментарів та додано «уайт-спірит» з приміткою «за традицією».",
      "Уточнено, що англійське «th» через «т» передається на позначення звука [θ], тоді як на позначення [ð] використовують «з» або рідше «т» чи «с»."
    ],
    "major": [
      {
        "description": "Слово «вікенд» слід писати через «в».",
        "examples": [
          [
            "compulsory",
            "уїкенд",
            "вікенд"
          ]
        ]
      }
    ]
  },
  {
    "new": 125,
    "title": "«ll» та «ill» у французьких словах",
    "old": [
      "98"
    ],
    "minor": [
      "Уточнено, що інколи французьке «lle» передається через «ль», а не «й»."
    ],
    "major": null
  },
  {
    "new": null,
    "title": "«j» у французьких, англійських, іспанських словах",
    "old": [
      "90.1"
    ],
    "minor": [
      "Зник пункт про передачу «j» у словах французького походження через «ж», англійського — через «дж», а іспанського — через «х», хоча слова французького походження з «ж» та англійського із «дж» трапляються деінде у правописі."
    ],
    "major": null
  },
  {
    "new": 126,
    "title": "передача звука [j]",
    "old": [
      "90.2",
      "90.3",
      "90.4"
    ],
    "minor": [
      "Зникла згадка слів на кшталт «ієрархія» та «ієрогліф», а також «іон», «іонійський»."
    ],
    "major": [
      {
        "description": "Слова «проєкт», «проєкція» та похідні від них слід писати з літерою «є».",
        "examples": [
          [
            "compulsory",
            "проект",
            "проєкт"
          ],
          [
            "compulsory",
            "проекція",
            "проєкція"
          ],
          [
            "compulsory",
            "проективний",
            "проєктивний"
          ]
        ]
      },
      {
        "description": "На позначення сполучень звуків [je], [ji], [ju], [ja] в іншомовних власних та загальних назвах ніколи не пишуть літеру «й» перед «є», «ї», «ю» чи «я».",
        "examples": [
          [
            "compulsory",
            "секвойя",
            "секвоя"
          ],
          [
            "compulsory",
            "Майя",
            "Мая"
          ],
          [
            "compulsory",
            "Фейєрбах",
            "Феєрбах"
          ]
        ]
      }
    ]
  },
  {
    "new": 127,
    "title": "передача кінцевих «-dr», «-tr»",
    "old": [
      "96"
    ],
    "minor": null,
    "major": null
  },
  {
    "new": 128,
    "title": "подвоєні приголосні у запозиченнях",
    "old": [
      "89"
    ],
    "minor": [
      "У список винятків з подвоєнням додано «донна» й «панно»; прибрано «мотто» й «нетто».",
      "Серед інших, з прикладів вилучено слово «Калькутта».",
      "Зауважено, що в загальних назвах, які утворені від власних без додавання афіксів, приголосні не подвоюються («ват», «бекерель», «гаус» і т. п.).",
      "Додано примітку, що за традицією в деяких власних назвах подвоєння не зберігається (з прикладами «Пенсільванія» та «Міссісіпі»)."
    ],
    "major": [
      {
        "description": "Буквосполучення «ck» германських мов слід передавати однією літерою «к».",
        "examples": [
          [
            "compulsory",
            "Діккенс",
            "Дікенс"
          ],
          [
            "compulsory",
            "Кентуккі",
            "Кентукі"
          ],
          [
            "compulsory",
            "лезо Оккама",
            "лезо Окама"
          ]
        ]
      },
      {
        "description": "У власних назвах кельтського походження (а також у похідних від них словах), де префікс «Мак» за традицією поєднується з основою на «к-» в одне слово, зберігається подвоєння «кк», зокрема правильним є написання «Маккензі» та «Маккінлі».",
        "examples": [
          [
            "compulsory",
            "Макензі",
            "Маккензі"
          ],
          [
            "compulsory",
            "Мак-Кінлі",
            "Маккінлі"
          ]
        ]
      }
    ]
  },
  {
    "new": 129,
    "title": "передача звука [i]",
    "old": [
      "90.5"
    ],
    "minor": [
      "Уточнено, що літерами «і»/«ї»/«и» передаються не лише латинські «i» та «y», але й «e», «ea», «ee», «ie» та ін. Формально зникла вимога, що регламентує написання «і» між двома приголосними в прикметниках, утворених від імен та прізвищ (але залишилась така вимога для самих імен та прізвищ).",
      "Зникла примітка про написання «і» між приголосними в словах «піанісимо», «гратіс» і подібних (які слова вважаються подібними, уточнено не було).",
      "Зі списку слів-винятків, що пишуться через «и», вилучено слова «бурмистер», «кинджал», «киргиз», «кишлак», а також «Аргентина» та «Братислава».",
      "Додано, що правило дев’ятки не поширюється на випадок, коли наступним приголосним є «й».",
      "З прикладів прибрано слово «зиґзаґ».",
      "Зникло зауваження, що «і» всередині слова перед голосним іноді переходить у «й» та відповідно передається на письмі (з прикладами «курйоз», «кар’єра» та ін.)."
    ],
    "major": [
      {
        "description": "В усіх географічних назвах іншомовного походження між «р» та наступним приголосним (крім «й») слід писати «и».",
        "examples": [
          [
            "compulsory",
            "Меріленд",
            "Мериленд"
          ],
          [
            "compulsory",
            "Гольфстрім",
            "Гольфстрим"
          ],
          [
            "compulsory",
            "антананарівець",
            "антананаривець"
          ]
        ]
      },
      {
        "description": "У компоненті власних назв «-стріт» слід писати «і».",
        "examples": [
          [
            "compulsory",
            "Бейкер-стрит",
            "Бейкер-стріт"
          ]
        ]
      },
      {
        "description": "Слово «Риджент» (як, наприклад, у складі «Риджент-стріт») слід писати з літерою «и».",
        "examples": [
          [
            "compulsory",
            "Ріджент-стрит",
            "Риджент-стріт"
          ]
        ]
      },
      {
        "description": "Назву «Медина» слід писати через «и».",
        "examples": [
          [
            "compulsory",
            "Медіна",
            "Медина"
          ]
        ]
      },
      {
        "description": "Назву «Біарриц» слід писати через «и» в останньому складі.",
        "examples": [
          [
            "compulsory",
            "Біарріц",
            "Біарриц"
          ]
        ]
      },
      {
        "description": "Ім’я «Річард» слід писати через «і».",
        "examples": [
          [
            "compulsory",
            "Ричард",
            "Річард"
          ]
        ]
      },
      {
        "description": "Компонент «Волл» (як, наприклад, у складі «Волл-стріт») слід писати з літерою «В».",
        "examples": [
          [
            "compulsory",
            "Уолл-стрит",
            "Волл-стріт"
          ]
        ]
      }
    ]
  },
  {
    "new": 130,
    "title": "передача звуків [e], [u]",
    "old": [
      "90.6",
      "91"
    ],
    "minor": [
      "Додано коментар, що «є» пишеться в низці слів грецького походження релігійної тематики («єпископ», «єресь» та ін.).",
      "Крім цих слів і власних назв, у параграфі не залишено жодного прикладу слова, що починалося б на «є».",
      "Літеру «й» прибрано з переліку тих, після яких замість «е» вживається «є».",
      "Із прикладів прибрано слово «Овєдо».",
      "Прибрано примітку, що в словах «проєкт», «проєкція» пишеться «е» — див. § 126.",
      "Примітку про передавання «oе», «ö» та «eu» перенесено в § 132.",
      "Прибрано згадку про написання «парфумів» і споріднених слів через «у», проте деінде в тексті правопису їх написано саме так."
    ],
    "major": [
      {
        "description": "Слово «дієз» (та похідні) слід писати з літерою «є».",
        "examples": [
          [
            "compulsory",
            "діез",
            "дієз"
          ],
          [
            "compulsory",
            "соль-діез",
            "соль-дієз"
          ]
        ]
      },
      {
        "description": "Слово «рієлтор» пишеться з літерами «є» та «о».",
        "examples": [
          [
            "compulsory",
            "ріелтер",
            "рієлтор"
          ],
          [
            "compulsory",
            "ріелтерський",
            "рієлторський"
          ]
        ]
      },
      {
        "description": "Імена «Арієль» та «Данієль» пишуться з літерою «є».",
        "examples": [
          [
            "compulsory",
            "Аріель",
            "Арієль"
          ],
          [
            "compulsory",
            "Даніелів",
            "Данієлів"
          ]
        ]
      }
    ]
  },
  {
    "new": 131,
    "title": "передача буквосполучень «au», «ou»",
    "old": [
      "94"
    ],
    "minor": [
      "Зникло зауваження про те, що «au» може інколи передаватися як «ав» у довільному контексті."
    ],
    "major": [
      {
        "description": "Запозичення з давньогрецької і, як випливає з поданих прикладів, латинської мови, що містять буквосполучення «ау», можна альтернативно записувати через «ав». ",
        "examples": [
          [
            "optional",
            "аукціон",
            "авкціон"
          ],
          [
            "optional",
            "аутоімунний",
            "автоімунний"
          ],
          [
            "optional",
            "тезаурус",
            "тезаврус"
          ]
        ]
      }
    ]
  },
  {
    "new": 132,
    "title": "передача «ö», «ø», «eu», «ое»",
    "old": [
      "91 (примітка)"
    ],
    "minor": [
      "До переліку літер, яким в українській мові відповідає «е», додано «ø».",
      "Подано (невичерпний) перелік мов, відповідні літери яких переходять у «е»: німецька, данська, іспанська, норвезька, турецька, французька, шведська.",
      "Уточнено, що у випадку, коли такий звук іде після [j], його передають за допомогою «є»."
    ],
    "major": null
  },
  {
    "new": 133,
    "title": "[au], [ei], [ou] в англійських словах",
    "old": [
      "94"
    ],
    "minor": [
      "Уточнено, що англійський дифтонг [ei] передається зазвичай через «ей».",
      "Додано коментар, що окремі слова з дифтонгами [ei] та [ou] ввійшли в українську мову в адаптованому вигляді з голосними «е» та «о».",
      "Серед прикладів слів, де [ei] передається як «е», вказано слово «брек» — очевидно, помилка."
    ],
    "major": [
      {
        "description": "Літеру «w» у складі «-owe-» в англійських прізвищах слід передавати з допомогою «у».",
        "examples": [
          [
            "compulsory",
            "Малкольм Макдавелл",
            "Малкольм Макдауелл"
          ],
          [
            "compulsory",
            "Остін Паверс",
            "Остін Пауерс"
          ]
        ]
      },
      {
        "description": "Слово «бебібум» слід писати без літери «й» та дефіса.",
        "examples": [
          [
            "compulsory",
            "бейбі-бум",
            "бебібум"
          ]
        ]
      }
    ]
  },
  {
    "new": 134,
    "title": "[æ] в англійських словах",
    "old": null,
    "minor": [
      "Сказано, що англійський звук [æ] зазвичай передається через «а» («спам», «чат» та ін.), але в багатьох словах за традицією через «е» («менеджер», «Сем» та ін.)."
    ],
    "major": [
      {
        "description": "Англійське «Lambert» слід передавати як «Лемберт».",
        "examples": [
          [
            "compulsory",
            "Міранда Ламберт",
            "Міранда Лемберт"
          ]
        ]
      },
      {
        "description": "Назву вулиці в Лондоні слід писати як «Пелл-Мелл».",
        "examples": [
          [
            "compulsory",
            "Пел-Мел",
            "Пелл-Мелл"
          ]
        ]
      }
    ]
  },
  {
    "new": 135,
    "title": "[ə:] в англійських словах",
    "old": null,
    "minor": [
      "Сказано, що англійський звук [ə:] (насправді, ймовірно, йдеться про [ɜː]) не має в українській мові фонетичного аналога й відтворюється здебільшого буквосполученням «ер» («Мерфі», «Черчилль» та ін.); проте деякі українські слова передають форму відповідних англійських буквосполучень графічно («курсор», «Ірвінг» та ін.)."
    ],
    "major": [
      {
        "description": "Ім’я або назву міста «Шерлі» слід писати через «е».",
        "examples": [
          [
            "compulsory",
            "Ширлі",
            "Шерлі"
          ]
        ]
      }
    ]
  },
  {
    "new": 136,
    "title": "німецькі «ei», «eu»; нідерландські «ij», «y»",
    "old": [
      "95"
    ],
    "minor": [
      "З переліку буквосполучень, які українською передаються через «ей», зникло англійське «ey».",
      "Нідерландське «iy» виправлено на «ij».",
      "З прикладів зникли прізвища «Ейнштейн» та «Ван-Дейк»."
    ],
    "major": [
      {
        "description": "Слово «фройляйн» слід писати з голосними «о» та «я».",
        "examples": [
          [
            "compulsory",
            "фрейлейн",
            "фройляйн"
          ]
        ]
      },
      {
        "description": "Німецьке прізвище «Віттгенштайн» слід писати з подвоєним «т» і літерою «а».",
        "examples": [
          [
            "compulsory",
            "Вітгенштейн",
            "Віттгенштайн"
          ]
        ]
      }
    ]
  },
  {
    "new": 137,
    "title": "подвоєні голосні у власних назвах",
    "old": [
      "99"
    ],
    "minor": [
      "Подвоєння голосних поширено з імен та прізвищ фінської та естонської мов на всі іншомовні власні назви."
    ],
    "major": [
      {
        "description": "Німецьку назву «Ванзее» слід писати з одним «н» та двома «е».",
        "examples": [
          [
            "compulsory",
            "Ваннзеє",
            "Ванзее"
          ]
        ]
      }
    ]
  },
  {
    "new": 138,
    "title": "апостроф у запозиченнях",
    "old": [
      "92"
    ],
    "minor": null,
    "major": [
      {
        "description": "Прізвище «Донаг’ю» слід писати з літерою «г».",
        "examples": [
          [
            "compulsory",
            "Донах’ю",
            "Донаг’ю"
          ]
        ]
      }
    ]
  },
  {
    "new": 139,
    "title": "м’який знак у запозиченнях",
    "old": [
      "93"
    ],
    "minor": [
      "Зник коментар про те, коли між приголосним та йотованим голосним у слові іншомовного походження м’який знак писати не слід."
    ],
    "major": null
  },
  {
    "new": 140,
    "title": "відмінювання запозичених слів",
    "old": [
      "100"
    ],
    "minor": [
      "Уточнено, що односкладові слова іншомовного походження на «-а», «-я» («бра», «ля») не відмінюються.",
      "Уточнено, що іменники іншомовного походження на «-и» («Алмати», «Амангельди») не відмінюються.",
      "У списку слів-винятків, що відмінюються, до слова «пальто» додано «вино» та «ситро».",
      "Уточнено, що назви на кшталт «Таймс-сквер» та «Адам-стріт» не відмінюються.",
      "Зазначено, що не відмінюються етикетні означення жінки, які закінчуються на приголосний («міс», «фрекен» і т. п.).",
      "Зник коментар, що жіночі прізвища на «-ін» та «-ов» не відмінюються.",
      "Сказано, що не відмінюються особові імена в складі жіночої форми азербайджанських імен по батькові з компонентом «кизи» («до Зульфії Мурад-кизи»).",
      "Загалом список прикладів невідмінюваних слів іншомовного походження суттєво розширено.",
      "Видалено примітку про те, що слов’янські чоловічі імена та прізвища на «-о» відмінюються («Бранко» — «Бранка», «Костюшко» — «Костюшка» та ін.)."
    ],
    "major": [
      {
        "description": "Компоненти назв «-стріт», «-сквер», «-роуд», «-ривер», «-лейн» слід писати з малої літери.",
        "examples": [
          [
            "compulsory",
            "Фолл-Ривер",
            "Фолл-ривер"
          ]
        ]
      },
      {
        "description": "Компонент власних назв «-ривер» слід писати з літерою «и».",
        "examples": [
          [
            "compulsory",
            "Ред-Рівер",
            "Ред-ривер"
          ]
        ]
      },
      {
        "description": "Слово «місис» слід писати з «и» в останньому складі.",
        "examples": [
          [
            "compulsory",
            "місіс",
            "місис"
          ]
        ]
      },
      {
        "description": "Слово «мадемуазель» є невідмінюваним.",
        "examples": [
          [
            "compulsory",
            "з мадемуазеллю",
            "з мадемуазель"
          ]
        ]
      },
      {
        "description": "Прізвище «Дойл» не містить м’якого знака в кінці.",
        "examples": [
          [
            "compulsory",
            "Артур Конан Дойль",
            "Артур Конан Дойл"
          ]
        ]
      },
      {
        "description": "У багатокомпонентних (з пробілами або дефісами) іменах та прізвищах іншомовного походження, навіть таких, як «Жан-Жак», слід відмінювати всі складники.",
        "examples": [
          [
            "compulsory",
            "над Жан-Жаком",
            "над Жаном-Жаком"
          ],
          [
            "compulsory",
            "від Захер-Мазоха",
            "від Захера-Мазоха"
          ],
          [
            "compulsory",
            "з Артуром Конан Дойлем",
            "з Артуром Конаном Дойлом"
          ]
        ]
      },
      {
        "description": "У чоловічих формах арабських, перських, тюркських імен (але не прізвищ) із частинами, що вказують на родинні стосунки або соціальне становище («огли», «паша» і под.), відмінюються всі відмінювані частини імені.",
        "examples": [
          [
            "compulsory",
            "із Кемаль-пашею",
            "із Кемалем-пашею"
          ],
          [
            "compulsory",
            "для Гасаногли",
            "для Гасана-огли"
          ],
          [
            "compulsory",
            "услід Мехмедбею",
            "услід Мехмедові-бею"
          ]
        ]
      },
      {
        "description": "Жіночі імена, що закінчуються на губний або м’який приголосний (крім «й»), відмінюються (проте «Кім» наведено як приклад жіночого імені що є невідмінюваним).",
        "examples": [
          [
            "compulsory",
            "над Ніколь",
            "над Ніколлю"
          ],
          [
            "compulsory",
            "завдяки Мішель",
            "завдяки Мішелі"
          ],
          [
            "compulsory",
            "від Зейнаб",
            "від Зейнабі"
          ],
          [
            "compulsory",
            "з Мер’єм",
            "з Мер’єм’ю"
          ]
        ]
      }
    ]
  },
  {
    "new": 141,
    "title": "правопис українських імен та прізвищ",
    "old": [
      "101"
    ],
    "minor": null,
    "major": null
  },
  {
    "new": 142,
    "title": "відмінювання прізвищ",
    "old": [
      "102"
    ],
    "minor": [
      "Уточнено, що прізвища на кшталт «Дідуньо» та «Іваньо» в давальному та місцевому відмінках мають по три варіанти закінчень: «Іваневі», «Іваньові», «Іваню».",
      "Уточнено, що всі чоловічі прізвища II відміни в родовому відмінку мають закінчення «-а»/«-я».",
      "Уточнено, що неслов’янські змінювані прізвища відмінюються як українські іменники з відповідними закінченнями («Окуджави», «Шекспірові» тощо).",
      "Прибрано варіанти форм кличного відмінка, що збігаються з називним, від прізвищ «Павлов», «Ковалів», «Прокопів», «Кирчів», «Гаршин», «Романишин», проте в § 87 явно сказано, що такі варіанти є можливими.",
      "Уточнено випадки, коли у слов’янських прізвищ та імен зберігається суфіксальний «-е-»: раніше було вказано, що це відбувається в усіх чеських та польських прізвищах, тепер — у чеських, словацьких та польських прізвищах на «-ек», «-ер», «-ел» (але не в іменах: «Павел» — «Павла»); також «-е-» випадає при відмінюванні прізвищ слов’янського походження на «-ець».",
      "Підкреслено відмінність у формах орудного відмінка між прізвищами на зразок «Романишин» та «Русин», про що детальніше йдеться в § 85.",
      "Загалом розширено список прикладів відмінювання прізвищ."
    ],
    "major": null
  },
  {
    "new": 143,
    "title": "відмінювання імен",
    "old": [
      "103"
    ],
    "minor": [
      "Додано, що українські імена на письмі передаються відповідно до вимови.",
      "Для чоловічих імен на кшталт «Антон» та «Сергій» додатковово до «Антонові», «Сергієві» подано варіант місцевого відмінка на «-у»/«-ю» (проте не подано на «-і»/«-ї» — крім як для імені «Тиміш»): імовірно, маються на увазі форми, що можна вживати з прийменником «по».",
      "Відповідно до § 87, додано форму кличного відмінка «Олеже», а форму кличного відмінка від імені «Ігор» подано як «Ігорю».",
      "У формах однини імені «Тиміш» наголос може падати як на закінчення, так і на останній склад основи; у кличному відмінку однини лише на останній склад основи; у кличному множини — лише на закінчення.",
      "Уточнено, що є лише один варіант форми кличного відмінка від імені «Лев» — «Леве».",
      "Додано зразок відмінювання чоловічих імен із по батькові."
    ],
    "major": null
  },
  {
    "new": 144,
    "title": "слов’янські імена та прізвища",
    "old": [
      "104"
    ],
    "minor": [
      "Зазначено, що білоруські та російські імена за традицією не транслітерують, а передають українськими відповідниками; винятками є імена деяких білоруських діячів культури (Алеся Адамовича, Пятруся Бровки, Ригора Бородуліна та ін.).",
      "Уточнено, що в південнослов’янських іменах (а не лише прізвищах) кириличну літеру «и» або латинську «i» українською слід передавати через «і» на початку слів та через «ї» після голосних.",
      "Написання української «і» на місці латинської «i» на початку слова та після приголосного поширено з західнослов’янських прізвищ також і на імена.",
      "Західнослов’янські імена з «i» після шиплячих (але не в кінці слова) передаються через «и».",
      "Зазначено, що в кінці західнослов’янських імен та прізвищ латинську «i» слід передавати українською «і» з прикладами «Єжі», «Єнсі» та «Їржі»; проте «Єжі» в оригіналі має літеру «y» і, отже, за правилами мало би передаватися як «Єжи»; «Єнсі» насправді не є західнослов’янським іменем; інших поширених імен або прізвищ, що підпадали б під це правило, знайти не вдалося.",
      "Вказано, що білоруську «ы» слід передавати через «и»; прибрано приклади «Журавський», «Короткевич», «Янка Купала», «Цьотка».",
      "У прикладах польських прізвищ із «ą» та «ę» прізвище «Єндриховський» виправлено на «Єнджиховський».",
      "Природним чином розширено список мов, прикметникові закінчення у прізвищах яких передаються українським «-ий».",
      "У прикладах подано польське прізвище «Свідзинський», написання першої з двох «и» в якому суперечить поданим у параграфі правилам.",
      "Зауважено, що в слов’янських прізвищах, що належать до I відміни та мають м’який останній приголосний, вживаємо закінчення «-я» замість «-а» (хоча не є зрозумілим, скажімо, чи завжди в південнослов’янських іменах слід вживати «-ця», а не «-ца»)."
    ],
    "major": [
      {
        "description": "На загальних підставах російське прізвище «Ефимов» слід передавати як «Єфімов», «Зверев» — як «Звєрев», «Дягилев» — як «Дягилєв», «Зябрев» — як «Зябрев».",
        "examples": [
          [
            "compulsory",
            "Єфимов",
            "Єфімов"
          ],
          [
            "compulsory",
            "Звєрєв",
            "Звєрев"
          ],
          [
            "compulsory",
            "Дягилев",
            "Дягилєв"
          ],
          [
            "compulsory",
            "Зябрєв",
            "Зябрев"
          ]
        ]
      },
      {
        "description": "Російське прізвище українського походження «Нарежный» слід передавати як «Нарєжний».",
        "examples": [
          [
            "compulsory",
            "Нарежний",
            "Нарєжний"
          ]
        ]
      },
      {
        "description": "Прізвище «Солженицин» слід на загальних підставах писати через «-иц-».",
        "examples": [
          [
            "compulsory",
            "Солженіцин",
            "Солженицин"
          ]
        ]
      },
      {
        "description": "Російські прізвища на «-геев», «-кеев», «-хеев» слід передавати через «-еєв».",
        "examples": [
          [
            "compulsory",
            "Сергєєв",
            "Сергеєв"
          ],
          [
            "compulsory",
            "Макєєв",
            "Макеєв"
          ],
          [
            "compulsory",
            "Міхєєва",
            "Міхеєва"
          ]
        ]
      },
      {
        "description": "Російські прізвища на «-ой» слід передавати через «-ий» (за винятком прізвища «Толстой»).",
        "examples": [
          [
            "compulsory",
            "Крамськой",
            "Крамський"
          ],
          [
            "compulsory",
            "Луговой",
            "Луговий"
          ],
          [
            "compulsory",
            "Корчной",
            "Корчний"
          ]
        ]
      },
      {
        "description": "Прізвище польського походження слід писати як «Свенцицький».",
        "examples": [
          [
            "compulsory",
            "Свенціцький",
            "Свенцицький"
          ]
        ]
      },
      {
        "description": "М’якість у польських прізвищах приголосних «n», «s», «c», «dz» перед іншими приголосними, зокрема й твердими, в українській мові м’яким знаком не позначається.",
        "examples": [
          [
            "compulsory",
            "Квасьневський",
            "Квасневський"
          ],
          [
            "compulsory",
            "Урбаньчик",
            "Урбанчик"
          ]
        ]
      },
      {
        "description": "Після «ц» у польських, чеських та словацьких іменах та прізвищах на місці латинського «i» слід писати українське «и».",
        "examples": [
          [
            "compulsory",
            "Ціхоцький",
            "Цихоцький"
          ],
          [
            "compulsory",
            "Францішек",
            "Францишек"
          ]
        ]
      },
      {
        "description": "Ім’я «Їржі» пишеться з «і» в кінці.",
        "examples": [
          [
            "compulsory",
            "Їржи",
            "Їржі"
          ]
        ]
      },
      {
        "description": "Прізвище «Гуляшки» не має «й» у кінці та не відмінюється.",
        "examples": [
          [
            "compulsory",
            "Андрей Гуляшкий",
            "Андрей Гуляшки"
          ],
          [
            "compulsory",
            "Андрею Гуляшкому",
            "Андрею Гуляшки"
          ]
        ]
      },
      {
        "description": "У болгарських, македонських, словенських та сербохорватських іменах (а не лише прізвищах) кириличну літеру «и» або латинську «i» після приголосних українською мовою слід передавати через «и».",
        "examples": [
          [
            "compulsory",
            "Мілош Єлич",
            "Милош Єлич"
          ],
          [
            "compulsory",
            "Біляна Дудова",
            "Биляна Дудова"
          ]
        ]
      }
    ]
  },
  {
    "new": 145,
    "title": "неслов’янські імена та прізвища",
    "old": [
      "105"
    ],
    "minor": null,
    "major": null
  },
  {
    "new": 146,
    "title": "складні та складені імена та прізвища",
    "old": [
      "106"
    ],
    "minor": [
      "Ім’я «Олена Прекрасна» змінено на «Єлена Прекрасна», а «Ричард Левове Серце» — на «Річард Левове Серце (відповідно до § 129).",
      "Виправлено «Жорж Занд» на «Жорж Санд».",
      "Відповідно до § 49, деякі імена, що починаються на «д’», записано з малою літерою «д».",
      "Написання «О’Генрі» виправлено на «О. Генрі».",
      "До переліку східноазійських мов, складові частини яких пишуться окремо, додано китайську.",
      "Одне з корейських імен записано двома словами замість трьох, проте не надано коментаря, в яких випадках корейські імена слід записувати таким чином.",
      "Подано (певно, помилкове) написання «Кім Ир Сен», проте в наступному параграфі наведено варіант «Кім Ір Сен».",
      "Прізвище «Гнуєн» виправлено на «Нгуєн».",
      "Вилучено єдиний приклад індонезійського (імовірно) імені «Фетай Чотінучит».",
      "Уточнено, що в складених китайських, корейських, в’єтнамських, м’янмських та індонезійських іменах відмінюваною є лише остання частина і лише якщо вона закінчується на приголосний («Хо Ші Мін» — «Хо Ші Міна», «Ден Сяопін» — «Ден Сяопіна», «Чан Кайші» — «Чан Кайші»).",
      "Додано, що вірменські прізвища з початковим компонентом «Тер» слід писати через дефіс («Тер-Петросян»).",
      "Уточнено, що прізвища на кшталт «Сивокінь», «Підкуймуха» чи «Білоцерківський» відмінюються як відповідні іменники чи прикметники.",
      "Вказано, що в складних прізвищах із дефісом відмінюються всі змінювані частини («Квітки-Основ’яненка», «Нечуя-Левицького», «Драй-Хмари»)."
    ],
    "major": [
      {
        "description": "Складова частина «ван» у таких іменах, як «ван Дейк» чи «ван дер Варден», пишеться окремо та з малої літери (якщо з малої літери цю частину пишуть у мові оригіналу).",
        "examples": [
          [
            "compulsory",
            "Ван-Дейк",
            "ван Дейк"
          ],
          [
            "compulsory",
            "Ван-дер-Варден",
            "ван дер Варден"
          ],
          [
            "compulsory",
            "ван-дер-варденівський",
            "вандерварденівський"
          ]
        ]
      },
      {
        "description": "Ім’я корейського філософа слід писати як «Пак Чівон».",
        "examples": [
          [
            "compulsory",
            "Пак Ті Вон",
            "Пак Чівон"
          ]
        ]
      },
      {
        "description": "Ім’я «Фрідріх» слід писати з двома літерами «і».",
        "examples": [
          [
            "compulsory",
            "Фрідрих",
            "Фрідріх"
          ]
        ]
      },
      {
        "description": "Східні імена (але не прізвища) з кінцевими компонентами «огли», «заде», «кизи», «бей», «хан» слід писати з рештою імені через дефіс із малої літери (за винятком імені Чингісхана).",
        "examples": [
          [
            "compulsory",
            "Гасаногли",
            "Гасан-огли"
          ],
          [
            "compulsory",
            "Мамедзаде",
            "Мамед-заде"
          ],
          [
            "compulsory",
            "Фікреткизи",
            "Фікрет-кизи"
          ]
        ]
      },
      {
        "description": "Східні прізвища (але не імена) з кінцевим компонентом «паша» слід писати без дефіса.",
        "examples": [
          [
            "compulsory",
            "Шуджа-паша",
            "Шуджапаша"
          ]
        ]
      },
      {
        "description": "У складених прізвиськах на кшталт «Річард Левове Серце» потрібно відмінювати кожну з частин.",
        "examples": [
          [
            "compulsory",
            "із Ричардом Левове Серце",
            "із Річардом Левовим Серцем"
          ],
          [
            "compulsory",
            "до Володимира Красне Сонечко",
            "до Володимира Красного Сонечка"
          ]
        ]
      }
    ]
  },
  {
    "new": 147,
    "title": "похідні від складних та складених імен прикметники",
    "old": [
      "107"
    ],
    "minor": [
      "Відповідно до оновлень правил з інших параграфів, прізвище «де Голль» записано як «де Ґолль», а ім’я «Ричард» — як «Річард»."
    ],
    "major": [
      {
        "description": "Ім’я «Жуль» (та пов’язані слова) на загальних підставах слід писати з літерою «у».",
        "examples": [
          [
            "compulsory",
            "Жюль",
            "Жуль"
          ],
          [
            "compulsory",
            "жюльєн",
            "жульєн"
          ]
        ]
      }
    ]
  },
  {
    "new": 148,
    "title": "українські географічні назви",
    "old": [
      "108"
    ],
    "minor": [
      "Зі списку географічних назв зникли «Здолбунів» та «Сіверськодонецьк»."
    ],
    "major": null
  },
  {
    "new": 149,
    "title": "географічні назви інших країн",
    "old": [
      "109.1—109.6",
      "109.7е"
    ],
    "minor": [
      "Явно вказано, що у слов’янських географічних назвах літери «ě», «e» (кириличну та латинську) та «ie» слід передавати українською «е»; раніше це випливало з уточнення, що до правопису слов’янських географічних назв застосовні також і правила написання слов’янських прізвищ.",
      "Уточнено, що написання «є» на місці «е» на початку слова, після голосного та при роздільній вимові після приголосного поширюється не лише на російську мову, а й на всі слов’янські з кириличною абеткою.",
      "Зазначено, що білоруську «е» передають через «і» у назвах, засвоєних українською мовою, або ж через «е» — із прикладом «Речиця», що в білоруській пишеться насправді з «э».",
      "Уточнено, що як прикметник середнього роду відмінюється не лише назва «Закопане», але й інші подібні назви.",
      "З’явилося уточнення, що подані правила передачі літери «ё» стосуються саме російської мови; відповідно, передача цієї літери в географічних назвах білоруської мови перестала бути регламентованою.",
      "Вилучено уточнення, що пункти про передачу кириличної «и» українською «и» стосуються лише російської мови, проте приклади залишилися виключно російськими.",
      "Прибрано пункт про написання слова «Сибір» (і «Симбірськ») та похідних через «и» у першому складі, проте це слово деінде в правописі написано саме так.",
      "Уточнено, що літеру «y» латинської абетки в географічних назвах слід передавати через «и» (без прикладів; можливо, маються на увазі лише слов’янські мови).",
      "Назву «Витерга» виправлено на «Витегра».",
      "Прибрано зауваження, згідно з яким у словах «Росія», «Білорусь» та похідних приголосний «с» не подвоюється."
    ],
    "major": [
      {
        "description": "Польські, чеські та словацькі географічні назви, що в мові оригіналу закінчуються на «-ce» та виражають значення множини, в українській мові слід передавати з кінцівкою «-ці» (а «-ice» — як «-иці») та відмінювати як іменники у множині.",
        "examples": [
          [
            "compulsory",
            "Кошице",
            "Кошиці"
          ],
          [
            "compulsory",
            "до Седльце",
            "до Седлець"
          ],
          [
            "compulsory",
            "під Тепліце",
            "під Теплицями"
          ]
        ]
      }
    ]
  },
  {
    "new": 150,
    "title": "прикметникові географічні назви",
    "old": [
      "109.7"
    ],
    "minor": [
      "Вказано, що російські географічні назви, похідні від прізвищ на «-ой» без суфіксів «-ск-», «-цк-», зберігають закінчення «-оє», проте єдиний наведений приклад «Толстоє» дуже сумнівний: єдиний такий населений пункт Росії, етимологію для якого вдалося з’ясувати, бере свою назву від прикметника «товстий», а не від прізвища.",
      "Додано, що правила передачі назв на «-ово», «-ево», «-ино» поширюються не лише на російську мову, а й на інші слов’янські.",
      "Доповнено, що назви на зразок «Радомсько» мають закінчення «-о» та не відмінюються.",
      "Додано, що закінчення «-ov» чеських та словацьких топонімів передають через «-ов», крім назв мішаних поселень українців і словаків, у яких за традицією вживають «-ів»."
    ],
    "major": null
  },
  {
    "new": 151,
    "title": "апостроф і м’який знак у географічних назвах",
    "old": [
      "109.8",
      "109.9",
      "110"
    ],
    "minor": [
      "Формально правила, що регламентують вживання апострофа та м’якого знака в географічних назвах, діють тепер лише для слов’янських географічних назв та назв неслов’янського походження на території слов’янських країн.",
      "Вилучено коментар про те, що апостроф слід писати в топонімах перед йотованими голосними в позиції після префікса (очевидно, слов’янського походження), навіть якщо він закінчується не на губний, задньоязиковий або «р».",
      "Вказано на можливість винятків із загальних правил вживання апострофа та м’якого знака в назвах неслов’янського походження на території слов’янських країн, проте не наведено жодного прикладу, який насправді б був винятком.",
      "Додано приклад «Оломоуць», який демонструє пом’якшення у слов’янській назві «ц» поза суфіксами «-ець», «-аць» та «-иц(я)»."
    ],
    "major": [
      {
        "description": "На загальних підставах назву «Вятка» слід писати без апострофа.",
        "examples": [
          [
            "compulsory",
            "В’ятка",
            "Вятка"
          ]
        ]
      }
    ]
  },
  {
    "new": null,
    "title": "іншомовні географічні назви",
    "old": [
      "111"
    ],
    "minor": [
      "Зник припис про те, що слов’янські географічні назви пишуться за тими самими правилами, що й слов’янські прізвища, хоча подані для обох випадків правила дійсно майже ідентичні."
    ],
    "major": null
  },
  {
    "new": 152,
    "title": "відмінювання географічних назв",
    "old": [
      "112"
    ],
    "minor": [
      "Звернено увагу, що назви на зразок «Рівне» відмінюються як прикметники, тоді як назви на кшталт «Шереметьєво» з кінцевим «-о» відмінюються як іменники середнього роду.",
      "Виправлено характеристику перших частин таких назв, як «Ростов-на-Дону» та «Франкфурт-на-Майні» з «короткої форми прикметника» на «іменник».",
      "Прибрано пункт про невідмінювані географічні назви; відповідні правила випливають із § 140."
    ],
    "major": [
      {
        "description": "У назві «Асканія-Нова» друга частина, як і перша, є відмінюваною, причому за зразком прикметника.",
        "examples": [
          [
            "compulsory",
            "біля Асканії-Нова",
            "біля Асканії-Нової"
          ],
          [
            "compulsory",
            "в Асканії-Нова",
            "в Асканії-Новій"
          ]
        ]
      }
    ]
  },
  {
    "new": 153,
    "title": "прикметники від географічних назв і назв народів",
    "old": [
      "113"
    ],
    "minor": [
      "Уточнено, що прикметникова форма від назви «Амудар’я» — «амудар’їнський» (а не «амударинський», як інакше випливало би з правил).",
      "Уточнено, що суфікс «-івський» може в загальному випадку приєднуватися до географічних назв, що закінчуються на групу приголосних, навіть якщо ця група не закінчується суфіксальним «к» (як свідчать приклади на кшталт «гамбурзький» та «ніццький», подані нижче, це правило не є імперативним)."
    ],
    "major": [
      {
        "description": "Прикметникову форму від назви «Клуж» слід записувати як «клужський», а від назви «Печ» — як «печський».",
        "examples": [
          [
            "compulsory",
            "Клузький університет",
            "Клужський університет"
          ],
          [
            "compulsory",
            "Пецький округ",
            "Печський округ"
          ]
        ]
      }
    ]
  },
  {
    "new": 154,
    "title": "складні та складені географічні назви",
    "old": [
      "114"
    ],
    "minor": [
      "З переліку прикладів вилучено назву «Запорізька Січ».",
      "Назву німецького міста виправлено з «Рудольфштадт» на «Рудольштадт», а словацького — з «Повализька Бистриця» на «Поважська Бистриця».",
      "Уточнено, що не тільки прикметники, а й назви жителів від таких географічних назв, як «Біла Церква» чи «Нове Місто», пишуться одним словом.",
      "Назву «Кзил-Орда» оновлено до «Кизил-Орда».",
      "Уточнено, що географічні назви з другим компонентом «-даг», «-дар’я» та под. пишуться разом.",
      "Відповідно до § 129, компонент «-стріт» записано з літерою «і».",
      "Вилучено приклад «Сант-Яго».",
      "Виправлено назви «Сахо-сквер» на «Сохо-сквер» та «Бонна-фіорд» на «Бокна-фіорд».",
      "Зникло правило, що регламентувало написання (через дефіс) прикметників від географічних назв з іменем та прізвищем на кшталт «село Івана Франка».",
      "Додано примітку про те, що назви жителів населених пунктів із назвою з дефісом слід писати разом («іванофранківці», «ньюйорківці»)."
    ],
    "major": [
      {
        "description": "Назву «Сілезія» слід на загальних підставах писати з літерою «і» в першому складі.",
        "examples": [
          [
            "compulsory",
            "Силезія",
            "Сілезія"
          ]
        ]
      },
      {
        "description": "Прикметникову форму від назви «Гостролуччя» слід записувати як «гостролучанський», а від «Сухолуччя» за аналогією — як «сухолучанський».",
        "examples": [
          [
            "compulsory",
            "гостролуцький",
            "гостролучанський"
          ],
          [
            "compulsory",
            "сухолуцький",
            "сухолучанський"
          ]
        ]
      },
      {
        "description": "Назву села Сорокодуби слід писати зі сполучним «о».",
        "examples": [
          [
            "compulsory",
            "Сорокадуби",
            "Сорокодуби"
          ]
        ]
      },
      {
        "description": "Прикметникова форма від назви «П’ятихатки» й подібних закінчується на «-хатський», від «Сорокодуби» й подібних — на «-дубський», а від «Печиводи» й подібних — на «-водський».",
        "examples": [
          [
            "compulsory",
            "п’ятихатківський",
            "п’ятихатський"
          ],
          [
            "compulsory",
            "семидубівський",
            "семидубський"
          ],
          [
            "compulsory",
            "печиводівський",
            "печиводський"
          ]
        ]
      },
      {
        "description": "Складову «Атлантік» у географічних назвах слід писати з літерою «і».",
        "examples": [
          [
            "compulsory",
            "Атлантик-Сіті",
            "Атлантік-Сіті"
          ]
        ]
      },
      {
        "description": "Прикметники, утворені шляхом приєднання префікса до географічної назви, що містить дефіс, слід писати без дефісів.",
        "examples": [
          [
            "compulsory",
            "приіссик-кульський",
            "приіссиккульський"
          ],
          [
            "compulsory",
            "занью-йоркський",
            "заньюйоркський"
          ]
        ]
      }
    ]
  },
  {
    "new": 155,
    "title": "крапка",
    "old": [
      "115"
    ],
    "minor": [
      "Більш розгорнуто описано варіанти використання крапки для розділення самостійних фрагментів, що могли б бути частинами складного речення.",
      "Вилучено правило про вжиток крапки для розділення елементів списку, що є реченнями (очевидно, через надлишковість).",
      "Додано, що крапку не ставлять у кінці заголовків, після імен авторів і под. Формалізовано використання крапки після імені автора цитати у дужках.",
      "Додано, що в скороченнях, утворених стягненням слова  («грн», «млрд»), крапка не ставиться."
    ],
    "major": null
  },
  {
    "new": 156,
    "title": "знак питання",
    "old": [
      "116"
    ],
    "minor": [
      "«Складну інтонацію оклику — питання», яку за попереднім правописом можна було передавати за допомогою комбінації знаків «?!» або «!?», розділено на «складну інтонацію питання / оклику», яку слід передавати як «?!» (§ 156), та «складну інтонацію оклику / питання», яку треба передавати як «!?» (§ 157).",
      "Додано пункт про вжиток знака питання посеред речення після вставленої його частини, що вимовляється з питальною інтонацією.",
      "Узаконено використання знаків питання, ужитих у репліці діалогу без тексту — для передачі «німого запитання»."
    ],
    "major": null
  },
  {
    "new": 157,
    "title": "знак оклику",
    "old": [
      "117"
    ],
    "minor": [
      "Вказано на вжиток знака оклику в реченнях, що починаються зі слів «слава», «ганьба», «хай живе» і под. Зауважено, що традиційно в українській літературі речення після знака оклику (або знака питання — як зазначено в § 156) могли продовжувати з малої літери; у сучасній практиці перевагу приписано віддавати написанню з великої букви."
    ],
    "major": null
  },
  {
    "new": 158,
    "title": "кома",
    "old": [
      "118"
    ],
    "minor": [
      "Додано примітку з коментарем про те, які прикладки є однорідними й розділяються комами (ті, що вказують на суміжні характеристики: різні сфери діяльності людини; науковий ступінь та вчене звання; почесні звання й відзнаки тощо), а які прикладки однорідними не є і комами не розділяються (ті, що характеризують предмет з різних боків: посада й науковий ступінь; титул у змаганнях і професія тощо).",
      "Уточнено, що в разі поєднання в одному ряді однорідних і неоднорідних прикладок у позиції перед іменником коми слід розставляти відповідно, тоді як кожну з прикладок у позиції після означованого іменника слід завжди відокремлювати комою.",
      "До (невичерпного) переліку усталених виразів, що пишуться без коми, додано «і хочеться і колеться».",
      "Зауважено, що, коли ряд однорідних членів речення з повторюваним сполучником «і»/«й» завершується зворотом на кшталт «і таке інше», перед цим зворотом кома не ставиться.",
      "Додано примітку про вжиток коми з повторюваними словами («Я караюсь, і тяжко караюсь»).",
      "Додано примітку про те, що у виразах на кшталт «на бистрому на озері», «за річкою за голубою» коми попри повторення прийменника зазвичай не ставлять.",
      "Зауважено, що у зворотах на кшталт «дай боже», «господи помилуй» і под. звертання не виділяється комою.",
      "Суттєво розширено допоміжний перелік вставних слів та виразів та заодно наведено їхню класифікацію.",
      "Вилучено примітку про те, що слова «адже», «все-таки», «наче», «принаймні» та інші, які не є вставними, не виділяються комами, хоча про слова «наче», «ніби» та подібні додано іншу примітку, що радить розрізняти відповідні порівняльні сполучники та частки зі значенням сумніву, що не потребують ком.",
      "Вилучено примітку про те, що перед словами «хоч», «хоча», вжитими не в допустовому реченні, а як частки, кома не ставиться.",
      "Додано примітку про виділення комами зворотів «як завжди», «як колись», «як виняток» та под. Додано примітку про два варіанти побудови речення зі зворотом «такий(,) як» і подібними: з комою перед зворотом (як складеним сполучником) або всередині нього.",
      "Регламентовано відсутність вжитку коми у реченнях зі зворотами «майже як», «зовсім як», «не як» і подібних.",
      "Наголошено на відсутності коми у конструкціях на кшталт «день як день», «люди як люди».",
      "Вказано на відсутність коми у конструкціях з повторенням присудка («зробив як зробив»).",
      "Вказано на відсутність коми у реченнях, де без звороту присудок є неповним («почувати себе як удома»).",
      "Додано примітку про відсутність ком у реченнях на кшталт «О я нещасний!» та виразах на зразок «я колишній і я теперішній».",
      "Додано пункт, що формалізує використання ком для виділення означень, що є уточненнями до іншого означення («У тексті багато маловідомих, зокрема іншомовних, слів»).",
      "Уточнено, що не відокремлюються комами означення, якщо за змістом вони стосуються радше присудка («стояв біля вікна спокійний»).",
      "Уточнено, що відокремлені прикладки, що стосуються до особових займенників, виділяються комами незалежно від своєї позиції.",
      "Описано вживання коми для виділення поширених прикладок перед означуваним іменником, якщо вони мають додатковий відтінок обставини («Хоробрі воїни, козаки ставали героями народних пісень і дум»).",
      "Сказано про виділення комами прикладок — власних назв, що мають уточнювальне значення відносно означуваних загальних назв («ще один муляр, Тимко»).",
      "Згадано про звороти «так званий», «родом» і подібні, які, коли виступають у складі відокремлених прикладок, виділяються комами.",
      "Додано пункт про виділення комами прикладок, що стосуються до іменників або особових займенників, відсутніх у реченні («Та й заплакав, сіромаха, степом ідучи»).",
      "Уточнено, що сполучник «а» залежно від логіко-інтонаційного поділу речення може або відділятися, або не відділятися комою від дієприслівникового звороту, що йде за ним.",
      "Вказано на відсутність коми у стійких зворотах на кшталт «працювати не покладаючи рук» та «слухати затамувавши подих».",
      "Зазначено, що кому не слід ставити, якщо дієприслівниковий зворот ужито як обставину способу дії серед однорідних членів речення, що є іншими частинами мови («діяти впевнено й ні на кого не зважаючи»).",
      "Регламентовано відсутність коми після займенника «який» у ситуації на зразок «Перед мандрівниками стояли гори, перейшовши які вони зможуть вийти до моря».",
      "Вказано на відсутність коми, якщо перед дієприслівниковим зворотом стоїть підсилювальна частка «і»/«й» («Вони бралися до роботи й не знаючи повністю її обсягу»).",
      "Додано, що обставини — сполучення іменників з прийменниками та прислівниками, які не є уточненням до попередніх обставин у реченні, можуть як виділятися, так і не виділятися комами («Погода(,) всупереч сподіванням(,) різко погіршилася»).",
      "Розглянуто випадок, коли комами виділяється іменник або іменникове словосполучення у конструкціях із називним відмінком теми («Діти, вони завжди були окрасою життя»), але прокоментовано, що кома не потрібна з підсилювальним зворотом «і той» («Навіть батько і той якось трохи злякався»).",
      "Додано пункт про кому перед приєднувальними (наприклад, «та й») або пояснювальними (наприклад «ба») сполучниками у складному реченні.",
      "Перелік випадків, у яких кома в складносурядному реченні не потрібна, доповнено такими: частини складного речення являють собою питальні, спонукальні, окличні речення, об’єднані інтонацією: «Хай буде мир і хай лунає сміх!»; частини складного речення є односкладними (номінативними чи безособовими): «Тиша і бур’яни», «Порожньо і сумно».",
      "Вказано на можливість вжитку крапки замість коми для надання підрядним частинам складнопідрядних речень більшої самостійності.",
      "Уточнено, що у випадку, коли перед кожною з однорідних підрядних частин складного речення стоїть повторюваний сполучник, перед першою з цих частин кому ставити не слід («Буря вщухала або коли затихав вітер, або коли він починав дути з іншого боку»).",
      "До переліку нерозкладних конструкцій, що не потребують коми, до «як слід», «як годиться» додано чимало інших: «дивлячись що», «не знати скільки», «хто як не він», «кричати що є духу», «говорити все що завгодно», «будь що буде», «іди куди хочеш», «не інакше як», «не те щоб» та подібні.",
      "Уточнено, що якщо в конструкціях з відносним займенником або прислівником у кінці речення до такого слова прилягає інше, то кома потрібна («Я б хотів знати хто», але «Я б хотів знати, хто саме»).",
      "Прокоментовано розташування коми відносно уточнювальних слів «а саме», «зокрема», «лише» і подібних у складнопідрядних реченнях."
    ],
    "major": [
      {
        "description": "У виразі «говорити правду, і тільки правду» та подібних потрібно ставити кому.",
        "examples": [
          [
            "compulsory",
            "Я казатиму правду і лише правду.",
            "Я казатиму правду, і лише правду."
          ],
          [
            "compulsory",
            "Він і тільки він мав усю владу.",
            "Він, і тільки він мав усю владу."
          ]
        ]
      }
    ]
  },
  {
    "new": 159,
    "title": "крапка з комою",
    "old": [
      "119"
    ],
    "minor": [
      "Додано примітку про те, що використання крапки з комою в багатьох випадках є факультативним і замість цього розділового знака можна використати кому."
    ],
    "major": null
  },
  {
    "new": 160,
    "title": "двокрапка",
    "old": [
      "120"
    ],
    "minor": [
      "Уточнено, що вживання двокрапки перед однорідними членами речення без узагальнювального слова («на засіданні присутні: …») притаманне для офіційно-ділового, наукового та публіцистичного стилів.",
      "Регламентовано використання двокрапки у складних реченнях із другою частиною, що уточнює зміст першої та містить підрядні сполучники або сполучні слова («Вирішили зробити таким чином: щоб щепленням проти грипу одночасно охопити школи всього району»)."
    ],
    "major": [
      {
        "description": "Зрідка частина речення перед двокрапкою може вказувати не на наслідок, а на причину того, про що йдеться у частині речення після двокрапки.",
        "examples": [
          [
            "optional",
            "Віхола розпочалася з самісінького ранку — вийти з хати просто неможливо.",
            "Віхола розпочалася з самісінького ранку: вийти з хати просто неможливо."
          ]
        ]
      }
    ]
  },
  {
    "new": 161,
    "title": "тире",
    "old": [
      "121"
    ],
    "minor": [
      "Уточнено, що в реченнях на кшталт «Мій батько інженер», де інтонаційно виділяється переважно присудок, тире можна не ставити.",
      "Сказано, що в реченнях із нульовою зв’язкою за відсутності спеціальної інтонації тире не ставиться: після займенника «це»; перед іменною частиною, якщо вона починається з другорядного члена речення; якщо присудок стоїть перед підметом.",
      "Додано, що перед присудком, який є іменником із часткою «не», в разі наголошення на запереченні, зокрема за наявності протиставлення «не ..., а ...», тире можливе.",
      "Вказано, що в реченнях на зразок «Життя не казка» тире можливе в разі спеціального наголошування.",
      "Зауважено, що в реченнях із нульовою зв’язкою, де підмет є особовим займенником, тире зазвичай не ставлять, але воно можливе за умови відповідного наголошування.",
      "Зауважено, що в реченнях із нульовою зв’язкою, але із вставним словом на її місці тире не ставлять.",
      "Додано, що в разі, якщо присудок речення з нульовою зв’язкою не є іменником або кількісним числівником (у називному відмінку), тире зазвичай не ставлять, але воно можливе за відповідного наголошування.",
      "Згадано про тире у заголовках типу «Книга — поштою», «Ми — за мир», де тире міститься на місці умовно випущеного члена речення.",
      "Додано, що тире на місці випущеного члена речення може й не стояти, якщо немає потреби в увиразненні паузи, зокрема у реченнях з обставинами місця або часу («Праворуч комора дерев’яна, рублена»).",
      "Відзначено можливість використання тире між узагальнювальним словом і однорідними членами речення замість частіше вживаної в цьому випадку двокрапки.",
      "Додано пункт про тире між однорідними членами речення, що протиставляються («Не для слави — для вас, мої браття, ...»).",
      "Прокоментовано вжиток тире у реченні «Сидять — пережидають дощ» як такому, де один присудок виражає причину або наслідок іншого.",
      "Додано загальний коментар, що у випадку виділення за допомогою тире — а не коми — другорядних членів речення вони зазвичай є поширеними або стоять у кінці речення; наведено приклади подібних речень, де тире відділяє означення, уточнення або пояснення, обставини.",
      "Відзначено функцію виділення тире повторюваних із певним доповненням слів («Хотілося жити — жити повнокровним життям»).",
      "Відзначено вжиток тире для виділення конструкцій із називним відмінком теми («А Дике поле, Дике поле! — по груди коням деревій»).",
      "Означено роль тире для підкреслення несподіваності перебігу подій.",
      "Додано пункт про вжиток тире в ролі, подібній до прийменника «між» («матч „Динамо“ — „Шахтар“», «система людина — машина»).",
      "Додано пункт про позначення за допомогою тире приблизної кількості («у квітні — на початку травня»).",
      "Зауважено, що в складному реченні тире, порівняно з комою, передає різкіше зіставлення змісту його частин.",
      "Відзначено можливість використання тире між частинами безсполучникового складного речення, коли друга частина розкриває зміст першої (замість частіше вживаної в цьому випадку двокрапки) або коли їхній зміст порівнюється («Подивилась ясно — заспівали скрипки»).",
      "Додано, що тире вживають у випадку, коли зміст другої частини складного речення підсумовує чи узагальнює зміст першої.",
      "Описано вжиток тире між частинами складнопідрядного речення, коли підрядна частина стоїть перед головною («Ой, хто в лузі, — озовися, ...»).",
      "Уточнено, що при переході інтонації в періоді тире може вживатися й без коми.",
      "Додано примітку про те, що тире в різних випадках може поєднуватися з комою.",
      "Вилучено примітку про те, що прикладка, виражена власним іменем, частіше відокремлюється комами, ніж тире (хоча додано пов’язаний пункт у § 158)."
    ],
    "major": [
      {
        "description": "У спеціальній літературі перед присудком, вираженим кількісним числівником (одиничним або в поєднанні з іменником), тире зазвичай не ставлять.",
        "examples": [
          [
            "optional",
            "Гарантійний термін — 2 роки.",
            "Гарантійний термін 2 роки."
          ]
        ]
      },
      {
        "description": "Якщо після прикладки, яку потрібно відокремити тире, стоїть кома, то тире слід ставити лише перед нею, а в тій позиції, де стоїть кома, тире потрібно пропускати.",
        "examples": [
          [
            "compulsory",
            "Автомобіль — наш дім на колесах, — довго набираючи швидкість, нарешті розігнався.",
            "Автомобіль — наш дім на колесах, довго набираючи швидкість, нарешті розігнався."
          ]
        ]
      },
      {
        "description": "Тире для позначення числових діапазонів, записаних цифрами, не вимагає навколо себе пробілів, зокрема й у випадку, коли йдеться про століття, записані римськими цифрами.",
        "examples": [
          [
            "compulsory",
            "XVI – XVIII ст.",
            "XVI–XVIII ст."
          ]
        ]
      }
    ]
  },
  {
    "new": 162,
    "title": "три крапки",
    "old": [
      "122"
    ],
    "minor": [
      "Прокоментовано вжиток трьох крапок для означення теми («Щастя… Хіба не думав про нього Степан?»).",
      "Додано пункт про вжиток трьох крапок на позначення несподіваного продовження чи завершення думки.",
      "Додано пункт про вжиток трьох крапок на позначення розриву в оповіді або різкого переходу до нової думки.",
      "Додано пункт про вжиток трьох крапок на позначення свідомої недомовленості, зокрема грубих слів."
    ],
    "major": null
  },
  {
    "new": 163,
    "title": "дужки",
    "old": [
      "123"
    ],
    "minor": [
      "Доповнено список випадків, у яких використовують круглі дужки: для уточнення попередніх слів, наведення другої назви чого-небудь, а також прикладів, варіантів, прізвища автора чи назви джерела.",
      "Уточнено, що на тих самих підставах, що ім’я автора, в дужки слід брати й назву джерела.",
      "Уточнено, як саме розставляються розділові знаки в кінці речення, коли в дужках є вказівка на автора.",
      "Додано пункт про застосування у текстах спеціального вжитку квадратних дужок для вставлення в текст цитати пояснення або відновлення скороченого в оригіналі слова.",
      "Додано пункти про використання квадратних та кутових дужок у текстах спеціального вжитку для позначення пропуску в цитаті."
    ],
    "major": [
      {
        "description": "Якщо в дужках подано одне або кілька повноцінних речень, крапка, що завершує останнє речення, має міститися всередині дужок, а не поза ними.",
        "examples": [
          [
            "compulsory",
            "Шануймося! (Оплески та рух у залі).",
            "Шануймося! (Оплески та рух у залі.)"
          ]
        ]
      }
    ]
  },
  {
    "new": 164,
    "title": "лапки",
    "old": [
      "124"
    ],
    "minor": [
      "Уточнено, що крапку не ставлять перед закритими лапками.",
      "Описано вжиток зовнішніх лапок-ялинок та внутрішніх лапок-ла́пок.",
      "Додано пункт, що каже про можливість подачі в лапках значень інших слів у реченні («слово голова має значення „розум“, „керівник“ та ін.»).",
      "Вилучено примітку про випадки, в яких лапки не використовуються, проте більшість цих випадків неявно розглянуто в інших параграфах; винятками є назви сортів рослин у неспеціальній літературі (див. § 59) та назви книжок у бібліографічних списках, виносках та рецензіях, наведені після прізвища автора (таке новий правопис не згадує)."
    ],
    "major": [
      {
        "description": "Якщо фрагмент у лапках закінчує речення, після лапок потрібно поставити крапку навіть у тому випадку, якщо в кінці фрагмента стоїть знак питання, знак оклику чи три крапки, і навіть якщо цитата є самостійною та стоїть після двокрапки.",
        "examples": [
          [
            "compulsory",
            "Бідний багатому: «Здоров будь!» Багатий бідному: «Будь здоров!»",
            "Бідний багатому: «Здоров будь!». Багатий бідному: «Будь здоров!»."
          ]
        ]
      }
    ]
  },
  {
    "new": 165,
    "title": "скісна риска",
    "old": null,
    "minor": [
      "Описано вжиток скісної риски: у значенні, близькому до «і»/«або»; на позначення року, що не збігається з календарним («2018/2019»); на позначення відношення величин; у графічних скороченнях.",
      "Прокоментовано взаємозамінність риски й дефіса для таких словосполучень, як «купівля-продаж»."
    ],
    "major": [
      {
        "description": "Крім випадку розділення коротких слів або скорочень чи позначення років, навколо скісної риски потрібно ставити пробіли.",
        "examples": [
          [
            "compulsory",
            "інтонація оклику/питання",
            "інтонація оклику / питання"
          ],
          [
            "compulsory",
            "курс гривня/долар",
            "курс гривня / долар"
          ]
        ]
      }
    ]
  },
  {
    "new": 166,
    "title": "комбіновані розділові знаки",
    "old": null,
    "minor": [
      "Перераховано випадки комбінування розділових знаків: «?!», «!?», «…?» (очевидно, помилково), «…!» (очевидно, помилково), «?..», «!..», «, —» (у реченнях із прямою мовою; у реченнях із тире у місці, де кома має закривати попередню конструкцію; для увиразнення протиставлення перед вказівними словами «це», «так», «такий» і под.),  у реченнях із дужками та з прямою мовою."
    ],
    "major": null
  },
  {
    "new": 167,
    "title": "пряма мова й цитати",
    "old": [
      "125"
    ],
    "minor": [
      "Уточнено, що перед авторськими словами, що починаються на «так», «ось як» і под., замість коми з тире слід ставити лише тире: «„Треба завжди бути чесними“ — так казала дітям мати».",
      "Уточнено, що у випадку, коли пряма мова стоїть усередині слів автора, перед нею ставлять двокрапку, а після неї залежно від контексту кому чи тире.",
      "Прибрано (не цілком послідовну) примітку щодо того, коли в кінці прямої мови зберігаються внутрішні лапки.",
      "Розглянуто випадок, коли в діалозі, що подається в рядок, після репліки одного з учасників ідуть слова автора: тоді перед наступною реплікою іншого учасника тире не ставлять.",
      "Додано примітку, що засвідчує відсутність лапок у реченнях типу «Кажуть, у німців чудові машинки» та «Учора, повідомляє наш кореспондент, відбулася зустріч лідерів країн Євросоюзу».",
      "Вказано, що цитати — крім самостійних (наприклад, у епіграфах) — слід брати в лапки.",
      "Зазначено, що пропуск у цитаті позначається трьома крапками.",
      "Цитату з пропуском на початку можна писати або з великої, або з малої літери залежно від її позиції відносно авторських слів.",
      "Цитата, що є складовою речення (тобто не відділена двокрапкою), вводиться з малої літери та без зазначення пропуску на початку, навіть якщо такий є.",
      "Вказано, що примітки до цитат подають у круглих або — в текстах спеціального призначення — квадратних дужках, а курсивом у таких випадках у дужках подають автора примітки.",
      "Зазначено, що прізвище автора чи джерело цитування подається в круглих дужках після цитати, нижче від цитати без дужок або, якщо саму цитату подано в дужках, у тих самих дужках після крапки й тире."
    ],
    "major": null
  },
  {
    "new": 168,
    "title": "правила рубрикації тексту",
    "old": null,
    "minor": [
      "Уточнено, що переліки подають з абзаців або рідше в рядок.",
      "Зі сказаного в параграфі та прикладів випливає, що для нумерації пунктів переліку великі літери та римські цифри слід використовувати разом із крапкою після них та в кінці пунктів, а кожен пункт починати з великої літери; малі літери — з дужкою після них та крапкою з комою в кінці пунктів, кожен пункт починати з малої літери (так само і коли замість літери з дужкою ставлять тире); арабські цифри можна використовувати і так, і так, але в багаторівневому списку з номерами на кшталт «1.3.2.» — лише з крапками.",
      "Подано варіант багатоступеневої нумерації: на верхньому рівні римські цифри або великі літери, далі арабські цифри з крапкою, потім арабські цифри з дужкою, а на найнижчому рівні — малі літери.",
      "Зазначено, що у переліку в рядок двокрапка не обов’язкова, а крапки з комами можна замінити на коми."
    ],
    "major": null
  }
]