import {correctionTypes, registerWordRule, createMaskRule} from "../imports.js";

const mythPrefixes = ["", "*-", "авто", "анти", "де", "етно", "з", "за", "кіно", "напів", "не", "нео", "поза", "ре"];

registerWordRule(createMaskRule({
  callback: (token) => token.match(/ф/i), // Potential optimization
  rules: [{
    matches: [
      "ага(ф)*", "аґа(ф)*", "а(ф)анас*", "а(ф)он*", "ахалі-а(ф)он*",
      "*борис(ф)ен*", "*вар(ф)оломі*", "*ви(ф)леєм*", "га(ф)ій*", "га(ф)ія",
      "*голго(ф)*", "*демос(ф)ен*", "доро(ф)*", "*е(ф)іоп*", "*євста(ф)*",
      "єлев(ф)ер*", "єро(ф)*", "закін(ф)*", "*корин(ф)*", "*мара(ф)он*",
      "мар(ф)*", "*ме(ф)оді*", "*пар(ф)ен*", "*пі(ф)агор*", "*пі(ф)аґор*",
      "само(ф)ракі*", "(ф)аде*", "(ф)аді*", "*(ф)едір*", "*(ф)едор*",
      "(ф)едос*", "*(ф)едот*", "*(ф)едьк*", "*(ф)едюшк*", "(ф)екл*", "(ф)емід*",
      "*(ф)емістокл*", "(ф)еоген*", "(ф)еоґен*", "(ф)еодор*", "*(ф)еодос*",
      "(ф)еодот*", "(ф)еодул*", "(ф)еоктист*", "(ф)еон*", "(ф)еопемпт*",
      "*(ф)еофан*", "(ф)еофіл*", "(ф)ерапонт*", "(ф)ермопіл*", "(ф)ессалі*",
      "(ф)ом*", "(ф)ракі*", "хрисан(ф)*",

      "акан(ф)*", "анаколу(ф)*", "ана(ф)ем*", "апо(ф)ем*", "*апо(ф)еоз*",
      "*ари(ф)м*", "кан(ф)ар*", "*ка(ф)едр*", "ка(ф)изм*", "*ка(ф)оли*",
      "кі(ф)ар*", "лого(ф)ет*", "ор(ф)о*", "*па(ф)ос*"
    ],
    antiMatches: ["афоні+", "фомоз*"],
    replacement: "т",
  }, {
    matches: [
      ["а(ф)оні", ["в*", "єв*", "єм", "їв*", "й*"]]
    ],
    replacement: "т"
  }, {
    matches: [
      [mythPrefixes, "мі(ф)*"]
    ],
    antiMatches: ["*міфіч*"],
    replacement: "т"
  }, {
    matches: [
      [mythPrefixes, "мі(фі)ч*"]
    ],
    replacement: "ти"
  }, {
    matches: [
      "ан(фі)с*", "ві(фі)н*", "оле(фі)р*",

      "ака(фі)ст*", "ди(фі)рамб*", "ка(фі)зм*", "(фі)міам*"
    ],
    replacement: "ти"
  }, {
    matches: [
      "*а(фі)н*", "*тимо(фі)*",

      "*е(фі)р*"
    ],
    antiMatches: [
      "*афінаж*", "*афінаці*", "афіні+", "*афінн*", "*афінор*",
      "гефір*", "зефір*", "кефір*", "олефір*",
      "*парафін*"
    ],
    replacement: "те"
  }, {
    matches: ["п(іф)і*", "*ск(іф)*"],
    antiMatches: ["піфіч*", "*скіф'*"],
    replacement: "ит"
  }, {
    matches: ["*ск(іф')*"],
    replacement: "иті"
  }, {
    matches: ["п(іфі)ч*"],
    replacement: "ити"
  }],
  type: correctionTypes.IMPROVEMENT,
  description: 'Відповідно до § 123 правопису, у словах грецького походження, де літеру «θ» (тета) узвичаєно як «ф», '
    + 'можливе варіантне написання через «т».'
}));