import {correctionTypes, registerWordRule, createMaskRule} from "../imports.js";

registerWordRule(createMaskRule({
  callback: (token) => token.match(/ау/i), // Potential optimization
  rules: [{
    matches: [
      [["ін"], "а(у)гураці*"],
      ["*а(у)д", ["ир*", "ит*", "ифон*", "іа*", "іє*", "іо*", "ію*"]],
      ["*а(у)кс", ["ано*", "ин*", "о*"]],
      "*а(у)кці*",
      ["а(у)р", ["", "а", "ам", "ами", "ах", "и", "і", "о", "ою", "у"]], // aura
      ["а(у)р", ["и+", "ум*"]], // gold
      [["", "бін"], "а(у)р", ["альн*"]], // ear
      ["а(у)сп", ["иц*", "іц*"]],
      "а(у)стері*",
      ["*а(у)т", ["екологі*", "енти*"]],
      "*гла(у)ко*",
      "*ка(у)дальн*",
      "*ка(у)декс*",
      "*ка(у)за*",
      [["", "+о"], "ка(у)л+"],
      ["*ка(у)ст", ["и*", "о*"]],
      "*ка(у)тер*",
      "*кера(у)но*",
      "*кла(у)з*",
      "*кла(у)стро*",
      ["*ла(у)р", ["еат*", "еач*", "ил*"]],
      "*на(у)пліус*",
      "*па(у)пер*",
      "та(у)матин*",
      "та(у)рин*",
      "*та(у)то*",
      "*теза(у)рус*"
    ],
  }, {
    matches: [
      ["*а(у)ти", ["за*", "зм*", "ст*", "чн*"]]
    ],
    antiMatches: [
      "*скаути+"
    ]
  }, {
    matches: [
      "а(у)то*"
    ],
    antiMatches: [
      ["ауто", ["ві", "дафе", "м"]]
    ]
  }, {
    matches: [
      ["*па(у)", ["ж+", "з*"]]
    ],
    antiMatches: [
      ["пауз", ["ок", "к*"]] // A type of a boat
    ]
  }, {
    matches: [
      "*фа(у)н*"
    ],
    antiMatches: [
      "*фаунд*" // "Ньюфаундленд" and the like
    ]
  }],
  replacement: "в",
  type: correctionTypes.IMPROVEMENT,
  description: 'Відповідно до § 131 правопису, запозичення з давньогрецької і, як випливає з поданих прикладів, '
    + 'латинської мови, що містять буквосполучення «ау», можна альтернативно записувати через «ав».'
}));