export const doublyDeclined = [{
  before: "член",
  beforeSuffix: "",
  after: "кореспондент",
  paradigm: {
    "а": "а",
    "ам": "ам",
    "ами": "ами",
    "ах": "ах",
    "е": "е",
    "и": "и",
    "і": "ові",
    "ів": "ів",
    "ові": ["у", "і"],
    "ом": "ом",
    "у": "ові"
  }
}, {
  before: "брат",
  beforeSuffix: "",
  after: "і-сест",
  paradigm: {
    "ер": "ів",
    "рам": "ам",
    "рами": "ами",
    "рах": "ах",
    "ри": ["а", "и"],
    "рі": ["у", "ові", "і"],
    "ро": "е",
    "рою": "ом",
    "ру": "а"
  }
}];