export const greekLetters = [{
  paradigm: ["", "а", "ам", "ами", "ах", "и", "і", "о", "ою", "у"],
  roots: ["альф", "бет", "гамм", "дельт", "дзет", "ет", "тет", "йот", "капп", "лямбд", "сигм"]
}, {
  paradigm: ["г", "га", "гам", "гами", "гах", "ги", "го", "гою", "гу", "зі"],
  roots: ["оме"]
}, {
  paradigm: ["", "а", "ам", "ами", "ах", "е", "и", "і", "ів", "ові", "ом", "у"],
  roots: ["епсилон", "омікрон", "іпсилон"]
}, {
  paradigm: [""],
  roots: ["мю", "ню", "ксі", "пі", "ро", "тау", "фі", "хі", "псі"]
}];