// This file lists Bulgarian, Macedonian, Slovene, Montenegrin, Bosnian, Croatian, and Serbian first names with "i" (or
// Cyrillic "и") that follows a consonant. Moreover, only names where "і" is also followed by a consonant (other than
// "й") are listed, as it is dubious whether the rule "і" -> "и" should actually be applied to other names.

export const southSlavicNamesWithI = [{
  // Feminine (in form), "ца"/"ця" ambiguity
  paradigm: ["", "а", "ам", "ами", "ах", "е", "ею", "и", "і", "о", "ою", "у", "ь", "ю", "я", "ям", "ями", "ях"],
  roots: [
    "Аніц",
    "Бранкіц",
    "Даніц",
    "Деніц",
    "Драгіц", "Драґіц",
    "Еліц",
    "Зоріц",
    "Івіц",
    "Йовіц",
    "Катіц",
    "Любіц",
    "Миліц", "Мілиц", "Міліц",
    "Никіц", "Нікиц", "Нікіц",
    "Періц",
    "Раліц",
    "Росіц",
    "Ружіц",
    "Яніц"
  ]
}, {
  // Feminine (in form), ending in "а" (but not "га", "ґа", "ка", "ца"/"ця", or hushing + "а")
  paradigm: ["", "а", "ам", "ами", "ах", "и", "і", "о", "ою", "у"],
  roots: [
    "Білян",
    "Елісавет", "Єлісавет",
    "Лільян", "Лілян",
    "Мілет",
    // The name Мірна would give false positives
    "Николін", "Ніколин", "Ніколін",
    "Радін",
    "Хрістін"
  ]
}, {
  // Feminine (in form), ending in "я" (but not "ця")
  paradigm: ["е", "ею", "і", "ь", "ю", "я", "ям", "ями", "ях"],
  roots: [
    "Драгін", "Драґін",
    "Страхін"
  ]
}, {
  // Feminine (in form), ending in a hushing consonant + "а"
  paradigm: ["", "а", "ам", "ами", "ах", "е", "ею", "і", "у"],
  roots: [
    "Драгіш", "Драґіш",
    "Любіш",
    "Нікш",
    "Радіш",
    "Синіш", "Сіниш", "Сініш",
    "Славіш",
    "Станіш"
  ]
}, {
  // Feminine (in form), ending in "га" or "ґа"
  paradigm: ["г", "га", "гам", "гами", "гах", "ги", "го", "гою", "гу", "зі",
             "ґ", "ґа", "ґам", "ґами", "ґах", "ґи", "ґо", "ґою", "ґу"],
  roots: [
    "Жі"
  ]
}, {
  // Feminine (in form), ending in "ка"
  paradigm: ["ка", "кам", "ками", "ках", "ки", "ко", "кою", "ку", "ок", "ці"],
  roots: [
    "Васіл",
    "Гін", "Ґін"
  ]
}, {
  // Feminine + masculine (either with null ending or ending in "о", but not "ко")
  paradigm: ["", "а", "ам", "ами", "ах", "е", "и", "і", "ів", "о", "ові", "ом", "ою", "у"],
  roots: [
    "Беріслав",
    "Бісер",
    "Богоміл", "Боґоміл",
    "Божідар",
    "Боріслав",
    "Бранимір", "Бранімир", "Бранімір",
    "Браніслав",
    "Братіслав",
    "Васіл",
    "Велимір", "Велімир", "Велімір",
    "Веселін",
    "Витомір", "Вітомир", "Вітомір",
    // The names Від and Вінка would be too susceptible to false positives to use (see also "Вінко" below)
    "Вішеслав",
    "Владимір", "Владімир", "Владімір",
    "Владіслав",
    "Даворін",
    "Дарін",
    "Десіслав",
    "Добромір",
    "Драгомір", "Драґомір",
    "Едін",
    "Жіван",
    "Звонимір", "Звонімир", "Звонімір",
    "Івелін",
    "Йосіп",
    "Йосіф", // Doesn't really have a feminine form, but it's better if it's close to "Йосіп"
    "Калін",
    "Костадін",
    "Красимір", "Красімир", "Красімір",
    "Любомір",
    "Людміл",
    "Миомір", "Міомір",
    "Мілан",
    "Мілен",
    "Мілосав",
    "Мілян",
    "Мір'ян",
    "Мірослав",
    "Нікол",
    "Радміл",
    "Радомір",
    "Радостін",
    "Растіслав",
    "Ростіслав",
    "Станимір", "Станімир", "Станімір",
    "Филіп", "Філип", "Філіп",
    "Цветелін",
    "Ясмін"
  ]
}, {
  // Feminine + masculine ending in "ко"
  paradigm: ["ка", "кам", "ками", "ках", "ки", "ків", "ко", "кові", "ком", "кою", "ку", "ок", "ці"],
  roots: [
    "Веліч",
    "Жів",
    "Зрін",
    "Міл",
    "Міль",
    "Мір"
  ]
}, {
  // Masculine (not ending in a hushing consonant, "й", "к", or "о")
  paradigm: ["", "а", "ам", "ами", "ах", "е", "и", "і", "ів", "ові", "ом", "у"],
  roots: [
    "Адмір",
    "Алдін",
    "Асмір",
    "Ачім",
    "Богомір", "Боґомір",
    "Боримір", "Борімир", "Борімір",
    "Боріс",
    "Будимір", "Будімир", "Будімір",
    "Вадім",
    "Велібор",
    "Велізар",
    "Венціслав",
    "Вилім", "Вілим", "Вілім",
    "Властимір", "Властімир", "Властімір",
    "Вукашін",
    "Вукмір",
    "Вуядін",
    "Грігор", "Ґріґор",
    "Дабижів", "Дабіжив", "Дабіжів",
    "Далібор",
    "Дамір",
    "Демір",
    "Десимір", "Десімир", "Десімір",
    "Димітар", "Дімитар", "Дімітар",
    "Дмітрій", "Дмітрий",
    "Драгутін", "Драґутін",
    "Елмір",
    "Єздимір", "Єздімир", "Єздімір",
    "Єролім",
    "Єронім",
    "Желимір", "Желімир", "Желімір",
    "Жівоїн",
    "Жіворад",
    "Клімент",
    "Крешимір", "Крешімир", "Крешімір",
    "Крістиян", "Крістіян",
    "Любісав",
    "Людевіт",
    "Миладін", "Міладин", "Міладін",
    "Миломір", "Міломир", "Міломір",
    "Миховіл", "Міховил", "Міховіл",
    "Мілорад",
    "Мілован",
    "Милутін", "Мілутин", "Мілутін",
    "Міралем",
    "Мірсад",
    "Мітар",
    "Момір",
    "Предіслав",
    "Прибіслав", "Прібислав", "Прібіслав",
    "Ратимір", "Ратімир", "Ратімір",
    "Светіслав",
    "Свілен",
    "Славомір",
    "Страцимір", "Страцімир", "Страцімір",
    "Тихомір", "Тіхомир", "Тіхомір",
    "Тілен",
    "Томіслав",
    "Трендафіл",
    "Тріфун",
    "Хайрудін",
    "Хвалимір", "Хвалімир", "Хвалімір",
    "Хрістиян", "Хрістіян",
    "Хрістофор",
    "Чедомір",
    "Шімун"
  ]
}, {
  // Masculine, ending in a hushing consonant
  paradigm: ["", "а", "ам", "ами", "ах", "е", "еві", "ем", "і", "ів", "у"],
  roots: [
    "Миліч", "Мілич", "Міліч",
    "Мілош",
    "Прімож",
    "Радіч"
  ]
}, {
  // Masculine, ending in "к"
  paradigm: ["", "а", "ам", "ами", "ах", "и", "ів", "ові", "ом", "у"],
  roots: [
    "Відак",
    "Калинік", "Каліник", "Калінік"
  ]
}, {
  // Masculine, ending in "й"
  paradigm: ["єві", "єм", "ї", "їв", "й", "ю", "я", "ям", "ями", "ях"],
  roots: [
    "Миліво", "Міливо", "Міліво"
  ]
}, {
  // Masculine, either with null ending or ending in "о"
  paradigm: ["", "а", "ам", "ами", "ах", "е", "и", "і", "ів", "о", "ові", "ом", "у"],
  roots: [
    "Киріл", "Кірил", "Кіріл",
    "Момчіл"
  ]
}, {
  // Masculine, ending in "о" (but not "ко")
  paradigm: ["а", "ам", "ами", "ах", "е", "и", "і", "ів", "о", "ові", "ом", "у"],
  roots: [
    "Гавріл", "Ґавріл",
    "Міхаїл", "Міхайл",
    // The name Ріст would produce false positives
    "Хріст"
  ]
}, {
  // Masculine, ending in "ко"
  paradigm: ["а", "ам", "ами", "ах", "и", "ів", "о", "ові", "ом", "у"],
  roots: [
    "Дінк",
    "Марінк",
    "Міленк",
    "Хінк"
  ]
}, {
  // Indeclinable
  paradigm: [""],
  roots: [
    "Відоє",
    "Вікентиє", "Вікентіє",
    "Глігориє", "Глігоріє", "Ґліґориє", "Ґліґоріє",
    "Грігориє", "Грігоріє", "Ґріґориє", "Ґріґоріє",
    "Димітриє", "Димітріє", "Дімитриє", "Дімитріє", "Дімітриє", "Дімітріє",
    "Дімо", // Beware of "Діма"
    "Добрівоє",
    "Борівоє",
    "Васілиє", "Васіліє",
    "Вінко", // Beware of "вінок"
    "Йоанікиє", "Йоанікіє",
    "Милівоє", "Міливоє", "Мілівоє",
    "Мілоє",
    "Мішко", // Beware of "мішки"
    "Радівоє",
    "Сімо",
    "Стіпе",
    "Філотиє", "Філотіє",
    "Чіро",
    "Шіме"
  ]
}];