import {correctionTypes, TokenChain} from "../spelling/types.js";
import {tokenize, isWhitespace} from "../spelling/tokenizer.js";
import {processToken} from "../spelling/processor.js";
import "../rules/rules.js";

const _ = [];

const tests = [
  [2, 'Іч який!', 'Ич який!', correctionTypes.IMPROVEMENT],
  [2, 'А я: «іч, як поважно розкинувся».', 'А я: «ич, як поважно розкинувся».', correctionTypes.IMPROVEMENT],
  [2, 'Птахи відлітають в ірій.', 'Птахи відлітають в ирій.', correctionTypes.IMPROVEMENT],
  [2, 'НЕМАЄ ІРІЮ ПОБЛИЗУ', 'НЕМАЄ ИРІЮ ПОБЛИЗУ', correctionTypes.IMPROVEMENT],
  [2, 'Кожному іроду — по хустинці.', 'Кожному ироду — по хустинці.', correctionTypes.IMPROVEMENT],
  [2, 'Ірод нового часу', 'Ирод нового часу', correctionTypes.IMPROVEMENT],
  [2, 'Різноманітні іродівські штучки вже набридли.', 'Різноманітні иродівські штучки вже набридли.', correctionTypes.IMPROVEMENT],
  [2, 'У Північній Кореї править Кім Чен Ін.', 'У Північній Кореї править Кім Чен Ин.', correctionTypes.MISTAKE],
  [2, 'ОСТАННІЙ ЗАДУМ КІМ ЧЕН ІНА', 'ОСТАННІЙ ЗАДУМ КІМ ЧЕН ИНА', correctionTypes.MISTAKE],
  [_, 'Ін і ян', 'Ін і ян', _],
  [_, 'Це сказав Чен. Інакше тут не вийде.', 'Це сказав Чен. Інакше тут не вийде.', _],
  [_, 'Чен іншого порадити не міг.', 'Чен іншого порадити не міг.', _],

  [6, 'Заїхав якось у горганське село.', 'Заїхав якось у ґорґанське село.', correctionTypes.MISTAKE],
  [6, 'Немає Горган — нема і Карпат', 'Немає Ґорґан — нема і Карпат', correctionTypes.MISTAKE],
  [6, 'У Горонді багато городів!', 'У Ґоронді багато городів!', correctionTypes.MISTAKE],
  [6, 'Без горонд нема і горондівців.', 'Без ґоронд нема і ґорондівців.', [correctionTypes.MISTAKE, correctionTypes.MISTAKE]],
  [6, 'Населений пункт Угля розташований у Карпатах.', 'Населений пункт Уґля розташований у Карпатах.', correctionTypes.MISTAKE],
  [6, 'Чи є щастя в Углі?', 'Чи є щастя в Уґлі?', correctionTypes.MISTAKE],
  [6, 'УГЛЯ — на порятунок!', 'УҐЛЯ — на порятунок!', correctionTypes.MISTAKE],
  [_, 'Він і каже суржиком: що більше угля, то краще.', 'Він і каже суржиком: що більше угля, то краще.', _],
  [6, 'Галятовський він такий.', 'Ґалятовський він такий.', correctionTypes.MISTAKE],
  [6, 'Я читаю Геникову книжку.', 'Я читаю Ґеникову книжку.', correctionTypes.MISTAKE],
  [6, 'Геник', 'Ґеник', correctionTypes.MISTAKE],
  [6, 'ГЕНИКИ-БЕНИКИ ЇЛИ ВАРЕНИКИ', 'ҐЕНИКИ-БЕНИКИ ЇЛИ ВАРЕНИКИ', correctionTypes.MISTAKE],
  [6, 'Герзанич — геній', 'Ґерзанич — геній', correctionTypes.MISTAKE],
  [6, 'Лови Герзанича!', 'Лови Ґерзанича!', correctionTypes.MISTAKE],
  [6, 'Це — Гердан.', 'Це — Ґердан.', correctionTypes.MISTAKE],
  [_, 'Це — гердан.', 'Це — гердан.', _],
  [6, 'Це — гердан Гердана.', 'Це — гердан Ґердана.', correctionTypes.MISTAKE],
  [6, 'Гжицький', 'Ґжицький', correctionTypes.MISTAKE],
  [6, 'Гига Семен', 'Ґиґа Семен', correctionTypes.MISTAKE],
  [6, 'Сімейство Гиг', 'Сімейство Ґиґ', correctionTypes.MISTAKE],
  [6, 'Усе було зроблено за допомогою пана Гоги.', 'Усе було зроблено за допомогою пана Ґоґи.', correctionTypes.UNSURE],
  [6, 'Віддай це Гозі.', 'Віддай це Ґозі.', correctionTypes.UNSURE],
  [6, 'Д. Гойдичу', 'Д. Ґойдичу', correctionTypes.MISTAKE],
  [6, 'Гойдич і компанія', 'Ґойдич і компанія', correctionTypes.MISTAKE],
  [6, 'Скільки Гонт, стільки й думок.', 'Скільки Ґонт, стільки й думок.', correctionTypes.MISTAKE],
  [6, 'Гонта є лише один.', 'Ґонта є лише один.', correctionTypes.MISTAKE],
  [6, 'Не Григами єдиними!', 'Не Ґриґами єдиними!', correctionTypes.MISTAKE],
  [6, 'Один Гула, два Гули, багато Гул', 'Один Ґула, два Ґули, багато Ґул', [correctionTypes.UNSURE, correctionTypes.UNSURE, correctionTypes.UNSURE]],
  [6, 'Ломака захоче — Ломага знайдеться.', 'Ломака захоче — Ломаґа знайдеться.', correctionTypes.MISTAKE],

  [23, 'Знайди лоб у окуня.', 'Знайди лоб в окуня.', correctionTypes.MISTAKE],
  [23, 'Страшенний біль у очах.', 'Страшенний біль в очах.', correctionTypes.MISTAKE],
  [23, 'Рот у авторки великий.', 'Рот в авторки великий.', correctionTypes.MISTAKE],
  [23, 'ікс у ігрек', 'ікс в ігрек', correctionTypes.MISTAKE],
  [_, 'Поклав ніж у юрту.', 'Поклав ніж у юрту.', _],
  [23, 'Найкращий курс — у НБУ', 'Найкращий курс — в НБУ', correctionTypes.MISTAKE],
  [23, 'У АВС немає претензій.', 'В АВС немає претензій.', correctionTypes.MISTAKE],
  [23, 'Ура! У АВС немає претензій.', 'Ура! В АВС немає претензій.', correctionTypes.MISTAKE],
  [23, 'Гроші вклав у МОТ.', 'Гроші вклав в МОТ.', correctionTypes.MISTAKE],
  [_, 'Гроші вклав у Мот.', 'Гроші вклав у Мот.', _],
  [_, 'Гроші вклав у КОТ.', 'Гроші вклав у КОТ.', _],
  [_, 'у', 'у', _],

  [24, 'Чай й молоко', 'Чай та молоко', correctionTypes.MISTAKE],
  [24, 'Я Й ТИ', 'Я ТА ТИ', correctionTypes.MISTAKE],
  [24, 'Не знаю й', 'Не знаю та', correctionTypes.MISTAKE],
  [24, 'Знає й тікає', 'Знає та тікає', correctionTypes.MISTAKE],
  [24, 'Її й його', 'Її та його', correctionTypes.MISTAKE],
  [_, 'І її, й його', 'І її, й його', _],
  [_, 'й що?', 'й що?', _],
  [_, 'так. й що?', 'так. й що?', _],
  [_, 'Ну й от!', 'Ну й от!', _],

  [25, 'З заводу приніс чоботи.', 'Із заводу приніс чоботи.', correctionTypes.MISTAKE],
  [25, 'Звідки питимеш? З цистерни.', 'Звідки питимеш? Із цистерни.', correctionTypes.MISTAKE],
  [25, 'Довго вибирала з двох кольорів. З чорного і білого.', 'Довго вибирала з двох кольорів. Із чорного і білого.', correctionTypes.MISTAKE],
  [25, 'Гарно списав! З щоденника', 'Гарно списав! Із щоденника', correctionTypes.MISTAKE],
  [_, 'Гарно списав з щоденника', 'Гарно списав з щоденника', _],
  [_, 'Гарно списав З ЧИСТОВИКА', 'Гарно списав З ЧИСТОВИКА', _],
  [_, 'З лівої шкарпетки.', 'З лівої шкарпетки.', _],
  [25, 'Виліз із обруча.', 'Виліз з обруча.', correctionTypes.MISTAKE],
  [25, 'цей ваш із Авдіївки', 'цей ваш з Авдіївки', correctionTypes.MISTAKE],
  [25, 'І палац із усіх найкращих будівельних матеріалів...', 'І палац з усіх найкращих будівельних матеріалів...', correctionTypes.MISTAKE],
  [25, 'Палець із однієї з рук', 'Палець з однієї з рук', correctionTypes.MISTAKE],
  [_, 'крик із остраху', 'крик із остраху', _],
  [_, 'НІЖ ІЗ ЗАЛІЗА', 'НІЖ ІЗ ЗАЛІЗА', _],
  [_, 'Корж із оновленого тіста?', 'Корж із оновленого тіста?', _],
  [_, 'мопс із орбіти', 'мопс із орбіти', _],

  [29, 'Побачив священик священика — і освятився.', 'Побачив священник священника — і освятився.', [correctionTypes.MISTAKE, correctionTypes.MISTAKE]],
  [29, 'Священиків ліхтар найяскравіший.', 'Священників ліхтар найяскравіший.', correctionTypes.MISTAKE],
  [29, 'СВЯЩЕНИЦЬКИЙ ДОСВІД', 'СВЯЩЕННИЦЬКИЙ ДОСВІД', correctionTypes.MISTAKE],
  [_, 'Побачив священний текст у книзі.', 'Побачив священний текст у книзі.', _],

  [31, 'Побачив архієрея за дверима.', 'Побачив архиєрея за дверима.', correctionTypes.IMPROVEMENT],
  [31, 'Архідиякон кращий за просто дияконесу.', 'Архидиякон кращий за просто дияконесу.', correctionTypes.IMPROVEMENT],
  [31, 'АРХІМАНДРИТСТВО', 'АРХИМАНДРИТСТВО', correctionTypes.IMPROVEMENT],
  [31, 'Чудовий архістратизький задум', 'Чудовий архистратизький задум', correctionTypes.IMPROVEMENT],
  [31, 'Архієпархи проти архієпископів', 'Архиєпархи проти архиєпископів', [correctionTypes.IMPROVEMENT, correctionTypes.IMPROVEMENT]],
  [_, 'Треба побувати на тому архіпелазі.', 'Треба побувати на тому архіпелазі.', _],
  [_, 'Архів', 'Архів', _],

  [32, 'Не бачив таких марев з дитинства.', 'Не бачив таких марив з дитинства.', correctionTypes.MISTAKE],
  [32, 'МАРЕВО', 'МАРИВО', correctionTypes.MISTAKE],
  [32, 'І в маревному сні не насниться!', 'І в маривному сні не насниться!', correctionTypes.MISTAKE],

  [32, 'Багато упорядників!', 'Багато упорядниць!', correctionTypes.UNSURE, true], /* банник-банниця */
  [32, 'Що це значить — бути кур’єром?', 'Що це значить — бути кур’єркою?', correctionTypes.UNSURE, true], /* ант-антка */
  [32, 'Що це значить — бути ексчемпіоном?', 'Що це значить — бути ексчемпіонкою?', correctionTypes.UNSURE, true], /* ант-антка */
  [32, 'НОВОЗЕЛАНДЦІ', 'НОВОЗЕЛАНДКИ', correctionTypes.UNSURE, true], /* бранець-бранка */
  [32, 'У розповідача багато розповідей', 'У розповідачки багато розповідей', correctionTypes.UNSURE, true], /* читач-читачка */
  [32, 'Городяни в селі', 'Городянки в селі', correctionTypes.UNSURE, true], /* киянин-киянка */
  [32, 'сердюком не народжуються', 'сердючкою не народжуються', correctionTypes.UNSURE, true], /* вояк-воячка */
  [32, 'Примирителем по примирителю', 'Примирителькою по примирительці', [correctionTypes.UNSURE, correctionTypes.UNSURE], true], /* житель-жителька */
  [32, 'Нема воротарів', 'Нема воротарок', correctionTypes.UNSURE, true], /* бідар-бідарка */
  [32, 'сотниками', 'сотничками', correctionTypes.UNSURE, true], /* кумик-кумичка */
  [32, 'Усе ласіям', 'Усе ласійкам', correctionTypes.UNSURE, true], /* буржуй-буржуйка */
  [32, 'Зі здирщиками не розмовлятиму.', 'Зі здирщицями не розмовлятиму.', correctionTypes.UNSURE, true], /* банщик-банщиця */
  [32, 'без щасливця...', 'без щасливиці...', correctionTypes.UNSURE, true], /* обранець-обраниця */
  [32, 'Арф\'яру — арфу.', 'Арф’ярці — арфу.', correctionTypes.UNSURE, true], /* дояр-доярка */
  [32, 'Сейшели сейшельцям', 'Сейшели сейшелкам', correctionTypes.UNSURE, true], /* агулець-агулка */
  [32, 'латишеві Латвію', 'латишці Латвію', correctionTypes.UNSURE, true], /* діяч-діячка */
  [32, 'Море шалапутників', 'Море шалапуток', correctionTypes.UNSURE, true], /* шалапутник-шалапутка */
  [32, 'ТУТ Є ВМІЛЕЦЬ', 'ТУТ Є ВМІЛИЦЯ', correctionTypes.UNSURE, true], /* умілець-умілиця */
  [32, 'по бісах', 'по бісицях', correctionTypes.UNSURE, true], /* біс-бісиця */
  [32, 'На автомандрівниках велика відповідальність.', 'На автомандрівницях велика відповідальність.', correctionTypes.UNSURE, true], /* витівник-витівниця */
  [32, 'Не герцогами єдиними.', 'Не герцогинями єдиними.', correctionTypes.UNSURE, true], /* герцог-герцогиня */
  [32, 'Це патронів?!', 'Це патронес?!', correctionTypes.UNSURE, true], /* поет-поетеса */
  [32, 'Віддам партизанові.', 'Віддам партизанці.', correctionTypes.UNSURE, true], /* циган-циганка */
  [32, 'належить шефові', 'належить шефині', correctionTypes.UNSURE, true], /* раб-рабиня */
  [32, 'багатирях', 'багатирках', correctionTypes.UNSURE, true], /* багатир-багатирка */
  [32, 'Зараз лях - це поляк.', 'Зараз ляшка - це полячка.', [correctionTypes.UNSURE, correctionTypes.UNSURE], true], /* монах-монашка+ */
  [32, 'казаха тут не бачив', 'казашки тут не бачив', correctionTypes.UNSURE, true], /* чех-чешка */
  [32, 'Ах ти, вертихвосте!', 'Ах ти, вертихвістко!', correctionTypes.UNSURE, true], /* вертихвіст-вертихвістка */
  [32, 'Моїм співучням присвячується', 'Моїм співученицям присвячується', correctionTypes.UNSURE, true], /* учень-учениця */
  [32, 'І лемку, і всім', 'І лемкині, і всім', correctionTypes.UNSURE, true], /* бойко-бойкиня */
  [32, 'Треба помолитися богу.', 'Треба помолитися богині.', correctionTypes.UNSURE, true], /* бог-богиня */
  [32, 'Це — критик.', 'Це — критикеса.', correctionTypes.UNSURE, true], /* критик-критикеса */
  [32, 'Що там із моїми голубками?', 'Що там із моїми голубочками?', correctionTypes.UNSURE, true], /* голубок-голубочка */
  [32, 'Тут навчаються консьєржі', 'Тут навчаються консьєржки', correctionTypes.UNSURE, true], /* консьєрж-консьєржка */
  [32, 'Не застав КУРКУЛІВ', 'Не застав КУРКУЛЬОК', correctionTypes.UNSURE, true], /* куркуль-куркулька */
  [32, 'Маляре, ти де?', 'Малярко, ти де?', correctionTypes.UNSURE, true], /* маляр-малярка */
  [32, 'угринові', 'угринці', correctionTypes.UNSURE, true], /* угрин-угринка */
  [32, 'Ви, шапсуже, помиляєтеся.', 'Ви, шапсужко, помиляєтеся.', correctionTypes.UNSURE, true], /* шапсуг-шапсужка */
  [32, 'Жерці їдять', 'Жриці їдять', correctionTypes.UNSURE, true], /* жрець-жриця */
  [32, 'боярине, ну-бо', 'боярине, ну-бо', correctionTypes.UNSURE, true], /* боярин-бояриня */
  [32, 'У государях', 'У государинях', correctionTypes.UNSURE, true], /* государ-государиня */
  [32, 'Дайте сюди ґазду!', 'Дайте сюди ґаздиню!', correctionTypes.UNSURE, true], /* ґазда-ґаздиня */
  [32, 'Майстрів теж сюди.', 'Майстринь теж сюди.', correctionTypes.UNSURE, true], /* майстер-майстриня */
  [32, 'Царі мудрі.', 'Цариці мудрі.', correctionTypes.UNSURE, true], /* цар-цариця */
  [32, 'Віддамо все ченцям, так.', 'Віддамо все черницям, так.', correctionTypes.UNSURE, true], /* чернець-черниця */

  [32, 'Віктор Ігорович Чернай', 'Віктор Ігорьович Чернай', correctionTypes.MISTAKE],
  [32, 'Ігоровича бачив?', 'Ігорьовича бачив?', correctionTypes.MISTAKE],
  [32, 'Цей — ІГОРОВИЧІВСЬКИЙ.', 'Цей — ІГОРЬОВИЧІВСЬКИЙ.', correctionTypes.MISTAKE],
  [32, 'Ігоревич', 'Ігорьович', correctionTypes.MISTAKE],
  [32, 'Петру Ігоревичеві', 'Петру Ігорьовичеві', correctionTypes.MISTAKE],
  [_, 'А де Ігор?', 'А де Ігор?', _],

  [32, 'На дворі багато необільшовизму.', 'На дворі багато необільшовізму.', correctionTypes.MISTAKE],
  [32, 'Більшовизм', 'Більшовізм', correctionTypes.MISTAKE],
  [32, 'Кожен боротьбист має знати своє місце.', 'Кожен боротьбіст має знати своє місце.', correctionTypes.MISTAKE],
  [32, 'Побутовисти — джерело зла.', 'Побутовісти — джерело зла.', correctionTypes.MISTAKE],
  [32, 'МЕНШОВИЗМИ', 'МЕНШОВІЗМИ', correctionTypes.MISTAKE],

  [35, 'стодвохактна вистава', 'стодвоактна вистава', correctionTypes.MISTAKE],
  [35, 'Великий двохелектрод', 'Великий двоелектрод', correctionTypes.MISTAKE],
  [35, 'ДВОХОКСИД', 'ДВООКСИД', correctionTypes.MISTAKE],
  [35, 'Остання двохтижнева відпустка.', 'Остання двотижнева відпустка.', correctionTypes.MISTAKE],
  [35, 'Двох\'ярусний', 'Двоярусний', correctionTypes.MISTAKE],
  [_, 'Посиділи удвох', 'Посиділи удвох', _],
  [_, 'Двохвилинна виставка', 'Двохвилинна виставка', _],
  [_, 'Стодвохвилинна вистава', 'Стодвохвилинна вистава', _],
  [_, 'Це — двохвіст', 'Це — двохвіст', _],
  [_, 'Якщо когось облити двохромовокислою сумішшю, він цього не зрозуміє.', 'Якщо когось облити двохромовокислою сумішшю, він цього не зрозуміє.', _],
  [_, 'У двохтисячному році настало нове тисячоліття.', 'У двохтисячному році настало нове тисячоліття.', _],
  [35, 'трьохатомність', 'триатомність', correctionTypes.MISTAKE],
  [35, 'Що таке трьохокисень?', 'Що таке триокисень?', correctionTypes.MISTAKE],
  [35, 'Вау! Тисячатрьохкілометрова черга.', 'Вау! Тисячатрикілометрова черга.', correctionTypes.MISTAKE],
  [35, 'Я зустріла трьох’єству істоту...', 'Я зустріла триєству істоту...', correctionTypes.MISTAKE],
  [_, 'Ви наша трьохмільйонна відвідувачка!', 'Ви наша трьохмільйонна відвідувачка!', _],
  [_, 'трильярдний борг', 'трильярдний борг', _],
  [_, 'стотрьохтрильярдний борг', 'стотрьохтрильярдний борг', _],
  [35, 'Чотирьохосьова клавіатура', 'Чотириосьова клавіатура', correctionTypes.MISTAKE],
  [35, 'Намалюй мільйонтисячасточотирьохкутник!', 'Намалюй мільйонтисячасточотирикутник!', correctionTypes.MISTAKE],
  [_, 'Чи знаєш ти тих чотирьох?', 'Чи знаєш ти тих чотирьох?', _],
  [_, 'вчотирьохно', 'вчотирьохно', _],
  [_, 'У чотирьохсотому випадку', 'У чотирьохсотому випадку', _],
  [_, 'Чотирьохмільярдний раз', 'Чотирьохмільярдний раз', _],
  [_, 'ЧОТИРЬОХТРИЛЬЙОННА КІЛЬКІСТЬ', 'ЧОТИРЬОХТРИЛЬЙОННА КІЛЬКІСТЬ', _],

  [35, 'Слід пройти фотохіміотерапію.', 'Слід пройти фотохімієтерапію.', correctionTypes.IMPROVEMENT],
  [35, 'Хіміопрепарат цей дуже потужний.', 'Хімієпрепарат цей дуже потужний.', correctionTypes.IMPROVEMENT],
  [35, 'ІСТОРІОТВОРЧА ІНІЦІАТИВА', 'ІСТОРІЄТВОРЧА ІНІЦІАТИВА', correctionTypes.IMPROVEMENT],
  [35, 'Націотвірний механізм', 'Націєтвірний механізм', correctionTypes.IMPROVEMENT],
  [35, 'націо- й державотвірні процеси', 'націє- й державотвірні процеси', correctionTypes.UNSURE],
  [35, 'Хтось захопився націознавством.', 'Хтось захопився націєзнавством.', correctionTypes.IMPROVEMENT],
  [35, 'Не бачив ще такого підступного бактеріоносія!', 'Не бачив ще такого підступного бактерієносія!', correctionTypes.IMPROVEMENT],
  [35, 'Це все бактеріовловлювацькі штучки...', 'Це все бактерієвловлювацькі штучки...', correctionTypes.IMPROVEMENT],
  [35, 'Артеріовенозні препарати', 'Артерієвенозні препарати', correctionTypes.IMPROVEMENT],
  [35, 'Бактеріо- та вірусовловлювач', 'Бактеріє- та вірусовловлювач', correctionTypes.UNSURE],
  [_, 'Підручник з бактеріології', 'Підручник з бактеріології', _],
  [_, 'Націогенний механізм', 'Націогенний механізм', _],
  [_, 'Що таке хіміотаксис?', 'Що таке хіміотаксис?', _],
  [_, 'Частинка "бактеріо" теж має право на існування.', 'Частинка "бактеріо" теж має право на існування.', _],

  [35, 'Багат-вечори року', 'Багатвечори року', correctionTypes.MISTAKE],
  [35, 'Свят-вечори року', 'Святвечори року', correctionTypes.MISTAKE],
  [35, 'Прийти на багат-вечір ще нічого не значить.', 'Прийти на багатвечір ще нічого не значить.', correctionTypes.MISTAKE],
  [35, 'Прийти на свят-вечір ще нічого не значить.', 'Прийти на святвечір ще нічого не значить.', correctionTypes.MISTAKE],
  [35, 'БАГАТ-ВЕЧІРНЄ БАГАТТЯ', 'БАГАТВЕЧІРНЄ БАГАТТЯ', correctionTypes.MISTAKE],
  [35, 'СВЯТ-ВЕЧІРНЄ СВЯТО', 'СВЯТВЕЧІРНЄ СВЯТО', correctionTypes.MISTAKE],
  [_, 'Ранки-вечори', 'Ранки-вечори', _],
  [_, 'Багато свят-багато мороки', 'Багато свят-багато мороки', _],

  [35, 'Зайшов до арт-студії.', 'Зайшов до артстудії.', correctionTypes.MISTAKE],
  [35, 'Бліц-опитування', 'Бліцопитування', correctionTypes.MISTAKE],
  [35, 'Веб-сторінка університету', 'Вебсторінка університету', correctionTypes.MISTAKE],
  [35, 'віце-прем’єр-міністр', 'віцепрем’єр-міністр', correctionTypes.MISTAKE],
  [35, 'Віце-прем\'єр-міністр', 'Віцепрем\'єр-міністр', correctionTypes.MISTAKE],
  [35, 'Оце економ-клас?', 'Оце економклас?', correctionTypes.MISTAKE],
  [35, 'Це медаль екс-чемпіонки!', 'Це медаль ексчемпіонки!', correctionTypes.MISTAKE],
  [35, 'Пісню виконав фолк-гурт.', 'Пісню виконав фолкгурт.', correctionTypes.MISTAKE],
  [35, 'Штабс-капітанська квартира :-)', 'Штабскапітанська квартира :-)', correctionTypes.MISTAKE],
  [35, 'Усі ходять або в максі-одязі, або в міні-спідницях.', 'Усі ходять або в максіодязі, або в мініспідницях.', [correctionTypes.MISTAKE, correctionTypes.MISTAKE]],
  [35, 'У диско-клубі медіа-лінгвістикою не займаються.', 'У дискоклубі медіалінгвістикою не займаються.', [correctionTypes.MISTAKE, correctionTypes.MISTAKE]],
  [35, 'КІБЕР-ЗЛОЧИНЕЦЬ', 'КІБЕРЗЛОЧИНЕЦЬ', correctionTypes.UNSURE],
  [35, 'У пошуках КОНТР-АДМІРАЛ-ІНЖЕНЕРА', 'У пошуках КОНТРАДМІРАЛ-ІНЖЕНЕРА', correctionTypes.UNSURE],
  [35, 'Придбав собі міні-ЕОМ.', 'Придбав собі мініЕОМ.', correctionTypes.UNSURE],
  [_, 'усі, хто проживав на території екс-Югославії', 'усі, хто проживав на території екс-Югославії', _],
  [_, 'Поп-Європа проти рок-Америки', 'Поп-Європа проти рок-Америки', _],
  [_, 'Добре артикулювати важливо.', 'Добре артикулювати важливо.', _],
  [_, 'Префікси арт- та інші, схожі на «арт», пишемо зі словом разом.', 'Префікси арт- та інші, схожі на «арт», пишемо зі словом разом.', _],

  [35, 'Зустрічатися з боді-білдером прикольно.', 'Зустрічатися з бодибілдером прикольно.', correctionTypes.MISTAKE],
  [35, 'боді-білдерський', 'бодибілдерський', correctionTypes.MISTAKE],
  [35, 'Бодібілдерство', 'Бодибілдерство', correctionTypes.MISTAKE],
  [35, 'боди-білдерка', 'бодибілдерка', correctionTypes.MISTAKE],
  [35, 'Їхнє захоплення - боді-арт.', 'Їхнє захоплення - бодіарт.', correctionTypes.MISTAKE],
  [35, 'БОДИ-АРТ', 'БОДІАРТ', correctionTypes.MISTAKE],
  [35, 'бодиарт', 'бодіарт', correctionTypes.MISTAKE],
  [35, 'Бодігард знайшов боді-гарда.', 'Бодигард знайшов бодигарда.', [correctionTypes.MISTAKE, correctionTypes.MISTAKE]],
  [_, 'бодибілдинг', 'бодибілдинг', _],
  [_, 'Бодипірсинговий', 'Бодипірсинговий', _],
  [_, 'БОДИГАРД', 'БОДИГАРД', _],
  [_, 'Досить бодатися!', 'Досить бодатися!', _],
  [_, 'Дуже красивий бодіарт!', 'Дуже красивий бодіарт!', _],
  [_, 'Боді -- одна з найнеобхідніших речей.', 'Боді -- одна з найнеобхідніших речей.', _],
  [_, 'Префікси боді- та «боди-» пишемо разом.', 'Префікси боді- та «боди-» пишемо разом.', _],

  [35, 'Я живу в будинку № 29д.', 'Я живу в будинку № 29-Д.', correctionTypes.MISTAKE],
  [35, 'Корпус 5-з', 'Корпус 5-З', correctionTypes.MISTAKE],
  [35, '10А будівля', '10-А будівля', correctionTypes.MISTAKE],
  [35, 'А це 9765Ж будівля.', 'А це 9765-Ж будівля.', correctionTypes.MISTAKE],
  [35, '123ґ', '123-Ґ', correctionTypes.MISTAKE],
  [_, 'Буд. 52-Г', 'Буд. 52-Г', _],
  [_, 'Том а-б.', 'Том а-б.', _],
  [_, 'Суфікс -в не дуже поширений.', 'Суфікс -в не дуже поширений.', _],
  [_, '70-3 буде 67', '70-3 буде 67', _],
  [_, '40- і 50-бв.', '40- і 50-бв.', _],

  [35, 'Кожен хворий на ВІЛСНІД має бути обережним.', 'Кожен хворий на ВІЛ-СНІД має бути обережним.', correctionTypes.MISTAKE],
  [35, 'Кожен хворий на ВІЛ СНІД має бути обережним.', 'Кожен хворий на ВІЛ-СНІД має бути обережним.', correctionTypes.MISTAKE],
  [35, 'Кожен хворий на ВІЛ/СНІД має бути обережним.', 'Кожен хворий на ВІЛ-СНІД має бути обережним.', correctionTypes.MISTAKE],
  [35, 'Скажемо ВІЛСНІДові ні!', 'Скажемо ВІЛ-СНІДові ні!', correctionTypes.MISTAKE],
  [35, '  Скажемо ВІЛ  СНІДові ні! ', '  Скажемо ВІЛ-СНІДові ні! ', correctionTypes.MISTAKE],
  [35, 'Скажемо ВІЛ/СНІДові ні!', 'Скажемо ВІЛ-СНІДові ні!', correctionTypes.MISTAKE],
  [35, 'ВІЛСНІД', 'ВІЛ-СНІД', correctionTypes.MISTAKE],
  [35, 'ВІЛ СНІД' /* non-breaking space */, 'ВІЛ-СНІД', correctionTypes.MISTAKE],
  [35, 'ВІЛ/СНІД', 'ВІЛ-СНІД', correctionTypes.MISTAKE],
  [_, 'ВІЛ', 'ВІЛ', _],
  [_, 'СНІД', 'СНІД', _],
  [_, ' ', ' ', _],
  [_, '/', '/', _],
  [_, 'Віл СНІДу не підлягає.', 'Віл СНІДу не підлягає.', _],

  [36, 'Кожен людино-день коштує ціле багатство.', 'Кожен людинодень коштує ціле багатство.', correctionTypes.MISTAKE],
  [36, 'Людино-днів багато, людина одна.', 'Людиноднів багато, людина одна.', correctionTypes.MISTAKE],
  [36, '2 машино-години', '2 машиногодини', correctionTypes.MISTAKE],
  [36, 'СТО ВАГОНО-ГОДИН', 'СТО ВАГОНОГОДИН', correctionTypes.MISTAKE],
  [36, 'Для вас виділено ліжко-місце!', 'Для вас виділено ліжкомісце!', correctionTypes.MISTAKE],
  [36, 'Під людино-зміною мають на увазі зміну однієї людини.', 'Під людинозміною мають на увазі зміну однієї людини.', correctionTypes.MISTAKE],
  [36, 'Людино-ліжок не вистачає...', 'Людиноліжок не вистачає...', correctionTypes.MISTAKE],
  [36, 'Додаткових 1234 тонно-миль.', 'Додаткових 1234 тонномиль.', correctionTypes.MISTAKE],
  [36, 'Скільки ще пасажиро-кілометрів нам потрібно набрати?', 'Скільки ще пасажирокілометрів нам потрібно набрати?', correctionTypes.MISTAKE],
  [36, 'Кожен літако-виліт цього судна рахується за два літако-вильоти.', 'Кожен літаковиліт цього судна рахується за два літаковильоти.', [correctionTypes.MISTAKE, correctionTypes.MISTAKE]],
  [_, 'Людино! Година твоя пройшла.', 'Людино! Година твоя пройшла.', _],
  [_, 'Слова машин-годин римуються.', 'Слова машин-годин римуються.', _],
  [_, 'Це ліжко - місце твого кота.', 'Це ліжко - місце твого кота.', _],
  [_, 'Тонномилі', 'Тонномилі', _],

  [36, 'Позичила піваркуша паперу.', 'Позичила пів аркуша паперу.', correctionTypes.UNSURE],
  [36, 'Піввідра пива — в нікуди.', 'Пів відра пива — в нікуди.', correctionTypes.UNSURE],
  [36, 'ВАШІ ПІВГОДИНИ', 'ВАШІ ПІВ ГОДИНИ', correctionTypes.UNSURE],
  [36, 'Об’їздити пів-Європи встигнути б.', 'Об’їздити пів Європи встигнути б.', correctionTypes.UNSURE],
  [36, 'Ого. Пів-Києва на ногах.', 'Ого. Пів Києва на ногах.', correctionTypes.UNSURE],
  [36, 'З’їм-но пів’яблука.', 'З’їм-но пів яблука.', correctionTypes.UNSURE],
  [36, 'Пів\'юшки теж вип\'ю.', 'Пів юшки теж вип\'ю.', correctionTypes.UNSURE],
  [_, 'Пів- на пів.', 'Пів- на пів.', _],
  [_, 'Узяв півтора півника.', 'Узяв півтора півника.', _],
  [_, 'Південне сонце, північні хмари', 'Південне сонце, північні хмари', _],
  [_, 'Святкуємо півріччя!', 'Святкуємо півріччя!', _],
  [_, 'Півторагодинний МАРАФОН', 'Півторагодинний МАРАФОН', _],
  [_, 'Півень нюхає півонію :D', 'Півень нюхає півонію :D', _],
  [_, 'За півонією вже вибудувалися півнячі черги!', 'За півонією вже вибудувалися півнячі черги!', _],

  [36, 'Вчора зустрічалися з член-кореспондентом НАН.', 'Вчора зустрічалися з членом-кореспондентом НАН.', correctionTypes.MISTAKE],
  [36, 'Віддай це член-кореспонденту.', 'Віддай це членові-кореспонденту.', correctionTypes.MISTAKE],
  [36, 'Член-кореспондентові', 'Члену-кореспондентові', correctionTypes.MISTAKE],
  [36, 'На член-кореспонденті лежить велика відповідальність.', 'На членові-кореспонденті лежить велика відповідальність.', correctionTypes.MISTAKE],
  [36, 'НАС ЗУСТРІЧАТИМУТЬ ЧЛЕН-КОРЕСПОНДЕНТИ', 'НАС ЗУСТРІЧАТИМУТЬ ЧЛЕНИ-КОРЕСПОНДЕНТИ', correctionTypes.MISTAKE],
  [36, 'Понюхаю брат-і-сестру, побачу член-кореспондента, а потім ще кількох член-кореспондентів.', 'Понюхаю брата-і-сестру, побачу члена-кореспондента, а потім ще кількох членів-кореспондентів.', [correctionTypes.MISTAKE, correctionTypes.MISTAKE, correctionTypes.MISTAKE]],
  [36, 'Захоплений брат-і-сестрою, що росте у нас у саді!', 'Захоплений братом-і-сестрою, що росте у нас у саді!', correctionTypes.MISTAKE],
  [36, 'Чи не бачив брат-і-сестер?', 'Чи не бачив братів-і-сестер?', correctionTypes.MISTAKE],
  [36, 'А хоча б одну квітку брат-і-сестри?', 'А хоча б одну квітку брата-і-сестри?', correctionTypes.MISTAKE],
  [36, 'Брат-і-сестрі завдячуючи', 'Брату-і-сестрі завдячуючи', correctionTypes.MISTAKE],
  [36, 'БРАТ-І-СЕСТРО, де ти?', 'БРАТЕ-І-СЕСТРО, де ти?', correctionTypes.MISTAKE],
  [_, 'Надіслати б щось на член-кореспондентську адресу...', 'Надіслати б щось на член-кореспондентську адресу...', _],
  [_, 'Оце член-кореспондент.', 'Оце член-кореспондент.', _],
  [_, 'Брат і сестри не має.', 'Брат і сестри не має.', _],
  [_, 'Брат-сестрі', 'Брат-сестрі', _],
  [_, 'Смачна брат-і-сестра.', 'Смачна брат-і-сестра.', _],

  [40, 'Це гроші з золотовалютного резерву.', 'Це гроші з золото-валютного резерву.', correctionTypes.MISTAKE],
  [40, 'Золотовалютні заощадження', 'Золото-валютні заощадження', correctionTypes.MISTAKE],
  [_, 'Золото валютне!', 'Золото валютне!', _],

  [46, 'Прозвучала пісня (Оплески)', 'Прозвучала пісня (оплески)', correctionTypes.UNSURE],
  [46, 'Прозвучала «пісня» (Тривалі оплески).', 'Прозвучала «пісня» (тривалі оплески).', correctionTypes.UNSURE],
  [46, 'І (Вийшла)!', 'І (вийшла)!', correctionTypes.UNSURE],
  [46, 'Привіт,  (Хто це?)', 'Привіт,  (хто це?)', correctionTypes.UNSURE],
  [46, 'Хто? - (спитав) (Я!)', 'Хто? - (спитав) (я!)', correctionTypes.UNSURE],
  [_, 'Хто? - (спитав.) (Я!)', 'Хто? - (спитав.) (Я!)', _],
  [_, 'Пролунала поезія (ЗАХОПЛЕННЯ)', 'Пролунала поезія (ЗАХОПЛЕННЯ)', _],
  [_, 'І ще (АоА).', 'І ще (АоА).', _],
  [_, '(Зауваження)', '(Зауваження)', _],
  [_, '  (Зауваження)  ', '  (Зауваження)  ', _],
  [_, '(Нове) і (старе)... (Старе) і (нове)!', '(Нове) і (старе)... (Старе) і (нове)!', _],
  [_, 'Написали нову статтю. (Дуже цікаву.)', 'Написали нову статтю. (Дуже цікаву.)', _],
  [_, 'Прощайте! (Вийшла)', 'Прощайте! (Вийшла)', _],
  [_, 'Де всі? (Не знаю).', 'Де всі? (Не знаю).', _],
  [_, 'Навіщо?.. (навіщо?!) (Навіщо?..)', 'Навіщо?.. (навіщо?!) (Навіщо?..)', _],
  [_, 'Кожне Слово Цих. Речень Написано З Великої, Або з Малої Літери!', 'Кожне Слово Цих. Речень Написано З Великої, Або з Малої Літери!', _],

  [49, 'Зустрів по дорозі ван Гога.', 'Зустрів по дорозі Ван Гога.', correctionTypes.MISTAKE],
  [49, 'Так, ван Гог — найкращий.', 'Так, Ван Гог — найкращий.', correctionTypes.MISTAKE],
  [49, 'Привіт ван ГОГОВІ!', 'Привіт Ван ГОГОВІ!', correctionTypes.MISTAKE],
  [_, 'Зустрів по дорозі ван Бетховена.', 'Зустрів по дорозі ван Бетховена.', _],
  [_, 'Тут багато ван', 'Тут багато ван', _],
  [_, 'Ван Гог', 'Ван Гог', _],
  [_, 'Це ВАН Гог', 'Це ВАН Гог', _],

  [49, 'Чо Чі-вон', 'Чхве Чхвівон', [correctionTypes.MISTAKE, correctionTypes.MISTAKE]],
  [49, 'Нічого не зробиш без Чхе Чхи-Вона...', 'Нічого не зробиш без Чхве Чхвівона...', [correctionTypes.MISTAKE, correctionTypes.MISTAKE]],
  [49, 'Чхво Чи Вон тут ні до чого.', 'Чхве Чхвівон тут ні до чого.', [correctionTypes.MISTAKE, correctionTypes.MISTAKE, correctionTypes.MISTAKE], false, 2],
  [49, 'Віддати Чхо Чхі Вонові належне', 'Віддати Чхве Чхвівонові належне', [correctionTypes.MISTAKE, correctionTypes.MISTAKE, correctionTypes.MISTAKE]],
  [49, 'ЧХВИ-ВОНІВСЬКИЙ СПАДОК', 'ЧХВІВОНІВСЬКИЙ СПАДОК', correctionTypes.MISTAKE],
  [49, 'Його прізвище — Чхві Вон або Чхві-вон.', 'Його прізвище — Чхвівон або Чхвівон.', [correctionTypes.MISTAKE, correctionTypes.MISTAKE]],
  [49, 'Привіт Чхивону!', 'Привіт Чхвівону!', correctionTypes.MISTAKE],
  [_, 'Чхво чи Вон тут ні до чого.', 'Чхво чи Вон тут ні до чого.', _],
  [_, 'І чи Вон, чи Він його звали — не пам’ятаю.', 'І чи Вон, чи Він його звали — не пам’ятаю.', _],
  [_, 'Чо? Чи чіпав чхання?', 'Чо? Чи чіпав чхання?', _],

  [49, 'Привітаймо Ван Со з ювілеєм!', 'Привітаймо Вансо з ювілеєм!', correctionTypes.MISTAKE],
  [49, 'Ван-со чи Ван-Со писати неправильно, правильно писати Вансо', 'Вансо чи Вансо писати неправильно, правильно писати Вансо', [correctionTypes.MISTAKE, correctionTypes.MISTAKE]],
  [49, 'ПАК ВАН СО.', 'ПАК ВАНСО.', correctionTypes.MISTAKE],
  [_, 'Ван. Со то таке?', 'Ван. Со то таке?', _],
  [_, 'Ван Сольний концерт дає', 'Ван Сольний концерт дає', _],

  [49, 'Давно нічого не чути про Пан Гі Муна...', 'Давно нічого не чути про Пан Гімуна...', correctionTypes.MISTAKE],
  [49, 'Гі мун усе бачить.', 'Гімун усе бачить.', correctionTypes.MISTAKE],
  [49, 'Пан Гі-Мунові з іншими Гі-мунами нічого робити!', 'Пан Гімунові з іншими Гімунами нічого робити!', [correctionTypes.MISTAKE, correctionTypes.MISTAKE]],
  [49, 'Дуже гарне прізвище Гі-Мун', 'Дуже гарне прізвище Гімун', correctionTypes.MISTAKE],
  [_, 'Пан Гі все розповів.', 'Пан Гі все розповів.', _],
  [_, 'Місяць англійською буде мун.', 'Місяць англійською буде мун.', _],

  [49, 'Мала знайомого на ім’я Ричард.', 'Мала знайомого на ім’я Річард.', correctionTypes.MISTAKE],
  [49, 'РИЧАРДОМ – так його звали', 'РІЧАРДОМ – так його звали', correctionTypes.MISTAKE],
  [49, 'Це все ричардівські штучки!', 'Це все річардівські штучки!', correctionTypes.MISTAKE],
  [_, 'Ричання тигрів', 'Ричання тигрів', _],
];

function processText(text) {
  const tokens = tokenize(text);
  const replaced = [];
  const chain = new TokenChain(tokens);
  const encounteredTypes = [];
  const encounteredDescriptions = [];
  let encounteredExtraChange = false;
  while (chain.hasMore()) {
    chain.next();
    const application = processToken(chain);
    if (application === null) {
      replaced.push(chain.getCurrentToken());
    } else {
      if (application.removeWhitespaceBefore && replaced.length > 0 && isWhitespace(replaced[replaced.length - 1])) {
        replaced.pop();
      }
      replaced.push(application.replacement);
      encounteredExtraChange = encounteredExtraChange || application.requiresExtraChange;
      encounteredTypes.push(application.type);
      encounteredDescriptions.push(...application.descriptions);
    }
  }
  return {
    processed: replaced.join(''),
    encounteredTypes,
    encounteredDescriptions,
    encounteredExtraChange
  };
}

function test(tests) {
  let succeeded = 0;
  let failed = 0;

  tests.forEach(([sections, text, corrected, types, extraChange, processings]) => {
    extraChange = extraChange || false;
    processings = processings || 1;
    let current = text;
    const encounteredTypes = [];
    const encounteredDescriptions = [];
    let encounteredExtraChange = false;
    for (let i = 0; i < processings; i++) {
      const {
        processed: next,
        encounteredTypes: types,
        encounteredDescriptions: descriptions,
        encounteredExtraChange: extraChange
      } = processText(current);
      current = next;
      encounteredTypes.push(...types);
      encounteredDescriptions.push(...descriptions);
      encounteredExtraChange = encounteredExtraChange || extraChange;
    }
    const processed = current;
    const errors = [];
    if (processed !== corrected) {
      errors.push(`Results differ: "${processed}" instead of expected "${corrected}"`);
    }
    if (encounteredExtraChange !== extraChange) {
      errors.push(`Extra change is ${encounteredExtraChange ? 'required' : 'not required'}, but expected otherwise`);
    }
    const expectedTypes = (Array.isArray(types) ? types : [types]).join(',');
    const actualTypes = encounteredTypes.join(',');
    if (actualTypes !== expectedTypes) {
      errors.push(`Types differ: "${actualTypes}" instead of expected "${expectedTypes}"`);
    }
    const actualDescriptions = encounteredDescriptions.join('; ');
    (Array.isArray(sections) ? sections : [sections]).forEach((section) => {
      if (!actualDescriptions.match(new RegExp(`§\\s*${section}(?!\d)`))) {
        errors.push(`Section "${section}" not found in descriptions "${actualDescriptions}"`);
      }
    });
    const reprocessed = processText(processed).processed;
    if (reprocessed !== processed) {
      errors.push(`Reapplication of the rules returned "${reprocessed}" instead of expected "${processed}"`);
    }
    if (errors.length === 0) {
      succeeded++;
    } else {
      console.error(`Test "${text}" failed:`, ...errors);
      failed++;
    }
  });

  console.log(`Done running ${tests.length} tests: ${succeeded} succeeded, ${failed} failed`);
}

test(tests);