export const toponymsWithRiCommonRoots = [
  "Антананарів",
  "Гольфстрім",
  "Меріленд",
  "Фрітаун",
  "Коста-Рік",
  "Коста-Ріц",
  "Арізон",
  "Трінідад",
  "Тріпол",
  "Сурінам",
  "Брісбен",
  "Прінстон",
  "Пуерто-Рік",
  "Цюріх"
];

export const toponymsWithRiForms = [{
  paradigm: ["і", "ів", "ям", "ями", "ях"],
  roots: [
    "Апрілц"
  ]
}, {
  paradigm: ["ка", "ки", "ко", "кою", "ку", "ці"],
  roots: [
    "Арі"
  ]
}, {
  paradigm: ["", "а", "ові", "ом", "у"],
  roots: [
    "Грінок"
  ]
}, {
  paradigm: ["", "ові", "ом", "у"],
  roots: [
    "Куперс-Крік"
  ]
}, {
  paradigm: ["еві", "ем", "і", "ь", "ю", "я"],
  roots: [
    "Брістол",
    "Грігоріопол"
  ]
}, {
  paradigm: ["", "а", "е", "еві", "ем", "і", "у"],
  roots: [
    "Ок-Рідж",
    "Оріндж"
  ]
}, {
  paradigm: ["сі", "ха", "хи", "хо", "хою", "ху"],
  roots: [
    "Пері",
    "Сьєрра-де-Пері"
  ]
}, {
  paradigm: ["г", "га", "гові", "гом", "гу", "зі"],
  roots: [
    "Пітермаріцбур",
    "Харрісбер"
  ]
}, {
  paradigm: ["є", "єю", "ї", "ю", "я"],
  roots: [
    "Горіці",
    "Комодоро-Рівадаві",
    "Тюрінгі"
  ]
}, {
  paradigm: ["га", "ги", "го", "гою", "гу", "зі"],
  roots: [
    "Даріган",
    "Нерін",
    "Хуріб"
  ]
}, {
  paradigm: ["", "е", "і", "ові", "ом", "у"],
  roots: [
    "Джарін-Нур",
    "Лох-Корріб",
    "Орін-Нур",
    "Ріханд"
  ]
}, {
  paradigm: ["а", "и", "і", "о", "ою", "у"],
  roots: [
    "Аурізін",
    "Грінав",
    "Квіріл",
    "Курітіб",
    "Лерід",
    "Мерід",
    "Орісаб",
    "Петріл",
    "Пірін-Планін",
    "Різ"
  ]
}, {
  paradigm: [""],
  roots: [
    "Акарігуа",
    "Апрікі",
    "Аудріні",
    "Ауріно",
    "Баріто",
    "Берісо",
    "Бріндізі",
    "Дора-Ріпаріа",
    "Йорігуті",
    "Каріпіто",
    "Катеріні",
    "Кірігуа",
    "Кофорідуа",
    "Куріко",
    "Меріборо",
    "Морігуті",
    "Наріньо",
    "Оріноко",
    "Періге",
    "Пріпсіпі",
    "Рібатежу",
    "Рібейран-Прету",
    "Ріволі",
    "Різе",
    "Ріміні",
    "Рінгвассе",
    "Ріслі",
    "Сан-Жуан-ді-Меріті"
  ]
}, {
  paradigm: ["", "а", "е", "і", "ові", "ом", "у"],
  roots: [
    "Барісан",
    "Бріджпорт",
    "Бріджтаун",
    "Брістен",
    "Бурірам",
    "Воррінгтон",
    "Горіс",
    "Горічан",
    "Гріффен",
    "Ерісентпетер",
    "Зларін",
    "Ілорін",
    "Кайшадоріс",
    "Касре-Ширін",
    "Кассерін",
    "Лентваріс",
    "Мазарі-Шаріф",
    "Матурін",
    "Меарін",
    "Мірін",
    "Монтгомерішир",
    "Мюріц",
    "Наріманабад",
    "Потрерільос",
    "Рас-Гаріб",
    "Ріверсайд",
    "Санкт-Спірітус",
    "Сент-Катарінс",
    "Тебріз",
    "Трір",
    "Уоррінгтон",
    "Фредрікстад",
    "Фрібур",
    "Фріпорт",
    "Шверін",
    "Ширін",
    "Шрівпорт"
  ]
}];