export const websites = [{
  paradigm: ["є", "єю", "ї", "й", "ю", "я", "ям", "ями", "ях"],
  roots: [
    "вікіпеді"
  ]
}, {
  paradigm: ["", "а", "ам", "ами", "ах", "е", "и", "і", "ів", "ові", "ом", "у"],
  masculineGenitiveSuffixes: ["а"],
  roots: [
    "амазон",
    "блогспот", "блоґспот",
    "вконтакт",
    "гітхаб", "ґітхаб",
    "гугл", "ґуґл",
    "інстаграм", "інстраґрам",
    "лінкедін", "лінктін", "лінктин",
    "нетфлікс",
    "пейпал", "пейпел",
    "пінтерест",
    "порнхаб",
    "редіт", "реддіт",
    "твітер", "твіттер",
    "ютюб", "ютьюб", "ютуб",
    "укрнет",
    "яндекс"
  ]
}, {
  paradigm: ["к", "ка", "кам", "ками", "ках", "ки", "ків", "кові", "ком", "ку", "ці"],
  masculineGenitiveSuffixes: ["ка"],
  roots: [
    "сле",
    "фейсбу"
  ]
}, {
  paradigm: ["г", "га", "гам", "гами", "гах", "ги", "гів", "гові", "гом", "гу", "зі",
             "ґ", "ґа", "ґам", "ґами", "ґах", "ґи", "ґів", "ґові", "ґом", "ґу"],
  masculineGenitiveSuffixes: ["га", "ґа"],
  roots: [
    "бін"
  ]
}, {
  paradigm: ["єві", "єм", "ї", "їв", "й", "ю", "я", "ям", "ями", "ях"],
  masculineGenitiveSuffixes: ["я"],
  roots: [
    "ібе"
  ]
}, {
  paradigm: [""],
  roots: [
    "вікшинарі",
    "вімео",
    "яху"
  ]
}];

export const websiteTypes = [
  "банкінг", "банкінґ",
  "блог", "блоґ",
  "енциклопеді",
  "мереж",
  "платформ",
  "портал",
  "ресурс",
  "сайт",
  "сервіс",
  "систем",
  "трекер",
  "хостинг", "хостинґ"
];