export const data = {
  masculineSuffix: "",
  feminineSuffix: "",
  paradigm: {
    "": "ка",
    "а": [
      "ки",
      "ку"
    ],
    "ам": "кам",
    "ами": "ками",
    "ах": "ках",
    "еві": "ці",
    "ем": "кою",
    "і": [
      "ки",
      "ці"
    ],
    "ів": "ок",
    "у": [
      "ці",
      "ко"
    ]
  },
  roots: [
    "дідич",
    "діяч",
    "завуч",
    "інгуш",
    "користувач",
    "латиш",
    "мальгаш",
    "москвич",
    "прародич",
    "родич",
    "сіяч",
    "співтовариш",
    "талиш",
    "товариш",
    "чуваш"
  ]
};