const cars = [{
  paradigm: ["", "а", "ам", "ами", "ах", "и", "і", "о", "ою", "у"],
  roots: [
    "Лад",
    "Мазд",
    "Тесл",
    "Тойот",
    "Хонд",
    "Шкод"
  ]
}, {
  paradigm: ["є", "єю", "ї", "й", "ю", "я", "ям", "ями", "ях"],
  roots: [
    "Дачі",
    "Таврі"
  ]
}, {
  paradigm: ["", "а", "ам", "ами", "ах", "е", "и", "і", "ів", "ові", "ом", "у"],
  roots: [
    "Джип",
    "Кадилак",
    "Крайслер",
    "Ланос",
    "Лексус",
    "Лендровер",
    "Макларен",
    "Мерседес",
    "Нісан", "Ніссан",
    "Ренджровер", "Ренжровер",
    "Роллс-ройс", "Роллс-Ройс", "Ролс-ройс", "Ролс-Ройс",
    "Ситроен", "Ситроєн", "Сітроен", "Сітроєн",
    "Фіат",
    "Фольксваген", "Фольксваґен",
    "Форд",
    "Хамер", "Хаммер",
    "Ягуар", "Яґуар"
  ]
}, {
  paradigm: ["сі", "х", "ха", "хам", "хами", "хах", "хи", "хів", "хові", "хом", "ху"],
  roots: [
    "Майба"
  ]
}, {
  paradigm: ["еві", "ем", "і", "ів", "ь", "ю", "я", "ям", "ями", "ях"],
  roots: [
    "Жигул",
    "Опел"
  ]
}, {
  paradigm: ["єві", "єм", "ї", "їв", "й", "ю", "я", "ям", "ями", "ях"],
  roots: [
    "Хьюнда", "Хюнда", "Х'юнда"
  ]
}, {
  paradigm: [""],
  roots: [
    "Ауді",
    "Бентлі",
    "Бугатті", "Буґатті",
    "Вольво",
    "Деу",
    "Інфініті",
    "Ламборгіні", "Ламборґіні", "Ламборджині",
    "Мазераті", "Масераті",
    "Мітсубісі", "Мітсубіші",
    "Пежо",
    "Порше",
    "Рено",
    "Субару",
    "Сузукі",
    "Ферарі", "Феррарі",
    "Шевроле"
  ]
}];

const aircraft = [{
  paradigm: ["", "а", "ам", "ами", "ах", "е", "и", "і", "ів", "ові", "ом", "у"],
  roots: [
    "Аеробус",
    "Ан",
    "Бомбардир",
    "Ейрбас",
    "Ембраер", "Ембраєр",
    "Іл",
    "Суперджет"
  ]
}, {
  paradigm: ["к", "ка", "кам", "ками", "ках", "ки", "ків", "кові", "ком", "ку", "ці"],
  roots: [
    "Я"
  ]
}, {
  paradigm: ["г", "га", "гам", "гами", "гах", "ги", "гів", "гові", "гом", "гу", "зі",
             "ґ", "ґа", "ґам", "ґами", "ґах", "ґи", "ґів", "ґові", "ґом", "ґу"],
  roots: [
    "Боїн"
  ]
}, {
  paradigm: [""],
  roots: [
    "Ту"
  ]
}];

export const brands = [...cars, ...aircraft];